{"layout":"tutorial_slides","logo":"assets/images/gat.png","title":"Empathy","contributors":["hexylena","shiltemann"],"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"S00009","url":"/topics/admin/tutorials/empathy/slides.html","topic_name":"admin","tutorial_name":"empathy","dir":"topics/admin/tutorials/empathy","symlink":null,"id":"admin/empathy","ref_tutorials":[],"ref_slides":["## Part of the Job\n\nWe are not just janitors / code monkeys\n- We're humans with feelings\n- Our users are humans with feelings as well\n- Both groups need to be understanding of each other\n\nWe're (often) the point of contact for any problems\n- It's our responsibility to fix Galaxy problems\n- Or any server problems for our users\n- Or sometimes anything that is electrical is our problem\n\n???\n\nWe need to talk and not just talk but communicate with each other, listen to each other's complaints and problems. You can only control 1/2 of the equation, but you can have a positive impact on the balance.\n\nYou're also often the Tier 1 response to issues, so even when you're stressed, users often just want to feel heard, like they've told someone and their complaint has been heard. Doing this can help defuse bad situations where people are upset and feelings are hurt.\n\n---\n\n## SLAs vs SLOs\n\n- Academic services rarely have SLAs\n- But defining your own SLO can be good! Freedom to say \"it's ok, it will be down for some time\"\n\nEU SLOs (**not** SLAs)*\n\nService | SLO   | Permitted Outage (30d) | Critical | User-Facing?\n------- | ---   | ------------           | -----    | ------------\nHaproxy | 99.9% | 43 minutes             | Yes      | Yes\nCluster | 95.0% | 36 hours               | Yes      | No\nSentry  | 50.0% | 15 day                 | No       | No\nJenkins | 50.0% | 15 day                 | No       | Yes-ish\nGrafana | 50.0% | 15 day                 | No       | Yes-ish\n\n\n.footnote[\n\n\\* SLA = Service Level Agreement, SLO = Service Level Objective\n\n]\n\n???\n\n- SLA = Service Level Agreement, Legal agreement with your users, usually with financial penalties for failing to reach the level.\n- SLO = Service Level Objective, your goal for your service, showing your users you're committed to trying to reach that number.\n\nService Level Objectives are just your goals, not a legal agreement with your users. It's just a number that you plan to hit, that you can share with your users to give them an idea of your goals.\n\n---\n\n## Bad things happen\n\n- It's unavoidable with so many interconnected devices:\n\t- Network\n\t- DC\n\t- Server\n\t- Service\n- Be kind to your fellow admins/network engineers/support people, maybe it's their turn to have a bad day\n- Spend time engineering to avoid problems\n\t- But consider the system's SLA/SLO\n\n???\n\nReliability engineering is difficult\n\n---\n\n## Communication\n\nCommunication *Communication* **Communication**\n\n- Users often just want to know when the service will be back, or that their jobs are still running\n\t- So write helpful notifications before, during, after planned outages\n\t- [Write posts after unplanned outages](https://galaxyproject.eu/posts/2018/09/21/downtime/)\n\t- [Add graphics](https://galaxyproject.eu/posts/2018/07/12/workflow-outage/)\n- Try and be empathetic in your communications\n\t- Give users the benefit of the doubt\n\t- Acknowledge their feelings but try not to take it as a personal attack (even when it is.)\n- Emails:\n\t- When receiving (uncharacteristically) unpleasant ones, imagine a loved one wrote it? Wouldn't you give them a break?\n\t- When writing, imagine your loved one is receiving it. How would they feel?\n\n???\n\nCommon advice: respond calmly, do *not* send emails immediately, come back to it in a few hours\n\n---\n\n## Shared Responsibility\n\nDocumentation *Documentation* **Documentation**\n\n- Document your code/infrastructure/everything\n\t- [Various types of documentation](https://en.wikipedia.org/wiki/Software_documentation)\n- You will probably change jobs, and someone else will have to maintain your code\n- Someone else will debug your code at 3 AM and hate you\n\t- You've probably had to do the same with someone else's code\n\t- Write code to be read by humans first, and machines second\n\n???\n\nHave you ever had to debug something that was broken, late at night? And it was broken and someone else's fault and it didn't behave how it was documented? And you were up late swearing up and down at this other person for their bad code that's causing you to lose sleep?\n\nWe all do it to each other, we just have to try to be better. It's an uphill battle, and it's difficult every day to write that documentation and force yourself into these good habits.\n\n---\n\n## Small Changes, Big Impacts\n\n![EU User Registrations / Week](../../images/eu_users.png)\n![EU Jobs / Week](../../images/eu_jobs.png)\n\nBe careful with what changes you make in production; all of your users are depending on you to do their work\n\n???\n\nAny change you make to a production system is multiplied by the number of active users. As of this writing EU has ~800 monthly active users. Even small changes affect everyone so be careful and have a dev environment to deploy to first.\n\nAs an example, we had a partially working system, it was working for 95% of our users on friday night. One of our admins made a change in production to try and fix the 5%, but instead it took the system down for everyone. This is the sort of example of \"be really careful\" that is illuminating, not only was the service now offline for everyone (unlike the 95% functional case where we could have left it until monday morning), but the admin had to spend another hour reverting the changes.\n\n---\n\n## Self Care\n\nTake care of yourself! Being a sysadmin is a difficult and thankless job, do not do it at the expense of your mental or physical health:\n\nArea                 | Suggestions\n---                  | ---\nMental Health        | Take breaks, walk around, clear your head. Do not skip lunch with coworkers, join them.\nExternal Environment | See sunlight regularly, living in caves is bad for you\nOffice Environment   | Request a standing desk, or using an exercise ball in lieu of a seat\nStress               | You (probably) work in an academic environment, if the service is down, it's down. You have SLOs and not SLAs, and if you miss them one month it is **ok**. Respect your work-life balance.\n\n???\n\nYour health is more important than the health of the servers.\n\n---\n\n## Take Home\n\nExplicit Goals:\n\n--\n\n1. You're happy\n2. Your users are happy\n\n--\n\nIt is not a zero-sum game, both of these can be true (or true *enough*), and both of these are worth working towards.\n\n---\n\n## Recommendations\n\n- Communicate clearly and empathetically\n- You're the single point of failure, engineer away from this\n- Document what you do for yourself and the next person\n"],"video_library":{"tutorial":null,"slides":null,"demo":null,"both":null,"session":null},"hands_on":false,"slides":true,"mod_date":"2021-04-06 11:50:17 +0000","pub_date":"2019-01-31 16:14:13 +0000","version":17,"api":"https://training.galaxyproject.org/training-material/api/topics/admin/tutorials/empathy/tutorial.json","tools":[],"supported_servers":[],"topic_name_human":"Galaxy Server administration","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial","redirect_from":["/short/admin/empathy/slides","/short/S00009"]}