{"layout":"introduction_slides","logo":"GTN","priority":1,"title":"Introduction to climate data","redirect_from":["/topics/climate/slides/introduction","/short/climate/introduction/slides","/short/S00037"],"video":true,"contributors":["annefou","j34ni"],"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"S00037","url":"/topics/climate/tutorials/introduction/slides.html","topic_name":"climate","tutorial_name":"introduction","dir":"topics/climate/tutorials/introduction","symlink":null,"id":"climate/introduction","ref_tutorials":[],"ref_slides":["# What do we mean by \"Climate\"?\n\n*[Wikipedia](https://en.wikipedia.org/wiki/Climate)*: \nClimate is defined as the **average state** of everyday’s weather condition **over a period of 30 years**.\nIt is measured by assessing the patterns of variation in terms of temperature, humidity, atmospheric pressure, wind, precipitation, atmospheric particle count and other meteorological variables in a given region over long periods of time.\n\n![Climate word cloud](../../images/word_cloud.png \"Word cloud of climate words and phrases\")\n\n???\n- Before we start to dig into climate data, let's define the word \"climate\".\n- If we read the definition on wikipedia, we have: climate is defined as the average state of everyday’s weather condition over a period of 30 years.\n- The time period of 30 years may be discussed. \n- Some scientists would refer to 20 years. Anyway, the idea is that climate is measured by assessing the patterns of variation in terms of temperature, humidity, atmospheric pressure, wind, precipitation, atmospheric particle count and other meteorological variables in a given region over long periods of time.\n---\n\n# Weather versus climate\n\n*Climate differs from weather, in that weather only describes the short-term conditions of these variables in a given region.*\n\n![Weather versus Climate](../../images/weather_versus_climate.png \"Differences between weather and climate\")\n\nWatch [this Video](https://youtu.be/e0vj-0imOLw) to get an illustration of the difference between climate and weather.\n\n*Source*: [Animated short on statistics](https://youtu.be/e0vj-0imOLw) from Norwegian infotainment program Siffer. Produced by TeddyTV for NRK. Animation by Ole Christoffer Haga\n\n???\n- There is often a confusion among the general public between the notions of \"weather\" and \"climate\". \n- It is therefore important to clarify the differences between short-term (weather) versus long-term variations (climate).\n- And, local or regional (weather) versus global scales (climate).\n- We also want to provide indications about what can be expected regarding weather.\n- We can ask questions such as: is it going to rain tomorrow in a particular region?\n- For climate, the question could be: what is the global temperature trend?\n\n---\n\n# Types of climate data resources\n\n- **Observations**: usually the most reliable, but there are little actual observations at the scale of climate and covering a large area;\n- **Re-analyses**: these combine observations with numerical models to produce \"best estimates\" of climate variables; \n- **Climate models**: climate variables produced by numerical simulations only.\n\n???\n- We briefly introduce in this slide the 3 different types of climate data resources available to scientists:\n- Later, in this presentation, we will explain what can be used depending on the time period of interest and application.\n- Observations are usually the most reliable source of data, but there are little actual observations at the scale of climate and covering a large area;\n- Re-analyses combine observations with numerical models to produce \"best estimates\" of climate variables; \n- Climate models for which climate variables are produced by numerical simulations only.\n---\n\n## What is available for the period of time you are interested in?\n\n![Climate data types](../../images/climate_data_types.png \"Different climate data type and their main characteristics\")\n\n???\n- The first thing to consider when looking for climate data is time.\n- That can be past climate or present days or future climate.\n- For past climate and present days, information can be available from several sources. \n- For future climate, only numerical climate models can be of any use, since there has not yet been any actual observation made\nin the future or any re-analysis using these.\n\n---\n\n## Direct observations &nbsp;&nbsp;&nbsp; ![Observations](../../images/observation_type.png \"Show observations are always in the past\")\n\n- Measurements (from ground stations, buoys, satellites, etc.) of one or more physical variables (temperature, humidity, wind, etc.) at one or more particular times and places. \n\n![WMO global observing system](../../images/WMO_global_observing_system.png \"The World Meteorological Organisation Global Observing System\")\n\n*Source*: https://uls.climate.copernicus.eu\n\n???\n- These direct observations correspond to the most common type of physical variables such as temperature, wind, rainfall, etc.\n- Such observations can be collected using measuring instruments.\n- Notice that this category also includes remotely sensed data like satellite imagery or radar although these can be subject to complex data processing before they can be of any use.\n\n---\n\n## Indirect observations &nbsp;&nbsp;&nbsp; ![Observations](../../images/observation_type.png \"Show observations are always in the past\")\n\nThey are derived from other observations, including:\n- ice cores\n- lake sediments\n- tree rings\n\nThese indirect observations are sometimes referred to as \"climate proxies\".\n\n![Tree rings](../../images/frost_rings_375.jpg \"Show two distorted rings from a Siberian pine\")\n\n*Source*: https://www.earth.columbia.edu\n\n???\n- As opposed to the direct observations mentioned in the previous slide, \"proxies\" are somehow related to climate but in a rather intricate manner.\n- In addition, they can also be influenced by other factors.\n- For example the growth of trees depends on the amount of heat and nutrients and water available although the exact relationship is not straightforward. \n- And the growth of trees also depends for example on the location or exposition, on possible insects or animals attacks or diseases, which are even less predictable.\n- On this picture, we have two rings from a Siberian pine in Mongolia that are clearly distorted. \n- That was linked to a particularly cold winter after a volcanic eruption which caused a drastic cooling in the northern hemisphere that froze sap in the cells during the growing season.\n- This particular event dated around 536 Common Era.\n\n---\n\n# Reanalysis &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ![Re-analysis](../../images/reanalysis_type.png \"Show re-analysis data are always in the past\")\n\n- A climate re-analysis is produced by combining numerical models with observations so it can only provide information about the past climate. \nIt contains estimates of the air temperature, wind at different altitudes, rainfall, soil moisture content, etc.\n- The estimates are produced for all locations on Earth, and they span a long time period that can extend back decades or more.\n\n<div class=\"embed-responsive embed-responsive-16by9\"><iframe src=\"https://www.youtube.com/embed/FAGobvUGl24\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n\n???\n- As opposed to observations which are not available for every location on the planet or at any given time, re-analyses fill these gaps by using complex numerical forecast models and data assimilation schemes.\n- It is a bit like re-making a weather forecast for last Monday.\n- But at the same time, re-adjusting the model outputs knowing what the weather was actually like that particular day using existing observations.\n- So using the combined observation and model information, the weather is inferred for the following day, and so on and so forth.\n- One could argue that there is not much point in predicting last week's weather, since it already happened and everybody knows about it now.\n- Although knowing what the weather was like last week or last year cannot be of any help to make any decision a posteriori, it is extremely relevant for those who try to understand past events. \n- For instance for scientists to improve the models and include features which were not adequately represented.\n- Re-analysis provide continuous and consistent data, with a fine temporal and spatial resolution. \n- It is generally the best choice when a high degree of confidence is expected.\n- Bear in mind that they are often referred as observations even if we know now that it is not really true!\n- You can watch the video that is linked on this slide for getting more information.\n---\n\n# What is a model?\n\nNumerical models are a mathematical representation of the climate developed by scientists to understand and predict the climate system. \n\n![Atmospheric Model Schematic](../../images/AtmosphericModelSchematic.png \"Illustrate the notion of numerical climate model\")\n\n*Source*: [https://www.climate.gov/maps-data/primer/climate-models](https://www.climate.gov/maps-data/primer/climate-models)\n\n???\n- Climate models exploit numerical algorithms and high performance computers to solve mathematical equations that describe the physics of the \natmosphere, hydrosphere, cryosphere, land surfaces and biosphere.\n- These models help scientists to better understand how the Earth system works and how climate changes, or assess the impact of human activities and\nevents like volcanic eruptions.\n- Also useful to quantify the effectiveness of mitigation measures.\n\n---\n\n# Climate Models &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ![Climate model type](../../images/model_type.png \"climate models cover both past and future\")\n\nVarious types of models are used for different aspects of the climate. \nAll have different ways to represent the real world, depending on how researchers prioritize and perform these simplifications (in terms of parameterizations, etc.) in the numerical climate model.\n\n## How good are climate models?\n\nClimate models are continuously improving but they still have biases and weaknesses, also some models perform \"better\" in the atmosphere, \nothers in the hydrosphere, etc.\nAs a result, a single climate simulation cannot be considered as providing the \"truth\".\nUsually a good overview can be obtained when considering several model \"families\" rather than any single model, or several model run in slightly \ndifferent conditions (also called \"ensemble runs\").\n\n???\n- Various types of models are used for different aspects of the climate. \n- The physics equations for each model component such as atmosphere, hydrosphere, cryosphere, etc. are solved for each grid cell and appropriate time steps.\n- Simplifications, called parameterizations, are also made to include processes which are too complex to put into equations or would require too much computational resources to be explicitly resolved, or involve scales much smaller than the model grid.\n- All climate models have different ways to represent the real world, depending on how researchers prioritize and perform these simplifications in terms of parameterizations in the numerical climate model.\n- Climate models are continuously improving but they still have biases and weaknesses, also some models perform better in the atmosphere, others in the hydrosphere, etc.\n- As a result, a single climate simulation cannot be considered as providing the truth.\n- Usually a good overview can be obtained when considering several model families rather than any single model, or several model run in slightly different conditions.\n- This is what we call ensemble runs.\n\n---\n\n# Climate prediction *vs.* projection\n\n## Climate prediction\n\nA **climate prediction** (or climate forecast) is an attempt to produce an estimate of the actual evolution of the natural climate in the future, for example, at seasonal, inter-annual or long-term time scales. \n\n## Climate projections\n\n**Climate projections** are distinct from climate predictions in that projections depend upon emission/concentration/radiative forcing **scenarios**, which are based on assumptions concerning, for example, future socio-economic and technological developments that may or may not be realized and are therefore subject to substantial uncertainty.\n\nWithin the Coupled Model Intercomparison Project (CMIP), now in its 6th phase, project simulations of the \nresearch community provide model output that will fuel climate research and climate impact studies for the \nnext 5 to 10 years, while its careful analysis will form the basis for future climate assessments.\n\n???\n- A climate prediction or climate forecast is an attempt to produce an estimate of the actual evolution of the natural climate in the future.\n- For example, to provide a climate prediction at seasonal, inter-annual or long-term time scales. \n- Climate projections are distinct from climate predictions in that projections depend upon emission, concentration, radiative forcing scenarios, which are based on assumptions.\n- For example, we can make assumptions on future socio-economic and technological developments that may or may not be realized and are therefore subject to substantial uncertainty.\n- Within the Coupled Model Intercomparison Project C M I P , now in its 6th phase, project simulations of the research community provide model output that will fuel climate research and climate impact studies for the next 5 to 10 years.\n- In addition, its careful analysis will form the basis for future climate assessments.\n---\n\n# Shared Socio-economic Pathway (SSP) ![Climate model type](../../images/climate_type_ssp.png \"climate models cover both past and future\")\n\n**= societal development pathway**\n\nThe SSPs were developed as a joint community effort and describe global developments that\ntogether would lead to different challenges for mitigation and adaptation to climate change.\nSSPs comprise **five alternative** narratives that describe the main characteristics of the\npathways in qualitative terms as well as quantitative descriptions for key elements including\npopulation, economic growth and urbanization.\n\nDifferent pathways are defined by the magnitude of the challenges a future society\nwould face in adapting to or mitigating climate change if that socioeconomic pathway was pursued.\n\n???\n- The shared socio-economic pathway, also called S S P, were developed as a joint community effort and describe global developments that together would lead to different challenges for mitigation and adaptation to climate change.\n- S S Ps comprise five alternative narratives that describe the main characteristics of the pathways in qualitative terms as well as quantitative descriptions for key elements including population, economic growth and urbanization.\n- Different pathways are defined by the magnitude of the challenges a future society would face in adapting to or mitigating climate change if that socioeconomic pathway was pursued.\n---\n\n## SSPs and Shared Policy Assumptions (SPAs)\n\n- <a href=\"https://en.wikipedia.org/wiki/Shared_Socioeconomic_Pathways#SSP1:_Sustainability_(Taking_the_Green_Road)\">SSP1 Sustainability</a>: Taking the Green Road e.g. low challenges to mitigation and adaptation\n\n- <a href=\"https://en.wikipedia.org/wiki/Shared_Socioeconomic_Pathways#SSP2:_Middle_of_the_road)\">SSP2 Middle of the Road</a>:  Medium challenges to mitigation and adaptation\n\n- <a href=\"https://en.wikipedia.org/wiki/Shared_Socioeconomic_Pathways#SSP3:_Regional_rivalry_(A_Rocky_Road)\">SSP3 Regional Rivalry</a>: A Rocky Road e.g high challenges to mitigation and adaptation\n\n- <a href=\"https://en.wikipedia.org/wiki/Shared_Socioeconomic_Pathways#SSP4:_Inequality_(A_Road_Divided)\">SSP4 Inequality</a>: A Road Divided e.g. low challenges to mitigation, high challenges to adaptation\n\n- <a href=\"https://en.wikipedia.org/wiki/Shared_Socioeconomic_Pathways#SSP5:_Fossil-Fueled_Development_(Taking_the_Highway)\">SSP5 Fossil-fueled Development</a>: Taking the Highway e.g. high challenges to mitigation, low challenges to adaptation\n\n???\n- Let's have a look at these different S S Ps and Shared Policy Assumptions.\n- S S P 1 Sustainability is also referenced as \"Taking the Green Road\".\n- The world shifts gradually, but pervasively, toward a more sustainable path, emphasizing more inclusive development that respects perceived environmental boundaries. \n- This path leads to low challenges to mitigation and adaptation.\n- S S P 2 or called \"Middle of the road\".\n- The world follows a path in which social, economic, and technological trends do not shift markedly from historical patterns.\n-  Development and income growth proceeds unevenly, with some countries making relatively good progress while others fall short of expectations\n- This path leads to Medium challenges to mitigation and adaptation.\n- S S P 3 Regional rivalry, also called: a Rocky Road.\n- A resurgent nationalism, concerns about competitiveness and security, and regional conflicts push countries to increasingly focus on domestic or, at most, regional issues.\n- A low international priority for addressing environmental concerns leads to strong environmental degradation in some regions.\n- This path leads to High challenges to mitigation and adaptation.\n- S S P 4 Inequality; also called \"a Road Divided\".\n- Highly unequal investments in human capital, combined with increasing disparities in economic opportunity and political power, lead to increasing inequalities and stratification both across and within countries.\n- This path leads to Low challenges to mitigation but high challenges to adaptation.\n- S S P 5 Fossil-Fueled Development, also called \"Taking the Highway\".\n- This world places increasing faith in competitive markets, innovation and participatory societies to produce rapid technological progress and development of human capital as the path to sustainable development. Global markets are increasingly integrated. \n- Local environmental problems like air pollution are successfully managed. \n- There is faith in the ability to effectively manage social and ecological systems, including by geo-engineering if necessary.\n- This path leads to High challenges to mitigation and low challenges to adaptation\n---\n\n## SSPs and Shared Policy Assumptions (SPAs)\n\n![Shared Socio-economic Pathway and Shared POLicy Assumptions](../../images/SSP_scenarios.png \"Scenarios with different SSPs and SPAs\")\n\nSource: https://www.becc.lu.se/sites/becc.lu.se/files/climate_modelling_ralf_doscher.pdf\n\n???\n- This slide contains the same information as the previous one.\n- It shows the 5 different pathways.\n- On the vertical axis, the mitigation challenges resulting in the adoption of one path or another are highlighted.\n- On the horizontal axis, the resulting adaptation challenges are shown.\n- Now it is clearer why we called S S P 2 the \"middle of the road\". \n---\n\n# Where to start to get climate data?\n\n*There is a wealth of data and information available on the **web** about the past, current and future climate.*\n\n**Not all of it is up-to-date and trustworthy**\n\n- Check the provenance and data provider credentials\n\n**Not all the variables/parameters are necessarily relevant for your study**\n\n- Prioritize the use of [Essential Climate Variables](https://gcos.wmo.int/en/essential-climate-variables/about) (as we know they critically contribute to the characterization of Earth’s climate).\n\n**Not all the variables are reliable**\n\n- For instance, temperature is usually reliable but precipitation is more difficult to estimate\n- Prioritize observations and re-analyses for past climate\n\n**Prefer authoritative data providers**\n\n???\n- Where to start to get climate data?\n- There is a wealth of data and information available on the web about the past, current and future climate.\n- Not all of it is up-to-date and trustworthy!\n- Check the provenance and data provider credentials\n- Not all the variables and parameters are necessarily relevant for your study\n- Prioritize the use of Essential Climate Variables as we know they critically contribute to the characterization of Earth’s climate.\n- Not all the variables are reliable!\n- For instance, temperature is usually reliable but precipitation is more difficult to estimate.\n- Prioritize observations and re-analyses for past climate.\n- Prefer authoritative data providers!\n"],"hands_on":false,"slides":true,"mod_date":"2023-01-12 09:58:34 +0000","pub_date":"2020-10-11 15:25:37 +0000","version":2,"api":"https://training.galaxyproject.org/training-material/api/topics/climate/tutorials/introduction/tutorial.json","tools":[],"supported_servers":{"exact":[],"inexact":[{"name":"UseGalaxy.eu","url":"https://usegalaxy.eu","id":"eu","human":"Galaxy Europe","usegalaxy":true},{"name":"UseGalaxy.org","url":"https://usegalaxy.org","id":"us","human":"Galaxy Main","usegalaxy":true},{"name":"UseGalaxy.org.au","url":"https://usegalaxy.org.au","id":"au","human":"Galaxy Australia","usegalaxy":true},{"name":"UseGalaxy.fr","url":"https://usegalaxy.fr","id":"fr","human":"Galaxy France","usegalaxy":true}]},"topic_name_human":"Climate","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":true},"license":"CC-BY-4.0","type":"tutorial"}