{"layout":"tutorial_hands_on","title":"One protein along the UniProt page","level":"Introductory","draft":true,"zenodo_link":"","questions":["How can you search for proteins using text, gene, or protein names?","How do you interpret the information at the top of the UniProt entry page?","What types of information can you expect from different download formats, such as FASTA and JSON?","How is the function of a protein like opsins described in the \"Function\" section?","What structured information is found in the \"Names and Taxonomy\",  \"Subcellular location\", \"Disease & Variants\", \"PTM/Processing\" sections?","How to learn about the protein expression, interactions, structure, family, sequence and similar proteins?","How do the \"Variant viewer\" and \"Feature viewer\" tabs assist in mapping protein information along the sequence?","What does the \"Publications\" tab list, and how can you filter publications?","What is the significance of tracking entry annotation changes over time?"],"objectives":["By exploring protein entries in UniProtKB, interpret protein function, taxonomy, structure, interactions, variants, and more.","Use unique identifiers to connect databases, download gene and protein data, visualize and compare sequence features."],"time_estimation":"1H","key_points":["How to navigate UniProtKB entries, accessing comprehensive details about proteins, such as their functions, taxonomy, and interactions","The Variant and Feature viewer are your tools to visually explore protein variants, domains, modifications, and other key sequence features.","Expand your understanding by utilizing external links to cross-reference data and uncover complex relationships.","Explore the History tab for access to previous versions of entry annotations."],"requirements":[{"type":"internal","topic_name":"data-science","tutorials":["online-resources-gene"]}],"contributions":{"authorship":["lisanna","bebatut"],"funding":["biont"]},"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"T00360","url":"/topics/data-science/tutorials/online-resources-protein/tutorial.html","topic_name":"data-science","tutorial_name":"online-resources-protein","dir":"topics/data-science/tutorials/online-resources-protein","symlink":null,"id":"data-science/online-resources-protein","ref_tutorials":["<p>When doing a biological data analysis, we might end up with some interesting proteins, that we need explore these genes. But how can we do that? What are the resources available for that? And how to navigate through them?</p>\n\n<p>The aim of this tutorial is to familiarize ourselves with that, using Human opsins as an example.</p>\n\n<blockquote class=\"comment\">\n  <comment-title></comment-title>\n  <p>This tutorial is a bit atypical: we will not work in Galaxy but mostly outside of it, in the <a href=\"https://uniprot.org\">UniProt</a> database pages.</p>\n</blockquote>\n\n<blockquote class=\"comment\">\n  <comment-title></comment-title>\n  <p>This tutorial  designed to be the continuation of the tutorial <a href=\"/training-material/topics/data-science/tutorials/online-resources-gene/tutorial.html\">“One gene across file formats”</a>, but it can also be consulted as a stand-alone module.</p>\n</blockquote>\n\n<p>Opsins are found in the cells of your retina. They catch light and begin the sequence of signals that result in vision, and that is the reason why, when compromised, they are associated to color-blindness and other visual impairments.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Sources of information from this tutorial</comment-title>\n\n  <p>The tutorial you are consulting was mainly developed consulting UniProtKB resources, in particular the <a href=\"https://www.uniprot.org/help/explore_uniprotkb_entry\">Explore UniProtKB entry</a> tutorial. \nSome sentences are reported from there with no modifications.</p>\n\n  <p>In addition, the topic was chosen based Gale Rhodes’ <a href=\"https://spdbv.unil.ch/TheMolecularLevel/Matics/index.html\">Bioinformatics Tutorial</a>. Although the tutorial cannot be anymore be followed step by step due to how the mentioned resources changed in time, it could provide additional insights on opsins and in particular how one could build structural models of proteins based on evolutionary information.</p>\n\n</blockquote>\n\n<blockquote class=\"agenda\">\n  <agenda-title></agenda-title>\n\n  <p>In this tutorial we will deal with:</p>\n\n<ol id=\"markdown-toc\">\n  <li><a href=\"#the-uniprotkb-entry-page\" id=\"markdown-toc-the-uniprotkb-entry-page\">The UniProtKB Entry page</a></li>\n  <li><a href=\"#inspecting-a-uniprot-entry\" id=\"markdown-toc-inspecting-a-uniprot-entry\">Inspecting a UniProt entry</a>    <ol>\n      <li><a href=\"#entry\" id=\"markdown-toc-entry\">Entry</a></li>\n      <li><a href=\"#subcellular-location\" id=\"markdown-toc-subcellular-location\">Subcellular location</a></li>\n      <li><a href=\"#variant-viewer\" id=\"markdown-toc-variant-viewer\">Variant viewer</a></li>\n      <li><a href=\"#feature-viewer\" id=\"markdown-toc-feature-viewer\">Feature viewer</a></li>\n      <li><a href=\"#publications\" id=\"markdown-toc-publications\">Publications</a></li>\n      <li><a href=\"#external-links\" id=\"markdown-toc-external-links\">External links</a></li>\n      <li><a href=\"#history\" id=\"markdown-toc-history\">History</a></li>\n    </ol>\n  </li>\n</ol>\n</blockquote>\n\n<h1 id=\"the-uniprotkb-entry-page\">The UniProtKB Entry page</h1>\n\n<p>The portal to visit to obtain all information about a protein is <a href=\"https://www.uniprot.org/\">UniProtKB</a>. We can search it using a text search, or the gene or protein name. Let’s try first a set of generic keywords, like <code class=\"language-plaintext highlighter-rouge\">Human opsin</code>.</p>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Search for Human opsin on UniProtKB</hands-on-title>\n\n  <ol>\n    <li>Open the <a href=\"https://www.uniprot.org/\">UniProtKB</a></li>\n    <li>Type <code class=\"language-plaintext highlighter-rouge\">Human opsin</code> in the search bar</li>\n    <li>Launch the search</li>\n  </ol>\n\n</blockquote>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>How many results did we get?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>410 results (at the time of preparation of this tutorial)</p>\n\n  </blockquote>\n</blockquote>\n\n<p>These 410 results give us the feeling that we need to be more specific (although - spoiler - our actual target is among the first hits).</p>\n\n<p>To be specific enough, we suggest to use an unique identifier. From the <a href=\"/training-material/topics/data-science/tutorials/online-resources-gene/tutorial.html\">previous tutorial</a> we know the gene name of the protein that we are looking for, <code class=\"language-plaintext highlighter-rouge\">OPN1LW</code>.</p>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Search for OPN1LW on UniProtKB</hands-on-title>\n\n  <ol>\n    <li>Type <code class=\"language-plaintext highlighter-rouge\">OPN1LW</code> in the top search bar</li>\n    <li>Launch the search</li>\n  </ol>\n\n</blockquote>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>How many results did we get?</li>\n    <li>What should we do to reduce this number?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>200+ results (at the time of preparation of this tutorial)</li>\n      <li>We need to clarify what we are looking for: Human OPN1LW</li>\n    </ol>\n  </blockquote>\n</blockquote>\n\n<p>We need to add <code class=\"language-plaintext highlighter-rouge\">Human</code> to clarify what we are looking for.</p>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Search for Human OPN1LW on UniProtKB</hands-on-title>\n\n  <ol>\n    <li>Type <code class=\"language-plaintext highlighter-rouge\">Human OPN1LW</code> in the top search bar</li>\n    <li>Launch the search</li>\n  </ol>\n\n</blockquote>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>How many results did we get?</li>\n    <li>Do we have one result including OPN1LW as gene name?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>7 results (at the time of preparation of this tutorial)</li>\n      <li>The first result is labeled with <code class=\"language-plaintext highlighter-rouge\">Gene: OPN1LW (RCP)</code></li>\n    </ol>\n  </blockquote>\n</blockquote>\n\n<p>The first result, labeled with <code class=\"language-plaintext highlighter-rouge\">Gene: OPN1LW (RCP)</code>, is our target, <code class=\"language-plaintext highlighter-rouge\">P04000 · OPSR_HUMAN</code>. Before opening the page, two things to notice:</p>\n\n<ol>\n  <li>The name of the protein <code class=\"language-plaintext highlighter-rouge\">OPSR_HUMAN</code> is different than the gene name, as well as their IDs are.</li>\n  <li>This entry has a golden star, which means that was manually annotated and curated.</li>\n</ol>\n\n<h1 id=\"inspecting-a-uniprot-entry\">Inspecting a UniProt entry</h1>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Open a result on UniProt</hands-on-title>\n\n  <ol>\n    <li>Click on <code class=\"language-plaintext highlighter-rouge\">P04000 · OPSR_HUMAN</code></li>\n  </ol>\n</blockquote>\n\n<figure id=\"figure-1\" style=\"max-width: 90%;\"><img src=\"./images/UniProt.png\" alt=\"Screenshot of the UniProt entry page header. \" width=\"2850\" height=\"1330\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/UniProt.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 1</strong>:</span> UniProt page</figcaption></figure>\n\n<p>To navigate this long page, the menu (navigation bar) on the left will be extremely useful. Just from it, we understand that this database contains information about the entry on:</p>\n<ul>\n  <li>the known functions,</li>\n  <li>the taxonomy,</li>\n  <li>the location,</li>\n  <li>variants and associated diseases,</li>\n  <li>Post Translational Modification (PTMs),</li>\n  <li>the expression,</li>\n  <li>the interactions,</li>\n  <li>the structure,</li>\n  <li>the domains and their classification,</li>\n  <li>the sequences</li>\n  <li>similar proteins.</li>\n</ul>\n\n<p>The navigation bar stays in the same place on the screen as you move up and down in an entry, so that you can quickly navigate to sections of interest. We will consult all the mentioned sections separately, but let’s first focus on the headers on the left.</p>\n\n<p>At the top of the page, you can see the UniProt entry accession and name, the name of the protein and gene, the organism, whether the protein entry has been manually reviewed by a UniProt curator, its annotation score, and the evidence level for its existence.</p>\n\n<p>Below the main header, you find a series of tabs (<em>Entry</em>, <em>Variant viewer</em>, <em>Feature viewer</em>, <em>Publications</em>, <em>External links</em>, <em>History</em>). The tabs allow you to switch between the entry, a graphical view of sequence features (Feature viewer), publications, and external links, but ignore them for the moment and do not move from the <em>Entry</em> tab.</p>\n\n<h2 id=\"entry\">Entry</h2>\n\n<p>The next menu is already part of the <em>Entry</em> tab. It allows us to run a BLAST sequence similarity search on the entry, align it with all its isoforms, download the entry in various formats, or add it to the basket to save for later.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>What are the available formats in the <em>Download</em> drop-down menu?</li>\n    <li>What type of information would we download through these file formats?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>The formats are: <code class=\"language-plaintext highlighter-rouge\">Text</code>, <code class=\"language-plaintext highlighter-rouge\">FASTA (canonical)</code>, <code class=\"language-plaintext highlighter-rouge\">FASTA (canonical &amp; isoform</code>, <code class=\"language-plaintext highlighter-rouge\">JSON</code>, <code class=\"language-plaintext highlighter-rouge\">XML</code>, <code class=\"language-plaintext highlighter-rouge\">RDF/XML</code>, <code class=\"language-plaintext highlighter-rouge\">GFF</code></li>\n      <li>The<code class=\"language-plaintext highlighter-rouge\">FASTA</code> formats should sound familiar (after the preliminary tutorial), and include the protein sequence, eventually with its isoforms (in which case it will be a multi-FASTA). Besides these, all the other formats are not protein- or even biology-specific. These are general file formats extensively used by websites to include the information included in the page. Hence, by downloading <code class=\"language-plaintext highlighter-rouge\">text</code> (or even better the <code class=\"language-plaintext highlighter-rouge\">json</code>) file, we would download the same annotation that we access in this page, but in a format that is easier to parse programmatically.</li>\n    </ol>\n\n  </blockquote>\n</blockquote>\n\n<p>Let’s now scroll the entry page, section by section.</p>\n\n<h3 id=\"function\">Function</h3>\n\n<p>This section summarises the functions of this protein as follows:</p>\n\n<p>Visual pigments are the light-absorbing molecules that mediate vision. They consist of an apoprotein, opsin, covalently linked to cis-retinal.</p>\n\n<p>Regardless of the level of details that you understand (depending on your background), this is impressively short and specific considering the enourmous amount of literature and studies that exist beyond the determination of a protein function. Anyway, someone did the work for us, and this protein is already fully classified in the Gene Ontology (GO), which describes any classified protein’s molecular function, biological process and cellular component.</p>\n\n<p>GO is a perfect example of database / resource that builds on a very complex universe of knowledge and translates it into a simpler graph, at the risk of losing  details. This has the great advantage of organising the information, making it countable and analysable and programmatically accessible, ultimately allowing us to have this long summary pages and KnowledgeBases.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>To which molecular functions is this protein annotated?</li>\n    <li>To which cellular components is this protein annotated?</li>\n    <li>To which biological processes this protein annotated?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>Photoreceptor protein, G-protein coupled receptor</li>\n      <li>Photoreceptor disc membrane</li>\n      <li>Sensory transduction, Vision</li>\n    </ol>\n\n  </blockquote>\n</blockquote>\n\n<h3 id=\"names-and-taxonomy\">Names and Taxonomy</h3>\n\n<p>Other examples of structured information are available in the next section, e.g. in the taxonomy. This section also reports other unique identifiers that refer to the same biological entity or to linked entities (e.g. associated diseases in the <code class=\"language-plaintext highlighter-rouge\">MIM</code> menu).</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>What is the taxonomic identifier associated with this protein?</li>\n    <li>What is the proteome identifier associated with this protein?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>9606, i.e. Homo sapiens</li>\n      <li>UP000005640, componenent of Chromosome Xs</li>\n    </ol>\n  </blockquote>\n</blockquote>\n\n<h2 id=\"subcellular-location\">Subcellular location</h2>\n\n<p>We already know where our protein is in the human body (in the retina, as specified by the function summary), but where is it in the cell?</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>Where is our protein in the cell?</li>\n    <li>Is it consistent with the GO annotation observed before?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>The section explains that it is a “Multi-pass membrane protein”, which means that it is a protein inserted in the cell membrane and goin through it multiple times.</li>\n      <li>The GO Annotation on the top mentions that we are referring to the photoreceptor (cell) membrane in particular.</li>\n    </ol>\n  </blockquote>\n</blockquote>\n\n<p>The Subcellular location section includes a <em>Features</em> area detailing which sections, along the protein sequence, are inserted in the membrane (Transmembrane) and which not (Topological domain).</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>How many Transmembrane domains and Topological domains are there?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>8 Transmembrane and 7 Topological domains</p>\n  </blockquote>\n</blockquote>\n\n<h3 id=\"disease--variants\">Disease &amp; Variants</h3>\n\n<p>As we know from the previous tutorial, this gene/protein is associated to multiple diseases. This section details this association also listing the specific variants that have been detected as disease-related.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>What types of scientific studies allow to assess the association of a genetic variant to diseases?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>Three commonly used methods for assessing the association of a genetic variant with a disease are:</p>\n\n    <ul>\n      <li>\n        <p>Genome-Wide Association Studies (GWAS)</p>\n\n        <p>GWAS are widely used to identify common genetic variants associated with diseases. They involve scanning the entire genome of a large number of individuals to identify variations linked to a particular disease or trait.</p>\n      </li>\n      <li>\n        <p>Case-Control Studies</p>\n\n        <p>Case-control studies are frequently employed to compare individuals with a disease to those without it, focusing on the presence or frequency of specific genetic variants in both groups.</p>\n      </li>\n      <li>\n        <p>Family Studies</p>\n\n        <p>Family-based studies involve analyzing genetic variants within families where multiple members are affected by a disease. By studying the inheritance patterns of genetic variants and their association with the disease within families, researchers can identify potential disease-associated genes.</p>\n      </li>\n    </ul>\n\n    <p>These type of studies would imply extensive usage of the file types to manage genomic data, such as: SAM (Sequence Alignment Map), BAM (Binary Alignment Map), VCF (Variant Calling Format) etc.</p>\n\n  </blockquote>\n</blockquote>\n\n<p>This section also includes a <em>Features</em> area, where the natural variants are mapped along the sequence. Below, it also highlights that a more detailed view of features along the sequence is provided in the <em>Disease &amp; Variants</em> tab, but let’s not open it for now.</p>\n\n<h3 id=\"ptmprocessing\">PTM/Processing</h3>\n\n<p>A post-translational modification (PTM) is a covalent processing event resulting from a proteolytic cleavage or from the addition of a modifying group to one amino acid.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>What are the post-translational modifications for our protein?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>Chain, glycosylation, disulfide bond, modified residue</p>\n  </blockquote>\n</blockquote>\n\n<h3 id=\"expression\">Expression</h3>\n\n<p>We already know where the protein is in the cell, but for human proteins we often have information on where it is in the human body, i.e. in which tissues. This information can come from the Human <a href=\"https://www.ebi.ac.uk/gxa/home\">ExpressionAtlas</a> or other similar resources.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>In which tissue is the protein found?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>The three color pigments are found in the cone photoreceptor cells.</p>\n  </blockquote>\n</blockquote>\n\n<h3 id=\"interaction\">Interaction</h3>\n\n<p>Proteins perform their function through their interaction with the surroundings, in particular with other proteins. This section reports the interactors of our protein of interest, in a table that we can also filter by subcellular location, diseases, and type of interaction.</p>\n\n<p>The source of this information are databases like STRING, and the entry page for our protein is directly linked from this section.</p>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Search for Human OPN1LW on UniProtKB</hands-on-title>\n\n  <ol>\n    <li>Click on the <a href=\"https://string-db.org/network/9606.ENSP00000358967\">STRING link</a> in a different tab</li>\n  </ol>\n\n</blockquote>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>How many different file formats can you download from there?</li>\n    <li>What kind of information will be conveyed in each file?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>STRING provides data in downloadable file formats to support further analyses. \n The primary file format used by STRING is the ‘TSV’ (Tab-Separated Values) format, which presents protein interaction data in a structured, tabular layout. This format is well-suited for easy integration into various data analysis tools and software. \n Additionally, STRING offers data in PSI-MI (Proteomics Standards Initiative Molecular Interactions) XML format, a standard for representing protein interaction data that allows for compatibility with other interaction databases and analysis platforms. These file formats enable researchers to harness the wealth of protein interaction information in STRING for their own studies and analyses. Researchers can also download visual representations of protein networks in image formats such as PNG and SVG, which are suitable for presentations and publications. For advanced analysis, STRING offers ‘flat files’ containing detailed interaction information, and ‘MFA’ (Multiple Alignment Format) files, which are useful for comparing multiple protein sequences. These diverse downloadable file formats enable researchers to harness the wealth of protein interaction information in STRING for their own studies and analyses.</p>\n\n  </blockquote>\n</blockquote>\n\n<h3 id=\"structure\">Structure</h3>\n\n<p>Are you curious about the intricate three-dimensional structures of proteins? The <em>Structure</em> section on the UniProtKB entry page is your gateway to exploring the fascinating world of protein architecture.</p>\n\n<p>In this section, you’ll find information about experimentally determined protein structures. These structures provide crucial insights into how proteins function and interact with other molecules. You will discover interactive views of the protein’s structure that you can explore directly within the UniProtKB entry. This feature provides an engaging way to navigate through the protein’s domains, binding sites, and other functional regions. By delving into the <em>Structure</em> section, you’ll gain a deeper understanding of the physical basis of protein function and discover the wealth of information that structural data can unlock.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>What is the variant associated to color blindness?</li>\n    <li>Can you find that specific amino acid in the structure?</li>\n    <li>Can you formulate a guess of why this mutation is disruptive?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>In the <em>Disease &amp; Variants</em> section, we discover that the change from Glycine (G) to Glutamic acid (E) at position 338 along the protein sequence is associated to Colorblindness.</li>\n      <li>In the structure viewer, we can move the molecule around and hover the mouse on the structure to find the AA in position 338. It might take some time to follow through the multiple helical arrangements of these structures. The Glycine at 338 is not in a helix, but in what looks like a loop just before a low confidence area in the structure.</li>\n      <li>Based on the information we collected so far, we could make a hypothesis of why this is distruptive. It is not in a helix (usually, in transmembrane proteins, helices are inserted in the membrane), hence, it is in one of the bigger domains that protrude from the membrane, in or out of the cell. This mutation probably doesn’t distrupt the structure in its intra-membrane segments, but rather one of the functional domain. If you want to dig deeper, you can check if this is the extra- or intra-cellular segment in the <strong>Feature viewer</strong>.</li>\n    </ol>\n\n  </blockquote>\n</blockquote>\n\n<p>Where does the information in the structure viewer come from?</p>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Search for Human OPN1LW on UniProtKB</hands-on-title>\n\n  <ol>\n    <li>Click on the download icon below the structure</li>\n    <li>Check the file that has been downloaded</li>\n  </ol>\n\n</blockquote>\n\n<p>This is a PDB (Protein Data Bank) file, allowing you to visualize and analyze the protein’s arrangement of atoms and amino acids.</p>\n\n<p>However, there is no reference to the PDB database in the links among the <em>3D structure databases</em>. Instead, the first link refers to the AlphaFoldDB. The AlphaFold Database is a comprehensive resource that provides predicted 3D structures for a wide range of proteins. Using deep learning techniques and evolutionary information, AlphaFold accurately predicts the spatial arrangement of atoms within a protein, contributing to our understanding of protein function and interactions.</p>\n\n<p>Hence, this is a <em>prediction</em> of the structure, not a structure experimentally validated. This is the reason why it is colored by confidence: the sections in blue are those with a high confidence value, so the ones for which the prediction is very reliable, while the ones in orange are less reilable or have a disordered (more flexible and mobile) structure. Nevertheless, this information is represented through a PDB file, because it is still structural.</p>\n\n<h3 id=\"family-and-domains\">Family and Domains</h3>\n\n<p>The <em>Family and Domains</em> section on the UniProtKB entry page provides a comprehensive view of the evolutionary relationships and functional domains within a protein. This section offers insights into the protein’s membership in protein families, superfamilies, and domains, shedding light on its structural and functional characteristics.</p>\n\n<p>The <em>Features</em> area confirms indeed that at least one of the two domains protruding from the membrane (the N-terminal one) is disordered. This area usually includes information about conserved regions, motifs, and important sequence features that contribute to the protein’s role in various biological processes. The section confirms once again that we are looking at a transmembrane protein, and links to several resources of phylogenetic, protein families or domains data - guiding us on understading how proteins share common ancestry, evolve, and acquire specialized functions.</p>\n\n<h3 id=\"sequence\">Sequence</h3>\n\n<p>All this information about the protein’s evolution, function, structure, is ultimately encoded in its sequence. Once again, in this section we have the opportunity to download the FASTA file transcribing it, as well as to access the source of this data: the genomic sequencing experiments that assessed it. This section also reports when isoforms have been detected.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>How many potential isoforms are mapped to this entry?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>1: H0Y622</p>\n\n  </blockquote>\n</blockquote>\n\n<h3 id=\"similar-proteins\">Similar proteins</h3>\n\n<p>The last section of the UniProt Entry page reports similar proteins (this is basically the result of a clustering, with 100%, 90% and 50% identity thresholds).</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>How many similar proteins at 100% identity?</li>\n    <li>How many similar proteins at 90% identity?</li>\n    <li>How many similar proteins at 50% identity?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>0</li>\n      <li>83</li>\n      <li>397</li>\n    </ol>\n\n  </blockquote>\n</blockquote>\n\n<p>As you might have guessed while looking at this page, a lot of the processing of biological data about a protein actually consists of mapping different types of information along the sequence, and understand how they influence each other. A visual mapping (and a table with the same information) is provided by the two alternative tabs to view this entry, that is the <em>Variant viewer</em> and the <em>Feature viewer</em>.</p>\n\n<h2 id=\"variant-viewer\">Variant viewer</h2>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Variant viewer</hands-on-title>\n\n  <ol>\n    <li>Click on <em>Variant viewer</em> tab</li>\n  </ol>\n\n</blockquote>\n\n<p>The <em>Variant viewer</em> maps all the known alternative versions of this sequence. For some of them the effect (pathogenic or benign) is known, for others not.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>How many variant are likely pathogenic?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>By zooming out in the variant view, we see that we have 5 red points, so 5 variants that are likely pathogenic.</p>\n\n  </blockquote>\n</blockquote>\n\n<p>The high number of variants that you find in this section suggests that “protein sequences” (as well as gene sequences, protein structures etc.) are actually less fixed entities than what we would think.</p>\n\n<h2 id=\"feature-viewer\">Feature viewer</h2>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Feature viewer</hands-on-title>\n\n  <ol>\n    <li>Click on <em>Feature viewer</em> tab</li>\n  </ol>\n\n</blockquote>\n\n<p>The <em>Feature viewer</em> is basically a merged version of all the <em>Features</em> areas that we found in the <em>Entry</em> page, including <em>Domains &amp; sites</em>, <em>Molecule processing</em>, <em>PTMs</em>, <em>Topology</em>, <em>Proteomics</em>, <em>Variants</em>. If in the viewer you click on any feature, the correspondent region in the structure will be focused, as the variant of interest</p>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Variant viewer</hands-on-title>\n\n  <ol>\n    <li>Expand the <em>Variants</em> part</li>\n    <li>Zoom out</li>\n    <li>Click on our variant of interest (the red point at position 338)</li>\n  </ol>\n\n</blockquote>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>What is the topology at this location?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>A topological cytoplasmic domain</p>\n\n  </blockquote>\n</blockquote>\n\n<p>Finally, let’s have a quick look at the other tabs.</p>\n\n<h2 id=\"publications\">Publications</h2>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>Publication</hands-on-title>\n\n  <ol>\n    <li>Click on <em>Publication</em> tab</li>\n  </ol>\n\n</blockquote>\n\n<p>The <em>Publications</em> one lists scientific publications related to the protein. These are collected by merging a fully curated list in UniProtKB/Swiss-Prot and automatically imported ones. In this tab, you can filter the publications list by source and categories that are based on the type of data a publication contains about the protein (such as function, interaction, sequence, etc.), or by the number of proteins in the corresponding study it describes (“small scale” vs “large scale”).</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <ol>\n    <li>How many publications are associated with this protein?</li>\n    <li>How many publications contains information about its function?</li>\n  </ol>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ol>\n      <li>57</li>\n      <li>23</li>\n    </ol>\n\n  </blockquote>\n</blockquote>\n\n<h2 id=\"external-links\">External links</h2>\n\n<blockquote class=\"hands-on\">\n  <hands-on-title>External links</hands-on-title>\n\n  <ol>\n    <li>Click on <em>External links</em> tab</li>\n  </ol>\n\n</blockquote>\n\n<p>The <em>External links</em> tab puts together all the references to external databases and resources of information that we found in each Entry page section. The links text often reports the unique identifiers that represent the same biological entity in other databases. To get a feeling of this compexity, check the following image (that is already partially outdated).</p>\n\n<figure id=\"figure-2\" style=\"max-width: 90%;\"><img src=\"./images/complexDB.jpeg\" alt=\"A graph representing how all the different databases are connected by unique IDs, where major nodes are DBs, and arrows connect them to the IDs (minor nodes) that they report. The map is very crowded, especially around the UniProt Entry Name, Gene ID and Ensembl Gene ID. \" width=\"819\" height=\"1335\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/complexDB.jpeg\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 2</strong>:</span> Best illustration of the complex ID crossref: bioDBnet Network Diagram - [source](https://biodbnet-abcc.ncifcrf.gov/dbInfo/netGraph.php)</figcaption></figure>\n\n<h2 id=\"history\">History</h2>\n\n<p>Finally, the <em>History</em> tab is also an interesting one. It reports and makes available for download all the previous versions of this entry annotations, that is: all the “evolution” of its annotation, in this case dating back to 1988.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>Was this entry ever not manually annotated?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>To answer this question you can scroll back in time through the table and check the <code class=\"language-plaintext highlighter-rouge\">Database</code> column. Was this ever in TrEMBL instead that in SwissProt? No, so this entry was manually annotated since its beginning.</p>\n\n  </blockquote>\n</blockquote>\n"],"ref_slides":[],"hands_on":true,"slides":false,"mod_date":"2023-11-03 14:30:27 +0000","pub_date":"2023-09-07 09:58:19 +0000","version":15,"api":"https://training.galaxyproject.org/training-material/api/topics/data-science/tutorials/online-resources-protein/tutorial.json","tools":[],"supported_servers":{"exact":[],"inexact":[{"name":"UseGalaxy.eu","url":"https://usegalaxy.eu","id":"eu","human":"Galaxy Europe","usegalaxy":true},{"name":"UseGalaxy.org","url":"https://usegalaxy.org","id":"us","human":"Galaxy Main","usegalaxy":true},{"name":"UseGalaxy.org.au","url":"https://usegalaxy.org.au","id":"au","human":"Galaxy Australia","usegalaxy":true},{"name":"UseGalaxy.fr","url":"https://usegalaxy.fr","id":"fr","human":"Galaxy France","usegalaxy":true}]},"topic_name_human":"Foundations of Data Science","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial","tags":["work-in-progress"],"contributors":[{"name":"Lisanna Paladin","joined":"2023-09","email":"lisanna.paladin@gmail.com","orcid":"0000-0003-0011-9397","id":"lisanna","url":"https://training.galaxyproject.org/training-material/api/contributors/lisanna.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/lisanna/"},{"name":"Bérénice Batut","email":"berenice.batut@gmail.com","twitter":"bebatut","linkedin":"berenicebatut","matrix":"bebatut:matrix.org","orcid":"0000-0001-9852-1987","joined":"2017-09","elixir_node":"fr","contact_for_training":true,"location":{"country":"FR","lat":45.77,"lon":3.08},"fediverse":"https://piaille.fr/@bebatut","fediverse_flavor":"mastodon","affiliations":["gallantries","ifb","elixir-europe"],"id":"bebatut","url":"https://training.galaxyproject.org/training-material/api/contributors/bebatut.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/bebatut/"},{"name":"BioNT","github":false,"joined":"2023-09","avatar":"http://biont-training.eu/assets/img/BioNT_Logo_Layout_2106_blue_Version_2_cropped.png","url":"https://training.galaxyproject.org/training-material/api/funders/biont.json","funder":true,"funding_id":"101100604","funding_system":"cordis","funding_statement":"Co-funded by the European Union","id":"biont","page":"https://training.galaxyproject.org/training-material/hall-of-fame/biont/"}]}