{
  "layout": "tutorial_hands_on",
  "title": "Identification of somatic and germline variants from tumor and normal sample pairs",
  "zenodo_link": "https://doi.org/10.5281/zenodo.2582555",
  "questions": [
    "What are the specific challenges in somatic variant calling that set it apart from regular diploid variant calling?",
    "How can you call variants and classify them according to their presence/absence in/from tumor and normal tissue of the same individual?",
    "How can you annotate variants and affected genes with prior knowledge from human genetic and cancer-specific databases to generate clinically relevant reports?"
  ],
  "objectives": [
    "Call variants and their somatic status from whole-exome sequencing data",
    "Annotate variants with a wealth of human genetic and cancer-specific information extracted from public databases",
    "Add gene-level annotations and generate reports of annotated somatic and germline variants, loss-of-heterozygosity (LOH) events, and affected genes, ready for interpretation by clinicians"
  ],
  "time_estimation": "7h",
  "key_points": [
    "Follow best practices for read mapping, quality control and mapped reads postprocessing to minimize false-positive variant calls.",
    "Use a dedicated somatic variant caller to call variants and to classify them into somatic, germline and LOH event variants on statistical grounds.",
    "Annotations and queries based on variant properties add relevance to variant and gene reports.",
    "A framework like GEMINI is very helpful for managing, annotating and querying lists of variants in a flexible way.",
    "Prefer public, free annotation sources to foster reproducibility and information sharing."
  ],
  "contributors": [
    {
      "name": "Wolfgang Maier",
      "joined": "2017-09",
      "id": "wm75",
      "url": "https://training.galaxyproject.org/training-material/api/contributors/wm75.json"
    }
  ],
  "last_modified_at": "12-Mar-21",
  "url": "/topics/variant-analysis/tutorials/somatic-variants/tutorial.html",
  "topic_name": "variant-analysis",
  "tutorial_name": "somatic-variants"
}