{
  "layout": "tutorial_hands_on",
  "title": "Avian influenza viral strain analysis from gene segment sequencing data",
  "enable": false,
  "level": "Intermediate",
  "questions": [
    "With reassortment of gene segments being a common event in avian influenza virus (AIV) evolution, does it make sense to use a reference-based mapping approach for constructing consensus genome sequences for AIV samples?",
    "Is it possible to reuse existing tools and workflows developed for the analysis of sequencing data from other viruses?",
    "How can we obtain meaningful phylogenetic insight from AIV consensus sequences?"
  ],
  "objectives": [
    "Determine how reassortment impacts reference-based mapping approaches",
    "Use a collection of per-segment reference sequences to construct a hybrid reference genome that is sufficiently close to a sequenced sample to be useful as a reference for mapping",
    "Construct a sample consensus genome from mapped reads",
    "Generate per-segment phylogenetic trees of AIV consensus sequences"
  ],
  "time_estimation": "4H",
  "key_points": [
    "Reassortment of gene segments makes reference-based mapping of influenza sequencing data challenging",
    "An alternative to *de-novo* assembly can be mapping to a dynamically chosen reference genome",
    "Variant calling and consensus genome construction can follow workflows used also for other viral sequence data",
    "Standard phylogenetic tools can be used to find relationships between influenza samples but should be used on a per-segment basis"
  ],
  "contributors": [
    {
      "name": "Wolfgang Maier",
      "joined": "2017-09",
      "elixir_node": "de",
      "id": "wm75",
      "url": "https://training.galaxyproject.org/training-material/api/contributors/wm75.json"
    }
  ],
  "tags": [
    "virology",
    "public health",
    "work-in-progress"
  ],
  "url": "/topics/variant-analysis/tutorials/aiv-analysis/tutorial.html",
  "topic_name": "variant-analysis",
  "tutorial_name": "aiv-analysis"
}