{"layout":"tutorial_hands_on","redirect_from":["/topics/instructors/philosophies/","/short/teaching/experiences","/short/T00277"],"title":"Teaching experiences","subtopic":"practises","time_estimation":"1h","questions":["How to teach using Galaxy?","What are the different practises?"],"objectives":["Learn how others teach using Galaxy"],"key_points":["Every instructor has their prefered way to teach using Galaxy"],"contributors":[{"name":"Bérénice Batut","email":"berenice.batut@gmail.com","twitter":"bebatut","linkedin":"berenicebatut","matrix":"bebatut:matrix.org","orcid":"0000-0001-9852-1987","joined":"2017-09","elixir_node":"fr","contact_for_training":true,"location":{"country":"FR","lat":45.77,"lon":3.08},"fediverse":"https://piaille.fr/@bebatut","fediverse_flavor":"mastodon","affiliations":["gallantries","ifb","elixir-europe"],"id":"bebatut","url":"https://training.galaxyproject.org/training-material/api/contributors/bebatut.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/bebatut/"},{"name":"Fotis E. Psomopoulos","email":"fpsom@certh.gr","twitter":"fopsom","matrix":"fpsom:matrix.org","orcid":"0000-0002-0222-4273","linkedin":"fpsom","joined":"2019-03","elixir_node":"gr","affiliations":["gallantries","elixir-europe"],"id":"fpsom","url":"https://training.galaxyproject.org/training-material/api/contributors/fpsom.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/fpsom/"}],"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"T00277","url":"/topics/teaching/tutorials/experiences/tutorial.html","topic_name":"teaching","tutorial_name":"experiences","dir":"topics/teaching/tutorials/experiences","symlink":null,"id":"teaching/experiences","ref_tutorials":["<p>We all teach in different ways, share your training philosophy and help other instructors find the way that is best for them!</p>\n\n<p>Some instructors have contributed their ideas. You can read their stories below.</p>\n\n<h1 id=\"teaching-stories\">Teaching stories</h1>\n\n<div id=\"bebatut\">\n    <h2>Bérénice Batut</h2>\n    <div class=\"hall-of-fame-hero\">\n        <a href=\"/training-material/hall-of-fame/bebatut/\" class=\"thumbnail\">\n            <img src=\"https://avatars.githubusercontent.com/bebatut\" alt=\"bebatut's avatar\" />\n        </a>\n        <div class=\"contact-items\">\n            \n                <a title=\"GitHub\" href=\"https://github.com/bebatut\">\n                    <i class=\"fab fa-github\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">github</span>\n                </a>\n            \n            \n                <a title=\"E-mail\" href=\"mailto:berenice.batut@gmail.com\">\n                    <i class=\"far fa-envelope\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">email</span>\n                </a>\n            \n            \n            \n                <a title=\"Twitter\" href=\"https://twitter.com/bebatut\">\n                    <i class=\"fab fa-twitter\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">twitter</span>\n                </a>\n            \n            \n                <a title=\"LinkedIn\" href=\"https://www.linkedin.com/in/berenicebatut\">\n                    <i class=\"fab fa-linkedin\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">linkedin</span>\n                </a>\n            \n            \n                <a title=\"ORCID\" href=\"https://orcid.org/0000-0001-9852-1987\">\n                    <i class=\"fab fa-orcid\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">orcid</span>\n                </a>\n            \n        </div>\n    </div>\n    <p>When I am giving a training using Galaxy (e.g. ref-based RNA-seq), I usually give a 10-20 min introduction to RNA, RNA-seq using the slides that in the transcriptomics topic.</p>\n\n<p>Then I switch to the tutorial. I show the participants where to find the tutorial on the training material website. I introduce the tutorial story: explain that we want to reproduce an analysis from a paper, introduce this paper, talk about the datasets/samples we will use.</p>\n\n<p>After that, I open Galaxy and I go step by step through the analysis with them:</p>\n<ul>\n  <li>introduce the step: give an idea why we need this step</li>\n  <li>talk a bit about the “theory” of this step\n    <ul>\n      <li>using the schemas in the tutorial to explain for example RNA-seq mapping</li>\n      <li>using legos to explain mapping (and let them try to map lego reads on a reference genome)</li>\n    </ul>\n  </li>\n  <li>open the tools in Galaxy and going through the parameters with them, explaining the main parameters and their potential effect</li>\n  <li>run the tool</li>\n  <li>inspect the generated output with them, insist on each new format</li>\n  <li>ask the questions that are in the question boxes and/or to do an extra step (identify a new tool, identify and use different parameters, etc)</li>\n</ul>\n\n<p>At some point, I introduce the step and explain the purpose of the step, but let them do it by themselves.</p>\n\n<p>At the end of the tutorial, I spent some time to go through again each step, asking them again why this step, what were the inputs/outputs and in which format, repeating again :smile:</p>\n\n<p>Here is the way I usually give a data analysis training using Galaxy. What is your way?</p>\n\n</div>\n\n<div id=\"moheydarian\">\n    <h2>Mo Heydarian</h2>\n    <div class=\"hall-of-fame-hero\">\n        <a href=\"/training-material/hall-of-fame/moheydarian/\" class=\"thumbnail\">\n            <img src=\"https://avatars.githubusercontent.com/moheydarian\" alt=\"moheydarian's avatar\" />\n        </a>\n        <div class=\"contact-items\">\n            \n                <a title=\"GitHub\" href=\"https://github.com/moheydarian\">\n                    <i class=\"fab fa-github\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">github</span>\n                </a>\n            \n            \n                <a title=\"E-mail\" href=\"mailto:mheydarian@gmail.com\">\n                    <i class=\"far fa-envelope\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">email</span>\n                </a>\n            \n            \n            \n            \n            \n                <a title=\"ORCID\" href=\"https://orcid.org/0000-0001-9449-9364\">\n                    <i class=\"fab fa-orcid\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">orcid</span>\n                </a>\n            \n        </div>\n    </div>\n    <p>I prefer to have workshop attendees interacting with Galaxy as much as possible during a workshop. I begin workshops with an overview of the agenda and some brief background on the Galaxy Project. I quickly move attendees over to the Galaxy instance and interactively walk through the Galaxy interface and have them register accounts.\nFrom this point on, the workshop is hands-on and attendees are working through vetted exercises. Before executing an exercise, I like to go back to the slides to show some type of schematic representing the exercise and adding some biological context (i.e. showing overlapping intervals if working with ChIPseq peaks and promoters). I like using example data I am familiar with so that I can finish each exercise with some biological insight that was gained from the exercise.\nI like to end workshops by introducing relevant sub-communities of Galaxy (GTN, Galaxy Biostars) and highlighting Galaxy events (GCC) that enable engagement with the Galaxy Community beyond the workshop.</p>\n\n<p>Things to do before the workshop</p>\n<ul>\n  <li>Set up a registration system (Google Forms works fine)</li>\n  <li>Figure out the wifi, projector, seating capacity situation.</li>\n  <li>Test compute resources, hands-on exercises in advance</li>\n  <li>Pre-load sample data, if possible</li>\n  <li>Email outreach@galaxyproject.org to have your workshop added to the Galaxy Events Calendar. Tweet about your workshop using the #useGalaxy hashtag</li>\n</ul>\n\n<p>Things to do the day of the workshop</p>\n<ul>\n  <li>Show up early\n    <ul>\n      <li>Test wifi and arrange tables/chairs so you can easily move around the room to assist workshop attendees</li>\n      <li>Write the web address to the Galaxy instance(s) on a board somewhere, include web address to slides if applicable</li>\n    </ul>\n  </li>\n  <li>Have workshop attendees complete a feedback form after workshop</li>\n</ul>\n\n<p>Additional considerations</p>\n<ul>\n  <li>Slow down and speak up - Speak slow and loud so everyone hears and understands what you are saying.</li>\n  <li>Two is better than one - I prefer to have two people conducting a workshop. One person is guiding attendees through exercises, while the other is floating among the audience, helping anyone who has fallen behind.</li>\n  <li>Leave no one behind - I have noticed that if a person falls behind the pace of the group, especially the presenter, even a little, they have a difficult time re-engaging. I try to prevent this by frequently verbally repeating exactly what I am clicking on while presenting the hands-on exercises.</li>\n</ul>\n\n</div>\n\n<div id=\"shiltemann\">\n    <h2>Saskia Hiltemann</h2>\n    <div class=\"hall-of-fame-hero\">\n        <a href=\"/training-material/hall-of-fame/shiltemann/\" class=\"thumbnail\">\n            <img src=\"https://avatars.githubusercontent.com/shiltemann\" alt=\"shiltemann's avatar\" />\n        </a>\n        <div class=\"contact-items\">\n            \n                <a title=\"GitHub\" href=\"https://github.com/shiltemann\">\n                    <i class=\"fab fa-github\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">github</span>\n                </a>\n            \n            \n                <a title=\"E-mail\" href=\"mailto:saskia.hiltemann@gmail.com\">\n                    <i class=\"far fa-envelope\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">email</span>\n                </a>\n            \n            \n            \n            \n                <a title=\"LinkedIn\" href=\"https://www.linkedin.com/in/shiltemann\">\n                    <i class=\"fab fa-linkedin\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">linkedin</span>\n                </a>\n            \n            \n                <a title=\"ORCID\" href=\"https://orcid.org/0000-0003-3803-468X\">\n                    <i class=\"fab fa-orcid\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">orcid</span>\n                </a>\n            \n        </div>\n    </div>\n    <p>First off, I really like this idea of collecting different instructor’s experiences, and love hearing about other people’s styles, I am still trying to find what works best in which situations and this is great!</p>\n\n<p>I have a similar philosophy, I like to start off with introductory slides, but not too long, I prefer the focus to be on the hands-on part. How exactly I do the hands-on part (whether I perform each step centrally and have students follow along, or if I have them work through the manual at their own pace and walk around for some 1-on-1 questions/discussions- depends heavily on the audience and topic. Some considerations:</p>\n\n<ul>\n  <li>I often have groups of very mixed backgrounds, e.g. bioinformatics postdocs together with seasoned biology professors/PIs and medical clinicians (who aren’t quite as computer savvy), together with university teachers looking to incorporate Galaxy into their curricula; and they typically go at vastly different paces. If I do things centrally, some will struggle to keep up and feel lost, and others may feel like things are going too slowly/be bored. In these cases I tend to prefer to let people go at their own pace, I think it is better if some people only make it halfway through the tutorial but at least understand that half well, rather than pulling them through too fast and leave them feeling like Galaxy is too complex for them. This also enables people to focus on/play around with the aspects that are interesting to them, some people want to understand every detail of the file formats, others just want to get a global picture of the topic and then explore unrelated aspects of Galaxy when they have time left over, or have a discussion with one of the instructors. Everybody gets something different from the workshop and that’s ok!</li>\n  <li>Doing everything centrally has downside that not everybody feels comfortable asking their questions in front of the class, but letting participants go at their own pace and answering questions one-on-one can be nicer for them (feasibility of this also depends on ratio of trainers-to-trainees, you want to be able to spend enough time chatting with everybody). This also gives opportunity for participants to ask questions that are specific to their research/situation etc.</li>\n  <li>Working centrally does help pull people along if time is tight or if motivation is a concern (i.e. the researchers I teach are usually intrinsically motivated or they wouldn’t be there in the first place, but teaching e.g. bachelor students who are only there because they have to be, was a very different experience ;))</li>\n  <li>I usually end up doing something in the middle, most tutorials are naturally divided into substeps (e.g. QC/analysis/visualization/interpretation). After introductory slides, I introduce first hands-on subpart, ask them to work through manual themselves until they reach part X (say 30 minutes), walk around helping people when they get stuck or have questions, then do a quick recap centrally of what we did and why, ask them some questions to test their understanding, and then introduce the next section (often switching back to a few slides) and repeat.</li>\n</ul>\n\n<p>Other random points:</p>\n\n<ul>\n  <li>I like to walk around the room continually when not doing anything centrally, a lot of people are much more inclined to ask a question when you are standing right there next to them than when they have to get your attention from across the room.</li>\n  <li>Repeat, repeat, repeat. You really can’t explain things often enough, so mention things in the introductory slides, then repeat them during the hands-on session, then again during a wrap-up at end.</li>\n  <li>I like to encourage people to work in pairs, it forces them to discuss things with each other, and on the practical side: if they bring their own laptops or are in a computer room that doesn’t have dual monitors, having the manual open on one screen and Galaxy on the other is a nice way to work (split screen is not always very practical on small screens)</li>\n  <li>I show up early to prepare the room, makes sure there is power for everybody, the wifi works etc, familiarize myself with the systems for presenting slides etc, chitchat with participants as they trickle in, make yourself approachable</li>\n  <li>I like to prepare some organizational slides containing all other links the participants will need, the schedule, the materials, location of lunch etc, and make this into a tinyurl so that it is easy for participants to remember; one link to rule them all (for example https://tinyurl.com/GalaxyWorkshop from my last course, I just change content of slides for every new workshop)</li>\n  <li>Before they leave, make sure participants have everything they need to keep learning; the tutorials and slides, but also ensure they know where to ask questions and engage with the community; biostars, gitter, github, mailing lists, events calendar etc.</li>\n  <li>I keep a running list of issues we run into during the course, and can use this to improve the training materials later, or read through when preparing the next course, but I usually forget most of these points if I don’t write them down as they occur.</li>\n  <li>Have fun! If the workshop is enjoyable for you that will rub off on the students, so find the style that feels best for you! :)</li>\n</ul>\n\n<p>EDIT: I just wanted to add that this is just a list of things I <em>try</em> to do and stick to, but in reality I often forget to do several of these things or things don’t work out as intended/hoped or are complicated by circumstances of the day. And I am still continually revising this list and updating how I do things based on feedback from participants and tips I pick up from watching others teach etc</p>\n\n</div>\n\n<div id=\"hexylena\">\n    <h2>Helena Rasche</h2>\n    <div class=\"hall-of-fame-hero\">\n        <a href=\"/training-material/hall-of-fame/hexylena/\" class=\"thumbnail\">\n            <img src=\"https://avatars.githubusercontent.com/hexylena\" alt=\"hexylena's avatar\" />\n        </a>\n        <div class=\"contact-items\">\n            \n                <a title=\"GitHub\" href=\"https://github.com/hexylena\">\n                    <i class=\"fab fa-github\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">github</span>\n                </a>\n            \n            \n            \n            \n            \n            \n                <a title=\"ORCID\" href=\"https://orcid.org/0000-0001-9760-8992\">\n                    <i class=\"fab fa-orcid\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">orcid</span>\n                </a>\n            \n        </div>\n    </div>\n    <p>Love this idea! Y’all’s posts were really helpful in the past days to give me some ideas and inspiration and maybe? a bit more confidence for holding my section of a workshop tuesday. It’s been… a couple of years since I gave a training, so I feel <em>incredibly</em> unqualified to post next to y’all since y’all do this way more regularly.</p>\n\n<p>But I gave a sysadmin-focused training yesterday and it was somewhat different to most of the stories here, so I’m writing this in case other admin trainers can find something useful.</p>\n\n<p><strong>Some philosophy things</strong></p>\n\n<ul>\n  <li>Like <a href=\"#shiltemann\">@shiltemann</a> I really prefer the at-your-own-pace. For really complex admin tasks + different skill levels, I find it a good fit. Everyone has their own gaps in knowledge due to specialisation, or their own issues due to their compute environment. Being able to help debug one-on-one with the particular problems of users is efficient for allowing everyone to continue making progress, no matter what their pace. Similarly people have different interests, sometimes you can spark them by linking to the “detailed capabilities” pages, so like the full list of things ansible can do out of the box, or everything terraform can manage. Maybe they can get inspiration from this list for how to apply the tool to their setup.</li>\n  <li>Doing everything centrally can also work if everyone is on a standard environment. Here you can explain things in detail and have more opportunities for asking questions to the audience to check understanding which you miss out on in the one-on-ones</li>\n  <li>Put everyone on the same, standardised environment. Provide some cloud VM with a web based file browser/editor/etc (e.g. Jupyterlab/Cloud9). If possible, provide a URL for the already running machines to the trainees; sometimes they forget to download the VM+setup virtualbox ahead of time.</li>\n  <li>Before teaching any training module for the first time, run through it with a less experienced colleague. Administration topics often include large silent assumptions about prior knowledge. Running through the training with them will let you identify these issues and then you include any missing background knowledge in collapsible boxes or tips boxes.</li>\n  <li>In a similar vein, be extremely specific in instructions. Where should each command be executed (maybe include terminal prompt, user@laptop vs user@cloud), exactly which URL people should be at for other tasks.</li>\n  <li>Not everyone will be proactive in asking questions/putting their stickers up; it is good to walk around and talk to people often and ask how they’re progress or finding things even if they seem to be doing ok. In my experience they’ll often have issues that you can answer briefly or questions related to the use of the material in their own projects</li>\n  <li>If possible, find common ground amongst participants (everyone needs to … build reproducible environments, everyone needs to <code class=\"language-plaintext highlighter-rouge\">___</code>) and from this, provide them with motivation for learning the tool you are teaching. In some trainings this is easier to do than others, and it depends on your audience and the topic.</li>\n  <li>Have backup plans for your backup plans. If something out of your control goes wrong, at least knowing you have a plan can be reassuring as a trainer</li>\n</ul>\n\n<p><strong>Things I wish someone had reminded me of before hand</strong></p>\n\n<ul>\n  <li>To reiterate <a href=\"#moheydarian\">@MoHeydarian</a>, especially if you’re a native speaker, talk slowly,  clearly, loudly, and with as little slang/jargon as possible.</li>\n  <li>From <a href=\"#shiltemann\">@shiltemann</a> to me: “don’t be too hard on yourself. It’s tough, nothing will go perfectly smoothly”</li>\n</ul>\n\n<p><strong>Other</strong></p>\n\n<ul>\n  <li><a href=\"#shiltemann\">@shiltemann</a>’s tip about a tinyurl with all of the links was really useful, everyone could find the documentation without too much trouble!! Loved that.</li>\n</ul>\n\n</div>\n\n<div id=\"TKlingstrom\">\n    <h2>Tomas Klingström</h2>\n    <div class=\"hall-of-fame-hero\">\n        <a href=\"/training-material/hall-of-fame/TKlingstrom/\" class=\"thumbnail\">\n            <img src=\"https://avatars.githubusercontent.com/TKlingstrom\" alt=\"TKlingstrom's avatar\" />\n        </a>\n        <div class=\"contact-items\">\n            \n                <a title=\"GitHub\" href=\"https://github.com/TKlingstrom\">\n                    <i class=\"fab fa-github\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">github</span>\n                </a>\n            \n            \n                <a title=\"E-mail\" href=\"mailto:tomas.klingstrom@slu.se\">\n                    <i class=\"far fa-envelope\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">email</span>\n                </a>\n            \n            \n            \n                <a title=\"Twitter\" href=\"https://twitter.com/TKlingstrom\">\n                    <i class=\"fab fa-twitter\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">twitter</span>\n                </a>\n            \n            \n            \n                <a title=\"ORCID\" href=\"https://orcid.org/0000-0002-9504-1352\">\n                    <i class=\"fab fa-orcid\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">orcid</span>\n                </a>\n            \n        </div>\n    </div>\n    <p>I have been working in three very different training environments.</p>\n\n<ol>\n  <li>Lecturing with a biology students in an applied bioinformatics course.</li>\n  <li>Classroom training with biobank experts working to create a more comprehensive service for users.</li>\n  <li>One of one with system administrators expanding into the technical part of bioinformatics support.</li>\n</ol>\n\n<p>I agree with everything said above so I will try to add some more specialised flavour. I would also like to add that I think the Galaxy Training resources are absolutely fantastic and if I get the opportunity to hold a more comprehensive course (ie more than half a day) I will structure it so that we have one quick joint introduction and then conduct a number of interactive tutorials using the training portal.</p>\n\n<p><strong>Case 1 students</strong></p>\n<ul>\n  <li>For students context is king. I think almost everyone how many open resources there are available in the world and this is especially true for students. Knowing what is available for download and/or through the “Get data” tab of Galaxy is therefore a valuable exercise in itself, likewise informing the students about key resources such as the GTN, Biostars and Stack Overflow is very important.</li>\n  <li>Students often spend so much time writing/clicking commands that they forget about the biological context. As a teacher I think it therefore is very important to help students take a step back and ask themselves why they do a step. For example, after doing the steps to assembly RNA-seq reads it is good to break the work, show an assembly of an mRNA and help them remember what we have done and then explain how the next steps are to map it to the genome so that we can identify it in an unambiguous manner before doing the statistics.</li>\n</ul>\n\n<p><strong>Case 2 experts</strong></p>\n<ul>\n  <li>Catching the attention of experts (in another field than bioinformatics) is often a bit of a challenge. Not due to a lack of interest but because their focus is often on a narrow but very well defined area. Meaning that it is often very valuable to pre-plan exercises to be directly applicable within their own research. Ideally I would like to work give a training in such a situation that even the “get data step” is based on their local environment but that is unlikely to be possible in most cases.</li>\n</ul>\n\n<p><strong>Case 3 system administrators</strong>\nDuring our set up in Gambia I had a very positive experience regarding using the Dockerized Galaxy set up. Configuring environmental variables and then just running the docker run command gives a very good insight in how to adapt the system for a local environment without running the risk of ruining your environments. At SLU I am now working to take this a step further with a Nextcloud implementation that provide us with a back end for handling FTP data to and from the docker FTP server.</p>\n\n</div>\n\n<div id=\"abretaud\">\n    <h2>Anthony Bretaudeau</h2>\n    <div class=\"hall-of-fame-hero\">\n        <a href=\"/training-material/hall-of-fame/abretaud/\" class=\"thumbnail\">\n            <img src=\"https://avatars.githubusercontent.com/abretaud\" alt=\"abretaud's avatar\" />\n        </a>\n        <div class=\"contact-items\">\n            \n                <a title=\"GitHub\" href=\"https://github.com/abretaud\">\n                    <i class=\"fab fa-github\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">github</span>\n                </a>\n            \n            \n                <a title=\"E-mail\" href=\"mailto:anthony.bretaudeau@inrae.fr\">\n                    <i class=\"far fa-envelope\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">email</span>\n                </a>\n            \n            \n            \n                <a title=\"Twitter\" href=\"https://twitter.com/abretau\">\n                    <i class=\"fab fa-twitter\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">twitter</span>\n                </a>\n            \n            \n            \n                <a title=\"ORCID\" href=\"https://orcid.org/0000-0003-0914-2470\">\n                    <i class=\"fab fa-orcid\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">orcid</span>\n                </a>\n            \n        </div>\n    </div>\n    <p>My turn!</p>\n\n<p>I mostly do training sessions for Conda and Galaxy tool dev, and some of the tutorials from GTN, mainly assembly and annotation until now.</p>\n\n<p>The last time we did the Conda/tool dev one, some people wanted a tool dev training, some others wanted a Conda training. So we made it in 2 (small) days: 1 for conda, then 1 for tool dev. It worked great like this, people could come to Conda only or both Conda + tool dev.</p>\n\n<p>For data analysis trainings, we usually focus on one topic, for half a day, or a full day.</p>\n\n<p>For all these trainings, we have well-equiped training rooms with 1 PC for 1 or 2 people. Often people come with their own laptop. We leave them free to use it: if it’s for data analysis, it should just work with a modern web browser (and it’s good to work in their familiar environment). For dev, they just use a ready to use virtualbox image (we have it on usb stick if needed).</p>\n\n<p>A few principles I try to adopt:</p>\n\n<ul>\n  <li>Be simple: we try to keep it as informal as possible, with no registration fees, and invite (local) people to join just by sending us an email. I think it allows people to feel more free to come (they dont have to ask their boss for money). The little downside is of course that some of them can be less motivated, and can cancel at the last moment. But it’s ok for us.</li>\n  <li>Make it a fun moment: I love making bad jokes and silly puns (and I’m not ashamed). The good thing is that it makes the atmosphere more relaxed, and people are usually more prone to discussion when they’re relaxed (they have no risk to be more ridiculous than I am). I feel that if a training session is very boring, people will disconnect after a moment, they will not come back to another session, and I will not be willing to do it another time as a trainer. So, have fun.</li>\n  <li>Adapt to the audience: if a participant needs to focus on a specific question/kind of data/whatever, try to integrate it in the training. In our case, we usually propose a training after someone asks us to do it, so it’s easy to discuss it beforehand and try to adapt to their need.</li>\n  <li>Keep contact with people: I hate it when a trainer is just reciting the slides, not even looking at people. So I try to keep contact with attendees, asking questions, trying to detect when someone gets lost, reexplaining when I see that something is not clear.</li>\n  <li>Be honest: don’t try to hide when you don’t know an answer or if there’s an unexpected result. It’s a good opportunity to look for the answer or understand what’s going on together.</li>\n  <li>Don’t be alone: I prefer to be at least 2 trainers. It allows to answer questions more quickly, and to reexplain things differently if needed. (and it is more fun too)</li>\n</ul>\n\n<p>We also do a full week of bioinformatics training for biology students (I don’t participate to all the sessions though). Most of them have never manipulated a fastq file, but they have a good biology background.\nEach day we begin with slides to introduce the topic (2~3 hours), and the rest of the day they run the hands-on.\nThe first day is an introduction: why computing matters in biology? what is a computing cluster? what is Galaxy? Then they run the Galaxy 101/peaks2genes tutorials.\nSecond day is for genome assembly and annotation, third day is RNASeq analysis, and then they have some snp calling and metagenomic.\nThe program might look scary, but we don’t try to make them experts of each kind analysis, we just try to give them a concetre overview of what it looks like to do real data analysis.</p>\n\n<p>For the hand-on we (2 trainers) usually give them access to the tutorial, give them a brief overview of the goal, and then just let them work. We keep on circulating, checking that no one is blocked, answering questions. When we get 2 or 3 times the same question, or if we see they have difficulties, we stop everyone and clarify the problem.</p>\n\n<ul>\n  <li>I’m always amazed how quickly they understand how to use Galaxy</li>\n  <li>Tutorials are well suited to this audience, they just follow it and that’s it</li>\n  <li>The downside is that if you don’t discuss with the students, they can just follow the tutorial, get their result, even if they have not understood anything. As they’re shy and forced to be here, they won’t necessarily ask for help…</li>\n  <li>As they’re shy and forced to be here, we get few questions during the slides too.</li>\n  <li>To fight this, and as we are evils, we hide some answers to the questions in the tutorial (we give them a pdf), and we ask them to write them in a report. We also add a few questions on the slides too, to make sure they listen. We don’t really care if they cheat, and we help them if they’re blocked. It’s just a way to force them to think about what they do. Not completely satisfied with this system, maybe we’ll change it next year…</li>\n</ul>\n\n<p>That’s it for me.</p>\n\n</div>\n"],"ref_slides":[],"hands_on":true,"slides":false,"mod_date":"2022-09-23 13:01:06 +0000","pub_date":"2022-09-23 10:02:09 +0000","version":4,"api":"https://training.galaxyproject.org/training-material/api/topics/teaching/tutorials/experiences/tutorial.json","tools":[],"supported_servers":[],"topic_name_human":"Teaching and Hosting Galaxy training","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial"}