{"layout":"tutorial_hands_on","title":"Design and plan session, course, materials","subtopic":"pedagogy","time_estimation":"60m","questions":["Is the structured approach to course design?","How to articulate learning outcomes commensurate with the cognitive complexity of the target learning?","How to devise learning experiences and course content?","What are the steps that can help trainers devise and deploy effective courses?"],"objectives":["List five key phases of curriculum & course development","Explain the primary role of learning outcomes","Write learning outcomes for a course","Identify the Bloom’s-level accomplishments that different types of learning experience are likely to support","Describe the role of learning outcomes in selecting relevant content","Distinguish different types of assessment & their role in supporting learner progression towards learning outcomes","Summarise the benefits of course evaluation"],"key_points":["Course development is a multi-step, iterative process","The first step is to identify intended (SMART) LOs","Identification  of  key  content  only  becomes  relevant  after  LOs  & suitable LEs have been identified","Bloom's taxonomy can facilitate the articulation of measurable LOs, & support the development of cognitive complexity through them","Messick's questions help to align KSAs, instruction & assessment","For  successful  outcomes,  learners  &  the  course  must  be  evaluated (it isn't sufficient simply to note 'completers' or learner satisfaction)","A successful course guides learners from entry-level performance to the minimum performance level for achieving its target LOs","In a course designed to support learners & LOs, the instruction that's delivered & learning that's intended are more likely to align, thereby providing the optimal circumstances for learner success."],"requirements":[{"type":"internal","topic_name":"contributing","tutorials":["learning-principles"]}],"contributions":{"authorship":["bebatut","fpsom","allegravia","ppalagi","elixir-goblet-ttt"],"funding":["gallantries"]},"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"T00062","url":"/topics/contributing/tutorials/design/tutorial.html","topic_name":"contributing","tutorial_name":"design","dir":"topics/contributing/tutorials/design","symlink":null,"id":"contributing/design","ref_tutorials":["<p><strong>Teaching and training</strong>, core elements of academic life, can be enormously\nrewarding but also quite challenging. Instructors are often required to perform\nunder various constraints, and frequently have to accommodate, engage and\nmotivate student cohorts with very different backgrounds and aptitudes in\nlimited time-frames. This can be daunting for experienced teachers, but\nespecially so for those who’re relatively new to teaching and training.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Definitions of key terms</comment-title>\n\n  <p><strong>Training</strong>: instruction delivered via short courses designed to expand or\nbuild knowledge &amp; practical skills in a given field, often conducted in the\nworkplace or training centre to ‘up-skill’ members of a workforce</p>\n\n  <p><strong>Teaching</strong>: usually, instruction delivered over long time-scales via a\nseries of courses (in schools, colleges, universities, etc.) designed to\ncontribute to a formal programme that, if completed successfully, yields an\naccredited qualification in a given field (e.g., a degree)</p>\n\n</blockquote>\n\n<p>Formal education enterprises generally begin with <strong>curriculum</strong>\n(<span class=\"citation\"><a href=\"#european2008terminology\">for the Development of Vocational Training 2008</a></span>) design: this involves specifying</p>\n\n<ol>\n  <li>its purpose or <strong>Teaching Goals (TGs)</strong>;</li>\n  <li>its duration;</li>\n  <li>the <strong>Knowledge, Skills and Abilities (KSAs)</strong> intended to be achieved,\nexpressed as a set of <strong>Learning Outcomes (LOs)</strong>;</li>\n  <li>how learners will demonstrate achievement of those LOs;</li>\n  <li>the materials, <strong>Learning Experiences (LEs)</strong> and assignments instructors\nwill use to support learner progression towards the LOs;</li>\n  <li>the assessments for evaluating student learning and teaching effectiveness.</li>\n</ol>\n\n<blockquote class=\"comment\">\n  <comment-title>Definitions of key terms</comment-title>\n\n  <p><strong>Curriculum</strong>: the inventory of tasks involving the design, organisation &amp;\nplanning of an education or training enterprise, including specification of\nlearning outcomes, content, materials &amp; assessments, &amp; arrangements for\ntraining teachers &amp; trainers</p>\n\n  <p><strong>Knowledge, Skills and Abilities (KSAs)</strong>: list of special qualifications and\npersonal attributes that learners should have after a training</p>\n  <ul>\n    <li><strong>Knowledge</strong>: the subjects, topics, and items of information that learners\nshould know</li>\n    <li><strong>Skills</strong>: technical or manual proficiencies which are usually learned or\nacquired through training.</li>\n    <li><strong>Abilities</strong>: the present demonstrable capacity to apply several knowledge\nand skills simultaneously in order to complete a task or perform an\nobservable behaviour.</li>\n  </ul>\n\n  <p><strong>Learning Outcomes (LOs)</strong>: the KSAs that learners should be able to\ndemonstrate after instruction, the tangible evidence that the teaching goals\nhave been achieved; LOs are learner-centric</p>\n\n  <p><strong>Learning Experience (LE)</strong>: any setting or interaction in or via which\nlearning takes place: e.g., a lecture, game, exercise, role-play, etc.</p>\n\n  <p><strong>Teaching Goal (TG)</strong>: the intentions of an instructor regarding the purpose\nof a curriculum/course/lesson/activity/set of materials; TGs are\ninstructor-centric (also termed instructional objectives)</p>\n\n</blockquote>\n\n<p>Emphasis is placed on teaching and learning, and mechanisms for collecting\nevidence that learners have changed over time\n(<span class=\"citation\"><a href=\"#tractenberg2020guidelines\">Tractenberg <i>et al.</i> 2020</a></span>). In this latter sense, the concept of\n‘curriculum’ differentiates formal teaching from training, as formal programmes\nusually afford time for learners both to be able to progress and to <strong>demonstrate\ntheir progression</strong>.</p>\n\n<p>By contrast, training courses are much shorter (measured in days or weeks,\nrather than years); they hence necessarily focus on acquiring specific KSAs in\nlimited time-frames, generally without consideration of learner progression\nbeyond the course. However, the essential features of <strong>effective curricula</strong>\n(i.e., those that achieve their stated LOs for the majority of learners) pertain\nto instruction on any time-scale; they are thus also relevant for short courses,\nand provide important considerations for those involved in, or embarking upon,\ncourse design (whether face-to-face or online).</p>\n\n<p>With this in mind, this tutorial outlines key steps of curriculum development –\nand the role of Bloom’s taxonomy (<span class=\"citation\"><a href=\"#bloom1956taxonomy\">Bloom 1956</a></span>) – that can be\nused to inform the design of effective courses.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Sources</comment-title>\n\n  <p>This tutorial is significantly based on <span class=\"citation\"><a href=\"#via2020course\">Via <i>et al.</i> 2020</a></span>, one session\nof ELIXIR-GOBLET Train the Trainer curriculum and\n<span class=\"citation\"><a href=\"#tractenberg2020guidelines\">Tractenberg <i>et al.</i> 2020</a></span></p>\n\n</blockquote>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Select a topic for a 3 minute training - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 1 min - Silent reflection</hands-on-title>\n\n  <ul>\n    <li>\n      <p>Choose a topic for a 3 minutes training related to Galaxy</p>\n\n      <p>Examples:</p>\n      <ul>\n        <li>Introduction to Galaxy interface</li>\n        <li>How to upload data to Galaxy</li>\n        <li>Galaxy Training Network</li>\n      </ul>\n    </li>\n    <li>Identify the target audience</li>\n    <li>Identify the prerequisites</li>\n  </ul>\n</blockquote>\n\n<blockquote class=\"tip\">\n  <tip-title>Check the tutorial on principles of learning</tip-title>\n\n  <p>For more details about how learning works and values, check our\n<a href=\"/training-material/topics/contributing/tutorials/learning-principles/tutorial.html\">tutorial</a></p>\n\n</blockquote>\n\n<blockquote class=\"agenda\">\n  <agenda-title></agenda-title>\n\n  <p>In this tutorial, we will cover:</p>\n\n<ol id=\"markdown-toc\">\n  <li><a href=\"#formal-curriculum-design\" id=\"markdown-toc-formal-curriculum-design\">Formal curriculum design</a>    <ol>\n      <li><a href=\"#different-types-of-curriculum\" id=\"markdown-toc-different-types-of-curriculum\">Different types of curriculum</a></li>\n      <li><a href=\"#structuring-curriculum-design\" id=\"markdown-toc-structuring-curriculum-design\">Structuring curriculum design</a></li>\n    </ol>\n  </li>\n  <li><a href=\"#nicholls-five-phases-of-curriculum-design\" id=\"markdown-toc-nicholls-five-phases-of-curriculum-design\">Nicholl’s five phases of curriculum design</a>    <ol>\n      <li><a href=\"#define-intended-learning-outcomes-los\" id=\"markdown-toc-define-intended-learning-outcomes-los\">Define intended Learning Outcomes (LOs)</a></li>\n      <li><a href=\"#select-les-that-will-lead-to-the-los\" id=\"markdown-toc-select-les-that-will-lead-to-the-los\">Select LEs that will lead to the LOs</a></li>\n      <li><a href=\"#select-and-develop-content-relevant-to-the-los\" id=\"markdown-toc-select-and-develop-content-relevant-to-the-los\">Select and develop content relevant to the LOs</a></li>\n      <li><a href=\"#develop-assessments-to-ensure-progression\" id=\"markdown-toc-develop-assessments-to-ensure-progression\">Develop assessments to ensure progression</a></li>\n      <li><a href=\"#evaluate-course-effectiveness\" id=\"markdown-toc-evaluate-course-effectiveness\">Evaluate course effectiveness</a></li>\n    </ol>\n  </li>\n  <li><a href=\"#testing-the-mini-training\" id=\"markdown-toc-testing-the-mini-training\">Testing the mini-training</a></li>\n  <li><a href=\"#training-material-sharing-and-making-re-use-possible\" id=\"markdown-toc-training-material-sharing-and-making-re-use-possible\">Training material: sharing and making re-use possible</a></li>\n  <li><a href=\"#conclusion\" id=\"markdown-toc-conclusion\">Conclusion</a></li>\n</ol>\n\n</blockquote>\n\n<h1 id=\"formal-curriculum-design\">Formal curriculum design</h1>\n\n<h2 id=\"different-types-of-curriculum\">Different types of curriculum</h2>\n\n<p>To set the scene for our considerations of course design, we examine some of the\nfoundations for effective curriculum development, drawing heavily on the\ncurriculum- and course- development guidelines developed by\n<span class=\"citation\"><a href=\"#tractenberg2020guidelines\">Tractenberg <i>et al.</i> 2020</a></span>. Notable here is the fact that different\ntypes of curriculum have been defined: <em>i.e.</em>, <strong>intended</strong>, <strong>implemented</strong>,\n<strong>attained</strong> and <strong>hidden curricula</strong>. Recognising the existence of different\ncurriculum types (or, perhaps, different curricular outcomes) is important\nbecause, while the intended curriculum is the starting point, it may not be the\ncurriculum actually attained: <em>i.e.</em>, what you aimed to teach and what students\nactually learned may not be the same.</p>\n\n<p>To improve outcomes, differences between the intended and attained curricula\nneed to be minimised. The only way to discover the attained curriculum is to\nfind out what learning actually occurred. This requires <strong>actionable</strong>\nevaluation, to assess whether the teaching goals (TGs) and learning outcomes (LOs) were achieved, to identify\nweaknesses in the implementation and to highlight improvements needed to\nremediate them. These considerations are key to developing effective curricula\nand courses.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Definitions of key terms</comment-title>\n\n  <p><strong>Actionable</strong>: supportive of a decision, or the taking of some action by a\nlearner, instructor or institution</p>\n\n  <p><strong>Attained curriculum</strong>: what learners actually acquire &amp; can demonstrate\nhaving followed the implemented curriculum (<span class=\"citation\"><a href=\"#unesco-ibe-glossary\">“<b>UNESCO IBE Glossary of Curriculum-Related Terminology</b>”</a></span>)</p>\n\n  <p><strong>Hidden curriculum</strong>: unintended curricular effects: unofficial norms,\nbehaviours &amp; values that are transferred (not necessarily consciously) by the\nschool culture or ethos; this recognises that schooling happens in broad\nsocial &amp; cultural environments that influence learning (<span class=\"citation\"><a href=\"#glossary-education-reform\">“<b>The glossary of Education Reform</b>”</a></span>)</p>\n\n  <p><strong>Implemented curriculum</strong>: or taught curriculum, how the intended curriculum\nis delivered in practice: <em>i.e.</em>, the teaching &amp; learning activities, &amp; the\ninteractions between learners &amp; teachers, &amp; among learners</p>\n\n  <p><strong>Intended curriculum</strong>: the formal specification of KSAs that students are\nexpected to achieve &amp; be able to demonstrate having followed the implemented\ncurriculum</p>\n\n</blockquote>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Define audience and teaching goal - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 10 min - Silent reflection</hands-on-title>\n\n  <ol>\n    <li>Take the topic you chose before</li>\n    <li>\n      <p>Define teaching objectives</p>\n\n      <p>Describe your goals and intentions as instructor:</p>\n      <ul>\n        <li>stakeholders</li>\n        <li>potential professions</li>\n        <li>desired performance and/or competences of course completers</li>\n        <li>duration</li>\n      </ul>\n    </li>\n  </ol>\n\n</blockquote>\n\n<h2 id=\"structuring-curriculum-design\">Structuring curriculum design</h2>\n\n<p>Curriculum design benefits from being systematic: structured approaches help to\norchestrate and clarify what will be taught, <strong>why it will be taught</strong> and how;\nthey also afford opportunities to evaluate what does and doesn’t work, and hence\nwhat needs to change, ultimately leading to improvements in learning outcomes\n(<span class=\"citation\"><a href=\"#fink2013creating\">Fink 2013</a></span>, <span class=\"citation\"><a href=\"#diamond2008designing\">Diamond 2008</a></span>,\n<span class=\"citation\"><a href=\"#nilson2016teaching\">Nilson 2016</a></span>). Several different frameworks have been devised to\nfacilitate the design process, but each is motivated by the same underlying\nphilosophy: to help formulate programmes that promote <strong>meaningful and enduring\nlearning</strong>. If we’re to understand whether we’ve really achieved this, we must</p>\n\n<ol>\n  <li>determine the purpose of the programme (what needs it addresses, why it’s\nbeing developed, what learners will gain from it, why it’s important),</li>\n  <li>define the intended LOs, and</li>\n  <li>develop <strong>assessment</strong> and evaluation mechanisms that will allow us to\nmeasure whether the programme successfully met its goals.</li>\n</ol>\n\n<blockquote class=\"comment\">\n  <comment-title>Definitions of key terms</comment-title>\n\n  <p><strong>Assessment</strong>: the evaluation or estimation of the nature, quality or ability\nof someone or something</p>\n\n</blockquote>\n\n<p>Not surprisingly, the same principles apply to course design. The process may\nseem daunting, but for the sake of simplicity, we focus here on one model: <em>i.e.</em>,\nthat proposed by <span class=\"citation\"><a href=\"#nicholls2002developing\">Nicholls 2002</a></span>. Before discussing\nthis further, however, it’s helpful to consider another very important tool used\nin teaching and learning – Bloom’s taxonomy (<span class=\"citation\"><a href=\"#bloom1956taxonomy\">Bloom 1956</a></span>).</p>\n\n<h3 id=\"blooms-taxonomy-of-cognitive-complexity\">Bloom’s taxonomy of cognitive complexity</h3>\n\n<p>Learning taxonomies are useful tools that can help both to formulate and clarify\nLOs, and to arrange them on a scale of increasing complexity. Bloom’s taxonomy\n(<span class=\"citation\"><a href=\"#bloom1956taxonomy\">Bloom 1956</a></span>), probably the most easily understood and widely\nused today, features a <strong>six-level hierarchy of cognitive complexity</strong>, ranging\nfrom <strong>Remember</strong> (being able to recall facts and basic concepts) to <strong>Evaluate</strong>\nbeing able to defend opinions or decisions), as illustrated in the following\nfigure:</p>\n\n<figure id=\"figure-1\" style=\"max-width: 90%;\"><img src=\"images/bloom_taxonomy.png\" alt=\"6 levels of Bloom's taxonomy (and their verbs) from bottom (lower-order thinking skills) to top (higher-order 'critical' thinking skills): Remember (recall or reiterate information) with memorize, recognise, identify, describe, reproduce, list, define, label, name, state, outline, order, arrange; Understand (demonstrate understanding of facts) with distinguish, classify, select, review, discuss, indicate, explain, estimate, locate, summarise; Apply (apply knowledge to real situations) with operate, manipulate, experiment, choose, modify, prepare, produce; Analyze (resolve ideas into simple parts, identify patterns) with calculate, examine, model, test, break down, infer, predict, solve; Synthesise (pull ideas into a coherent whole, create new ideas) with combine, formulate, illustrate, imagine, design, invent, compose; Evaluate (make &amp; defend judgements, assess theories &amp; outcomes) with critique, compare ideas, solve, recommend, rate. \" width=\"1090\" height=\"536\" loading=\"lazy\" /><a target=\"_blank\" href=\"images/bloom_taxonomy.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 1</strong>:</span> Bloom’s taxonomy of cognitive complexity, &amp; a sample of associated verbs that can be used to create LOs. The verbs reflect a developmental trajectory, from lower- to higher-order thinking skills; they should be concretely observable &amp; relate to how achievement of target LOs will be assessed. Source: <span class=\"citation\"><a href=\"#via2020course\">Via <i>et al.</i> 2020</a></span></figcaption></figure>\n\n<p>As can be seen from the figure, each Bloom’s level is accompanied by a set of\nactive verbs that express expected, measurable learner behaviours at that level:\n<em>e.g.</em>, achieving the level <strong>Understand</strong> means to be able to classify, select or\nexplain a piece of information: here, <em>classify, select, explain</em> are\nobservable, assessable behaviours that can be readily encapsulated in coherent\nLOs.</p>\n\n<p>Typical illustrations of the taxonomy, like that in the figure, depict\nsuccessive cognitive levels, suggesting that learners must achieve one level\nbefore advancing to the next, implying a <strong>developmental trajectory</strong> from lower-\nto higher-order cognitive skills. However, this structure should not be regarded\nas completely rigid; indeed, <span class=\"citation\"><a href=\"#anderson2001taxonomy\">Anderson <i>et al.</i> 2001</a></span> published a revised\nversion in 2001 in which they placed <strong>Synthesise</strong> (the ability to create new or\noriginal work) at the top of the hierarchy in place of <strong>Evaluate</strong>.\nNotwithstanding the minutiae, it is perhaps more fruitful to regard the taxonomy\nas a continuum or spectrum of cognitive levels, where each merges into the next,\nproviding a structured tool to help express measurable, assessable LOs, in which\nthe cognitive levels are made explicit.</p>\n\n<p>Ultimately, we can use Bloom’s taxonomy to <strong>align instruction with learners’ levels of complexity of thinking</strong> (and experience). In practice, you can use the Bloom’s levels of cognitive complexity (and the <a href=\"https://tips.uark.edu/blooms-taxonomy-verb-chart/\">accompanied actionable verbs in the previous link</a>) to:</p>\n<ul>\n  <li>write Learning Outcomes</li>\n  <li>design instruction and learning experiences i.e. how you are to teach/train, which infrastructure and how to present the materials etc</li>\n  <li>assess learning (taking place during curricula or course and after)</li>\n</ul>\n\n<p>The cognitive aspects embodied in LOs are important. Teaching should promote\nmore complex behaviours than just recall or recognition (unless remembering is\nthe intended LO), and push learners to achieve greater cognitive complexity\n(<span class=\"citation\"><a href=\"#nilson2016teaching\">Nilson 2016</a></span>, <span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span>,\n<span class=\"citation\"><a href=\"#weinstein2018understanding\">Weinstein <i>et al.</i> 2018</a></span>, <span class=\"citation\"><a href=\"#roediger2006power\">Roediger III and Karpicke 2006</a></span>,\n<span class=\"citation\"><a href=\"#jensen2014teaching\">Jensen <i>et al.</i> 2014</a></span>). This can be done by embedding development in\nlearning activities and materials, and ensuring that LOs reflect the lowest to\nthe highest levels of cognitive complexity realistically achievable on\ncompleting those activities or having engaged with those materials (realistic\naims are key, especially for short courses: <em>e.g.</em>, expecting learners with no\nprior subject knowledge to achieve the level <strong>Evaluate</strong>, say in a 1-day course,\nwill guarantee failure and frustration for learners and instructors alike).</p>\n\n<h1 id=\"nicholls-five-phases-of-curriculum-design\">Nicholl’s five phases of curriculum design</h1>\n\n<p>The backdrop for our considerations of course design is Nicholls’ paradigm for\ncurriculum development, illustrated in:</p>\n\n<figure id=\"figure-2\" style=\"max-width: 90%;\"><img src=\"images/nicholl_paradigme.png\" alt=\"(in a clockwise direction) Phase 1: Learning Outcomes (Los) --&gt; Simple, measurable, achievable, realistic, time-bound? --&gt; Phase 2: Learning Experiences (LEs) --&gt; LEs aligned with LOs? --&gt; Phase 3: Content --&gt; Support LEs? Promote LOs? --&gt; Phase 4: Assessment --&gt; Aligned with LEs? Support progress towards LOs? --&gt; Phase 5: Evaluation --&gt; LOs achievable by most learners? Content, LEs &amp; assessments support LOs?\" width=\"1226\" height=\"970\" loading=\"lazy\" /><a target=\"_blank\" href=\"images/nicholl_paradigme.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 2</strong>:</span> Nicholls’ phases of curriculum design &amp; their dependencies. For each phase, key considerations are shown (diamonds). Where these are not satisfied, that or previous phases should be revisited (red arrows), otherwise it is safe to move to the next phase(s) (green arrows). When all considerations are satisfied, the curriculum or course can be characterised, with concrete evidence, as successful (star). By simplified we mean that here you only see the arrows going from one box to the following in line. However, usually we need to revise and go back one or several boxes if we have failed to specify or articulated Learning outcomes from the beginning. This is what we mean by Learning Outcomes drives the whole process. Source: <span class=\"citation\"><a href=\"#via2020course\">Via <i>et al.</i> 2020</a></span></figcaption></figure>\n\n<p>Its five-phase structure has been briefly summarised by\n<span class=\"citation\"><a href=\"#tractenberg2020guidelines\">Tractenberg <i>et al.</i> 2020</a></span>, as follows:</p>\n\n<ol>\n  <li>Select LOs;</li>\n  <li>Select or develop LEs that will help learners achieve the LOs;</li>\n  <li>Select or develop content relevant to LOs;</li>\n  <li>Develop assessments to ensure learners progress toward LOs;</li>\n  <li>Evaluate the effectiveness of LEs for leading learners to LOs.</li>\n</ol>\n\n<p>As can be seen from <a href=\"#figure-2\">Figure 2</a>, the model’s phases are interdependent; all are\nultimately dependent on the first – defining LOs. Moreover, the phases are\niterative: this means that LOs influence later decisions, but later decisions\nmay also reflect backwards, thereby providing opportunities to check for\nalignment of each phase to the target LOs (in other words, to ensure that\nsuccessive phases are mutually consistent with, and supportive of, the LOs).\nThus, the role of LOs is pivotal: they must have specific characteristics to\nfunction, and support each of the other phases as they do.</p>\n\n<p><a href=\"#figure-2\">Figure 2</a> illuminates an important feature of the model: that <strong>LOs are the\nstarting point, and drive all decision-making</strong>. This is just as true for courses\nas it is for programmes (<span class=\"citation\"><a href=\"#diamond2008designing\">Diamond 2008</a></span>). Missing from the model,\nhowever, is the dependence of LOs on a hierarchy of cognitive complexity that\nestablishes a developmental trajectory, like that seen in Bloom’s taxonomy. We\nreflect on this crucial point, and its relevance for course design, in the\ndiscussion of each of the five phases below.</p>\n\n<h2 id=\"define-intended-learning-outcomes-los\">Define intended Learning Outcomes (LOs)</h2>\n\n<p>Just as for curricula, Phase 1 of course design begins with stating the LOs. To\nhelp formulate LOs, it’s important to take a step back and think about what you\naim to achieve (i.e., what are your TGs and the KSAs you intend to be achieved?),\nhow you propose to get there, and how you’ll know you succeeded.\n<span class=\"citation\"><a href=\"#messick1994interplay\">Messick 1994</a></span> encapsulated this process in the form of three\nsuccinct questions:</p>\n\n<ol>\n  <li>What KSAs are the targets of instruction (and assessment)?</li>\n  <li>What learner actions/behaviours will reveal these KSAs?</li>\n  <li>What tasks will elicit these specific actions or behaviours?</li>\n</ol>\n\n<p>These questions were originally posed in 1994 in the context of assessment.\nTheir focus on KSAs – the LOs – thus guides not only the creation of relevant\ntasks (to reveal the target KSAs) but also the rational development of\n<strong>appropriate</strong> assessments: i.e., they provide a framework for, and clarify,\n<strong>what to assess</strong>. The questions can thus support all phases of course\ndevelopment, starting with the selection of intended KSAs stated in a set of\nLOs.</p>\n\n<p>The “Learning outcomes” (LOs) are essentially statements that tell what the learners will be to do at the end of the session. For this reason, every well-designed training should start with LOs.</p>\n\n<p>The first step of good instructional design consists is identifying the set of Knowledge, Skills, Abilities (KSAs) that learners are expected to acquire by the end of instruction.</p>\n\n<h3 id=\"teaching-objectives-and-learning-outcomes\">Teaching objectives and Learning Outcomes</h3>\n\n<p><strong>Objectives</strong> are statements of what you are setting out to teach, although expressed as if the students were going to learn it. Despite Aims are usually intended to be more general and encompassing than Objectives, they are essential the same.</p>\n\n<p><strong>Outcomes</strong> (more accurately “desired outcomes”) are statements of what you might (in principle) assess. You may not end up assessing all of them, but they are statements of what a student will know or be able to do, if she or he has learned everything in the course or session.</p>\n\n<h3 id=\"learning-objectives-and-learning-outcomes\">Learning objectives and learning outcomes</h3>\n\n<blockquote class=\"comment\">\n  <comment-title>Sources</comment-title>\n\n  <p>The following section is adapted from the webpage <a href=\"http://provost.rpi.edu/learning-assessment/learning-outcomes/objectives-vs-outcomes\">http://provost.rpi.edu/learning-assessment/learning-outcomes/objectives-vs-outcomes</a> and the <a href=\"https://irds.stanford.edu/sites/g/files/sbiybj10071/f/clo.pdf\">Operational definitions:</a> document from the <a href=\"http://provost.rpi.edu/institutional-research\">Rensselaer Polytechnic Institute Office of the Provost</a>.</p>\n</blockquote>\n\n<p>The terms Learning Objectives and Learning Outcomes are often used interchangeably by the community. Even worse, they are often abbreviated by the acronym (LO), thus introducing even more ambiguity. In our opinion there is no need. Objectives (aims or goals) and Outcomes (results) may overlap, but are not genuinely the same.</p>\n\n<p>Furthermore, American educational psychologists tend to use “Learning Objectives” to mean “Learning Outcomes” and “Teaching aims, goals or objectives” to mean “Learning Objectives”.</p>\n\n<p>In the attempt of removing ambiguities we will use the term <strong>Teaching Objectives</strong> to mean:</p>\n\n<ul>\n  <li>Objectives describe the goals and intentions of the instructor.</li>\n  <li>Objectives, often termed the input in the course, state the purpose and goals of the course.</li>\n  <li>Objectives focus on content and skills important within the classroom or programme.</li>\n  <li>Objectives may describe what the instructors will do.</li>\n  <li>Objectives can often be numerous, specific, and detailed.</li>\n</ul>\n\n<p>And the term <strong>Learning Outcomes</strong> to mean:</p>\n\n<ul>\n  <li>Student Learning Outcomes catalog the overarching “products” of the course and are the evidence that the goals or objectives were achieved.</li>\n  <li>Learning Outcomes are statements that describe or list measurable and essential mastered content-knowledge—reflecting skills, competencies, and knowledge that students have achieved and can demonstrate upon successfully completing a course.</li>\n  <li>Outcomes express higher-level thinking skills that integrate course content and activities and can be observed as a behavior, skill, or discrete useable knowledge upon completing the\ncourse.</li>\n  <li>Outcomes are exactly what assessments are intended to show – specifically what the student will be able to do upon completing the course.</li>\n  <li>An assessable outcome can be displayed or observed and evaluated against criteria.</li>\n  <li>Outcomes are clear and measurable criteria for guiding the teaching, learning, and assessment process in the course.</li>\n  <li>Statements expressing which KSAs learners will be able to demonstrate upon completion of a learning experience or a sequence of learning experiences</li>\n  <li>What learners will be able to do for the end of instruction and the teacher / instructor can in principle evaluate</li>\n</ul>\n\n<p>Going beyond the definition however, a learning outcome needs to be also practical, i.e. there is a need to assign observable actions in order to let teacher assess them.</p>\n\n<h4 id=\"how-to-write-learning-outcomes-using-observable-verbs\">How to write learning outcomes using OBSERVABLE verbs</h4>\n\n<p>In order to write learning outcomes, you can use the following scheme:</p>\n\n<ol>\n  <li>Think about what learners will be able to do by the end of instruction</li>\n  <li>\n    <p>Use the sentences:</p>\n\n    <p><em>By the end of the lesson (session/course/instruction) the learner will be able to………</em></p>\n\n    <p>OR</p>\n\n    <p><em>The successful learner will be able to……</em></p>\n  </li>\n  <li>Replace dots with a verb that you can assess (name, explain, solve, distinguish, etc.).</li>\n  <li>Avoid verbs that are open to many interpretations: appreciate, have faith in, know, learn, understand, believe</li>\n  <li>Keep in mind that learning outcomes can be as specific as you want. You may even think about a different learning outcome for each task you assign to learners.</li>\n</ol>\n\n<p>Identify observable and non observable actions (verbs)</p>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Identify observable and non observable actions (verbs) - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 3 min</hands-on-title>\n\n  <p>Here is a list of verbs:</p>\n  <ul>\n    <li>Compare</li>\n    <li>Classify</li>\n    <li>Distinguish</li>\n    <li>Explain</li>\n    <li>Believe</li>\n    <li>Give examples of</li>\n    <li>Define</li>\n    <li>Learn</li>\n    <li>Describe</li>\n    <li>List</li>\n    <li>Recognize</li>\n    <li>Know</li>\n    <li>Connect</li>\n    <li>Measure</li>\n    <li>Identify</li>\n    <li>\n      <p>Have faith in</p>\n    </li>\n    <li>Write in the shared notes which ones describe observable actions</li>\n    <li>Write in the shared notes which ones are instead open to multiple interpretation</li>\n  </ul>\n\n</blockquote>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: \"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: </div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<blockquote class=\"tip\">\n  <tip-title>Observable and non observable actions (verbs)</tip-title>\n\n  <p>In classifying verbs, it may help to focus on how you would assess the corresponding action / behaviour.\nExample: “identify”</p>\n  <ul>\n    <li>Q: What would I do to assess whether a learner is able to identify something?</li>\n    <li>A: Ask them to do this challenge.</li>\n  </ul>\n</blockquote>\n\n<!--\n> <comment-title>What are Learning Outcomes (LOs)?</comment-title>\n>\n> - Statements expressing which KSAs learners will be able to demonstrate upon\n>   completion of a learning experience or a sequence of learning experiences\n> - What learners will be able to do for the end of a lesson and the teacher can\n>   in principle evaluate\n>\n{: .comment}\n-->\n\n<blockquote class=\"question\">\n  <question-title>Evaluate LOs</question-title>\n\n  <ol>\n    <li>\n      <p>Select a tutorial or a course</p>\n\n      <p>Several possibilities:</p>\n      <ol>\n        <li>Take a course you currently run, plan to run or have run in the\npast</li>\n        <li>Take your favorite tutorial from the <a href=\"/training-material\">GTN Material</a></li>\n        <li>Take the <a href=\"/training-material/topics/introduction/tutorials/dummy/tutorial.html\">dummy tutorial</a>\nintroducing to data import, that we created for this lesson</li>\n      </ol>\n    </li>\n    <li>Check the content</li>\n    <li>\n      <p>Are its intended LOs stated?</p>\n\n      <blockquote class=\"solution\">\n        <solution-title>for any GTN tutorials, including the dummy one</solution-title>\n\n        <p>LOs are always stated on the top for the tutorial, in the Overview box</p>\n\n      </blockquote>\n    </li>\n  </ol>\n\n</blockquote>\n\n<p>Writing coherent LOs is challenging: they must contain appropriate (Bloom’s)\nverbs (<a href=\"#figure-1\">Figure 1</a>) that express measurable, observable and assessable actions,\naccurately describing what successful learners will be able to do – <strong>and at what\nlevel of cognitive complexity</strong> – after instruction.</p>\n\n<p>Various characteristics of, and principles for articulating, LOs have been\npublished (e.g. <span class=\"citation\"><a href=\"#stanford-institutional-research-decision-support\">“<b>Stanford Institutional Research &amp; Decision Support</b>”</a></span> or\n<span class=\"citation\"><a href=\"#national2016higher\">for Learning Outcomes Assessment 2016</a></span>): some of these are listed briefly in the box\nbelow.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Learning outcomes should</comment-title>\n\n  <ul>\n    <li><strong>be specific &amp; well defined</strong>: LOs should concisely state the specific KSAs\nthat learners should develop as a result of instruction;</li>\n    <li><strong>be realistic</strong>: LOs must be attainable given the context and resources\navailable for instruction, and consistent with learners’ abilities,\ndevelopmental levels, prerequisite KSAs, and the time needed vs. time\navailable to achieve them;</li>\n    <li><strong>rely on active verbs, phrased in the future tense</strong>: LOs should be stated\nin terms of what successful learners will be able to do as a result of\ninstruction;</li>\n    <li><strong>focus on learning products, not the learning process</strong>: LOs should not\nstate what instructors will do during instruction, but what learners will be\nable to do as result of instruction;</li>\n    <li><strong>be simple, not compound</strong>: LOs shouldn’t include compound statements that\njoin two or more KSAs into one statement;</li>\n    <li><strong>be appropriate in number</strong>: LOs should be deliverable and assessable\nwithin the time available for instruction;</li>\n    <li><strong>support assessment that generates actionable evidence</strong>: here, actionable\nmeans supportive of a decision, or taking some action by a learner or\ninstructor.</li>\n  </ul>\n\n</blockquote>\n\n<!-- NILOA five principles for articulating LOs -->\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Learning outcomes - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 2 min - Silent working</hands-on-title>\n\n  <ol>\n    <li>Take the small lesson you selected at the beginning</li>\n    <li>Try to jot a few LOs down</li>\n  </ol>\n\n</blockquote>\n\n<p>Given their detail and complexity, and the importance of aligning the\ninstructional inputs you devise with the outcomes for learners you intend, it\ncan be hard to know where to start. This possibly explains why it may feel\neasier to begin developing a course by selecting its content rather than first\ntrying to understand its impact on student learning. Nevertheless, ensuring that\ntarget LOs meet, or are consistent with, the characteristics outlined in the box\nbelow helps to promote better alignment of instructional inputs and learner\noutcomes.</p>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: Evaluate Learning outcomes\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: Evaluate Learning outcomes</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/design/quiz/evaluate_learning_outcomes.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/design/quiz/evaluate_learning_outcomes.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<blockquote class=\"question\">\n  <question-title>Evaluate LOs</question-title>\n\n  <p>“By the end of the course learners will know the Pythagora’s theorem</p>\n\n  <p>What do you think about this LO?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title>Evaluate Learning outcomes - Solution</solution-title>\n\n    <p>“By the end of the course learners will know the Pythagora’s theorem”</p>\n\n    <p>This LO is not good:</p>\n\n    <ul>\n      <li>How to assess whether learners know the Pythagora’s theorem?</li>\n      <li>What do we mean by “knowing” the Pythagorean theorem?\n        <ul>\n          <li>They are able state it?</li>\n          <li>They are able explain it?</li>\n          <li>They are able apply it?</li>\n          <li>They are able demonstrate it?</li>\n          <li>They are able to use it in solving problem?</li>\n        </ul>\n      </li>\n    </ul>\n\n    <p>It would make more sense to ask: “What will learners be able to do to show they know the Pythagorean theorem?”</p>\n\n  </blockquote>\n</blockquote>\n\n<p>In short, when defining LOs, the key question to ask is, are they SMART?</p>\n\n<ul>\n  <li><strong>S</strong>pecific / <strong>S</strong>imple</li>\n  <li><strong>M</strong>easurable</li>\n  <li><strong>A</strong>chievable / <strong>A</strong>ttainable</li>\n  <li><strong>R</strong>ealistic / <strong>R</strong>elevant</li>\n  <li><strong>T</strong>ime-bound / <strong>T</strong>ransferable</li>\n</ul>\n\n<p>If they do not satisfy this test, they should be revised; only when they meet\nthese criteria is it safe to progress to Phase 2, as shown in <a href=\"#figure-2\">Figure 2</a>.\nSMART LOs will be the roadmap as we plan out instructional strategies, write the\ncontent and <strong>create assessments</strong>.</p>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Create SMART LOs - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 10 min - Silent working</hands-on-title>\n\n  <ol>\n    <li>Take the LOs you created</li>\n    <li>Consider if your LOs are SMART</li>\n    <li>\n      <p>Try to revise any of them that do not meet the SMART criteria as\nfollows:</p>\n\n      <ol>\n        <li>Select an active verb that can (in principle) be observed &amp; assessed</li>\n        <li>\n          <p>Complete the sentence</p>\n\n          <p><em>“At the end of this course, learners will be able to…”</em></p>\n\n          <p>If it helps, review the verbs of the Bloom’s taxonomy listed in <a href=\"#figure-1\">Figure 1</a>.</p>\n\n          <p>It’s important to:</p>\n\n          <ul>\n            <li>Focus here on what learners will be able to do at the end of\ninstruction, <em>e.g.</em> <em>will they be able to…</em>\n              <ul>\n                <li><em>… describe its content?</em>,</li>\n                <li><em>… explain a concept?</em>,</li>\n                <li>*… implement an algorithm?,</li>\n                <li><em>… solve a problem?</em>,</li>\n                <li><em>… evaluate results?</em></li>\n              </ul>\n            </li>\n            <li>Avoid verbs open to multiple interpretation</li>\n            <li>Use a verb that describes an observable action</li>\n          </ul>\n        </li>\n      </ol>\n    </li>\n    <li>\n      <p>Determine how well you have structured your LOs</p>\n\n      <ol>\n        <li>Visit the <a href=\"https://web.cs.manchester.ac.uk/iloadvisor\">Intended Learning Outcome Advisor</a></li>\n        <li>Paste each LOs into the input box</li>\n        <li>Press the <strong>SUBMIT</strong> button</li>\n      </ol>\n\n      <p>How well did you do?</p>\n    </li>\n    <li>Consider revising your LOs if the Advisor identified any issues</li>\n  </ol>\n\n</blockquote>\n\n<!-- ELIXIR TtT\n\n> <hands-on-title>Define audience, goal and outcomes (10 min)</hands-on-title>\n>\n> 5. Identify the learning experiences\n> 6. Start thinking about the content - but don’t spend time in preparing this\n>    yet\n>\n{: .hands_on}\n\n-->\n\n<p>Ultimately, <strong>LOs provide the necessary structure and context for decision-making\nby instructors (and learners), hence their primary role in course design</strong>.</p>\n\n<h2 id=\"select-les-that-will-lead-to-the-los\">Select LEs that will lead to the LOs</h2>\n\n<p>Phase 2 involves identifying the most appropriate LEs to lead learners to the\nintended LOs. It is important to appreciate that different LEs can lead learners\nto demonstrate different Bloom’s-level accomplishments: <em>e.g.</em>,</p>\n<ul>\n  <li>lectures differ from problem-sets – solving problems helps learners to work\nwith, and manipulate, information rather than passively listening to it;</li>\n  <li>similarly, lab exercises differ from writing computer programs – writing\noriginal code affords learners the opportunity to create something new rather\nthan simply following instructions.</li>\n</ul>\n\n<p>Some example LEs are listed in Table 1, together with the Bloom’s level and the\nkinds of TG (Teaching Goals) and LO that each may support.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Learning experience</th>\n      <th>Highest Bloom’s levels supported</th>\n      <th>Example TG(s) <em>“This LE will allow me to…“</em></th>\n      <th>Example LO(s) <em>“Learners will be able to…“</em></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Lecture, webinar</td>\n      <td>Remember, Comprehend</td>\n      <td>Inspire learners, ignite learners’ enthusiasm, clarify/explain a concept, provide an overview, give context, summarise content</td>\n      <td><em>list</em> the key points of the lecture/webinar, <em>summarise</em> take home message(s)</td>\n    </tr>\n    <tr>\n      <td>Exercise, practical</td>\n      <td>Apply, Analyse</td>\n      <td>Help learners digest course materials, solve typical problems, apply knowledge, show how to do things with appropriate guidance, give an idea of how a tool works</td>\n      <td><em>follow</em> a set of instructions or protocol, <em>calculate</em> a set of results or outcomes from a given protocol</td>\n    </tr>\n    <tr>\n      <td>Flipped class</td>\n      <td>Apply, Analyse</td>\n      <td>Teach learners how to formulate questions, help learners to memorise new information &amp; concepts, or analyse &amp; understand course materials</td>\n      <td><em>summarise</em> the content material, *ask* appropriate questions</td>\n    </tr>\n    <tr>\n      <td>Peer instruction</td>\n      <td>Synthesise, Evaluate</td>\n      <td>Prepare learners to defend an argument, give learners opportunities to explain things, thereby helping to develop critical thinking &amp; awareness</td>\n      <td><em>explain</em> how they solved an exercise, <em>evaluate</em> others’ choices/decisions, <em>diagnose</em> errors in the exercise-solving task</td>\n    </tr>\n    <tr>\n      <td>Group discussion</td>\n      <td>Synthesise, Evaluate</td>\n      <td>Give learners opportunities to practice questioning, develop new ideas &amp; critical thinking</td>\n      <td><em>communicate</em> their own ideas, <em>defend</em> their own opinions</td>\n    </tr>\n    <tr>\n      <td>Group work</td>\n      <td>Synthesise, Evaluate</td>\n      <td>Promote collaborative work &amp; peer instruction, provide opportunities for giving/receiving feedback, &amp; digesting course materials</td>\n      <td><em>provide</em> feedback on their peers’ work, <em>share</em> ideas, <em>explain</em> the advantages of team-work</td>\n    </tr>\n    <tr>\n      <td>Problem-solving</td>\n      <td>Synthesise, Evaluate</td>\n      <td>Promote learner abilities to identify &amp; evaluate solutions, develop new ideas, make decisions, evaluate decision effectiveness, troubleshoot</td>\n      <td><em>diagnose</em> faulty reasoning or an underperforming result, <em>correct</em> errors</td>\n    </tr>\n  </tbody>\n</table>\n\n<blockquote class=\"comment\">\n  <comment-title>Definitions of key terms</comment-title>\n\n  <p><strong>Exercise</strong>: an activity designed to help learners to mentally put into\npractice learned skills &amp; knowledge</p>\n\n  <p><strong>Flipped class</strong>: a learner-centred approach in which students are introduced\nto new topics prior to class; class time is then used to explore those topics\nin greater depth via interactive activities</p>\n\n  <p><strong>Group discussion</strong>: an in-class, learner-centred approach in which students\ndiscuss ideas, solve problems &amp;/or answer questions, guided by the instructor</p>\n\n  <p><strong>Group work</strong>: a learner-centred approach in which students are organised\ninto groups (&amp; perhaps assigned specific roles) &amp; are given tasks to perform\ncollaboratively</p>\n\n  <p><strong>Lecture</strong>: a didactic approach in which oral presentation is used to\ndescribe &amp; explain concepts &amp; to impart facts</p>\n\n  <p><strong>Peer-instruction</strong>: an interactive, in-class, learner-centred approach in\nwhich groups of two or more students briefly discuss a question or assignment\ngiven by the instructor</p>\n\n  <p><strong>Practical</strong>: an activity to put into practice learned skills &amp; knowledge,\ngenerally in a lab setting</p>\n\n  <p><strong>Problem-solving</strong>: a learner-centred approach in which students are required\nto systematically investigate a problem by building or determining the best\nstrategy to solve it (using what is known to discover what is not known)</p>\n\n  <p><strong>Webinar</strong>: a lecture delivered online</p>\n\n</blockquote>\n\n<p>Having defined SMART LOs in Phase 1, Phase 2 thus hinges on choosing the most\nappropriate LEs to best lead learners towards them: if LOs include, for example,\nbeing able to write a computer program, then the LEs must allow learners to\napply the knowledge they have acquired and to demonstrate that they’ve written a\npiece of functional code: i.e., LEs and LOs must be aligned (if they are not,\nthis can lead directly to a gap between instructional inputs and intended\noutcomes, which is one reason why course evaluation to detect such misalignments\nis so crucial). If LEs don’t satisfy this criterion, alternative LEs should be\nfound, or the LOs should be revisited and revised before progressing to Phase 3\n(as shown in Figure 2).</p>\n\n<p>Sometimes, it may be necessary to use specific LEs: e.g., if a course is\nlecture-based, it may not be possible to choose alternatives; or a particular\nteaching scenario may not allow for an ideal LE. Even if you’re not in a\nposition to select the most appropriate LEs, the LOs must still be consistent\nwith the given LEs; and if those LEs won’t help learners to achieve the LOs,\nthen the LOs should be revised – i.e., LOs are still the most important feature\nto consider.<strong>The key is to determine exactly what specific LEs can contribute\nto learning or how they will help move learners towards the LOs.</strong></p>\n\n<blockquote class=\"question\">\n  <question-title>Evaluate LEs in GTN tutorials</question-title>\n\n  <ul>\n    <li>\n      <p>Think of the course or tutorial you selected before (<em>e.g.</em>, the\n<a href=\"/training-material/topics/introduction/tutorials/dummy/tutorial.html\">dummy tutorial</a>)</p>\n    </li>\n    <li>\n      <p>Are any of the LEs listed in Table 1 used in the course or tutorial you\nselected?</p>\n\n      <blockquote class=\"solution\">\n        <solution-title>for GTN tutorial, including the dummy one</solution-title>\n\n        <p>Most of the GTN tutorials are using Practical and Exercises as LEs.</p>\n\n      </blockquote>\n    </li>\n    <li>\n      <p>What kinds of achievement or learning are they most likely to promote?\nIs this consistent with the stated LOs?</p>\n\n      <blockquote class=\"solution\">\n        <solution-title>for GTN tutorial, including the dummy one</solution-title>\n\n        <p>They are most likely to show how to do things and give an idea of how a tool\nwork.</p>\n\n      </blockquote>\n    </li>\n    <li>\n      <p>Does the course or tutorial have any LO that can’t be achieved through the\nLEs that the course currently uses?</p>\n\n      <blockquote class=\"solution\">\n        <solution-title>for the dummy tutorial</solution-title>\n\n        <p>“Determine the best strategy to get data into Galaxy” may not be achieved\nwith only practical</p>\n\n      </blockquote>\n    </li>\n  </ul>\n\n  <blockquote class=\"solution\">\n    <solution-title>LEs in GTN tutorials</solution-title>\n\n    <p>Most of the GTN tutorials are using Practical and Exercises as LEs.</p>\n\n    <p>They are most likely to show how to do things and give an idea of how a tool works.</p>\n\n    <p>In the <a href=\"/training-material/topics/introduction/tutorials/dummy/tutorial.html\">dummy tutorial</a>,\nthe LO “Determine the best strategy to get data into Galaxy” may not be achieved\nwith only practical</p>\n\n  </blockquote>\n</blockquote>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: LEs in GTN tutorials\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: LEs in GTN tutorials</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/design/quiz/LEs_GTN_tutorials.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/design/quiz/LEs_GTN_tutorials.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<h2 id=\"select-and-develop-content-relevant-to-the-los\">Select and develop content relevant to the LOs</h2>\n\n<h3 id=\"select-content\">Select content</h3>\n\n<p>With LOs and LEs aligned, Phase 3 involves finding the most appropriate\n<strong>content</strong> to support learners to achieve the intended LOs. Regardless of where\ncontent is drawn from, what matters is how it supports the LOs.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Definitions of key terms</comment-title>\n\n  <p><strong>Content</strong>: a specific subject or topic item (e.g., DNA, RNA, proteins, a\nbiochemical pathway, R programming) that is the target of learning</p>\n\n</blockquote>\n\n<p>To this end, content selection should be judicious: it shouldn’t try to be all-encompassing\n(<span class=\"citation\"><a href=\"#nilson2016teaching\">Nilson 2016</a></span>), but should consider the target Bloom’s levels in\nthe LOs, and the preparation of learners. Once content that’s considered to be\nthe core of a course has been identified, additional <strong>auxiliary</strong> materials can\nalso be selected, and offered, say, as ‘further reading’. Using LOs to drive\ncontent selection in this way thereby both provides focus (avoiding the\ntemptation to squeeze as much as possible into a course to ensure coverage\n(<span class=\"citation\"><a href=\"#mckeachie2013mckeachie\">McKeachie and Svinicki 2013</a></span>, <span class=\"citation\"><a href=\"#lujan2006too\">Lujan and DiCarlo 2006</a></span>)), and increases the\nlikelihood of accomplishing those LOs.</p>\n\n<p>Sometimes, specific content may be deemed essential (<span class=\"citation\"><a href=\"#de2017curriculum\">De Veaux <i>et al.</i> 2017</a></span>).\nNevertheless, this must still support the LEs and promote achievement of the\nLOs; if it doesn’t, then additional content and/or LEs should be considered that\nwill, or the LOs themselves should be revised, to prevent misalignment of\ninstructional inputs and learning outcomes. Overall, the role of <strong>LOs here is to\nhelp focus on relevant content, and avoid material that’s either\nnon-essential/too broad or too narrow</strong>.</p>\n\n<p>If content is, or seems, fixed, it can be difficult to make the shift from\ncontent- to LO-driven decisions. In this case, Messick and Bloom’s can be used to make\nadjustments so that what it means to learn that content or what it looks like to have learned that\ncontent can be made concrete and observable. If such fixed content does not lead to observable\nbehaviors that are, or support the achievement of, LOs, then additional content should be\nconsidered that will; otherwise, it may be necessary to discuss the feasibility of modifying the\ncontent or revising the LOs with those who are able to make changes, to avoid misalignment of\nintended and actual curricula</p>\n\n<!-- >> <question-title>Evaluate content</question-title>\n>\n> - Think of the course or tutorial you selected before (*e.g.*, the\n>   [dummy tutorial](/training-material/topics/introduction/tutorials/dummy/tutorial.html))\n>\n> - Review the LOs and identify which parts of the course content support the\n>   LOs\n>\n>   > <solution-title>for the dummy tutorial</solution-title>\n>   >\n>   >\n>   {: .solution}\n>\n> - Map out the relationships between the LOs, the LEs via which they will be\n>   delivered & those specific items of content (e.g., item A supports LO 1, &\n>   will be delivered using a lecture)\n>\n>   > <solution-title>for the dummy tutorial</solution-title>\n>   >\n>   >\n>   {: .solution}\n>\n> - Is there any piece of content that doesn't support any LO(s)?\n>\n>   > <solution-title>for the dummy tutorial</solution-title>\n>   >\n>   >\n>   {: .solution}\n>\n> - Is there at least one piece of content for each LO?\n>\n>   > <solution-title>for the dummy tutorial</solution-title>\n>   >\n>   >\n>   {: .solution}\n>\n> - Is there at least one LE for each piece of content?\n>\n>   > <solution-title>for the dummy tutorial</solution-title>\n>   >\n>   >\n>   {: .solution}\n>\n{: .question}-->\n\n<p>Defining content can be complicated, specially to identify how it can cover the\ndifferent LOs. Trainers may need to tools to help them defining content,\n<em>e.g.</em> concept maps.</p>\n\n<h3 id=\"concept-maps\">Concept maps</h3>\n\n<p>Concept maps are rough and visual scheme on how the different concepts are linked.\nThey begin with a main idea (or concept) and then branch out to show how\nthat main idea can be broken down into specific topics.</p>\n\n<p>For example, the concepts around the nucleus could be represented using the\nfollowing concept map:</p>\n\n<figure id=\"figure-3\" style=\"max-width: 90%;\"><img src=\"images/nucleus_concept_map.jpg\" alt=\"Example of concept map to explain the nucleus. It start on the top with &quot;Nucleus&quot;, two arrows leave from this. On the left &quot;Nucleus -- has function --&gt;&quot; links to &quot;has function --&gt; performing chemical activities&quot; and &quot;has function --&gt; cellular reproduction&quot;. On the right, &quot;Nucleus -- consist of --&gt; chromosomes&quot;, which splits into: on the left &quot;chromosomes -- has function --&gt; inheritance&quot;; on the right &quot;chromosomes -- composed of --&gt;&quot; with 2 arrows to the left &quot;-- composed of --&gt; DNA&quot; which then split into &quot;DNA -- composed of --&gt; genes&quot; and &quot;DNA --&gt; has function --&gt; carrying of information&quot;, to the right &quot;-- composed of --&gt; proteins&quot;. \" width=\"505\" height=\"538\" loading=\"lazy\" /><a target=\"_blank\" href=\"images/nucleus_concept_map.jpg\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 3</strong>:</span> Example of concept map to explain the nucleus. 9 nodes and 6 edges, so 15 concepts in total</figcaption></figure>\n\n<p><strong><em>Why concept maps?</em></strong> Concept maps are graphical tools for organizing and\nrepresenting knowledge. They include concepts and the relationships between them.</p>\n\n<p><strong><em>How to use concept maps?</em></strong> Concept maps can be used by trainers to help building\ncontent, by breaking training in small pieces (7+/2 concepts) and by helping\ntrainers and helpers to connect things together. A good concept map usually\nstarts with a focused question, a context, and is built with iteration and\nfeedback.</p>\n\n<p>For example, to answer the questions <em>“What are the FAIR principles?”</em></p>\n<ol>\n  <li>we start by listing the keywords that should be discussed: Research data,\nResearch models, Findable, Accessible, Interoperable, Re-usable</li>\n  <li>we link them together in a concept map:</li>\n</ol>\n\n<figure id=\"figure-4\" style=\"max-width: 90%;\"><img src=\"images/fair_concept_map.png\" alt=\"It starts on the top with a box &quot;What are FAIR principles?&quot;. An arrow goes from this box to a box below &quot;Set of guiding principles&quot;. From the 2nd box, an arrow goes down with &quot;to make&quot; written and then splits toward 2 boxes: &quot;Research data&quot; on the left, &quot;Research models&quot; on the right. A line connects these 2 boxes with &quot;and&quot; written on it. An arrow starts from research data and splits into 4 arrows pointing to boxes (from left to right): &quot;Findable&quot;, &quot;Accessible&quot;, &quot;Interoperable&quot;, &quot;Re-usable&quot;. \" width=\"1410\" height=\"910\" loading=\"lazy\" /><a target=\"_blank\" href=\"images/fair_concept_map.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 4</strong>:</span> Example of concept map to explain the FAIR principles</figcaption></figure>\n\n<p>Concept maps try to objective but they depend on their creators. Everyone has\ntheir own concept map, like the way to go from point A to point B from 2 persons\nliving in the same city.</p>\n\n<p>In curriculum/lesson/session planning, concept maps present key concepts in a\nhighly concise manner. They can take into account the existing knowledge of\nlearners and new concepts This helps in the teaching plan to measure how much\ncan be covered, and the hierarchical organization suggests a sequence to cover\nmaterial.</p>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Draw a concept map - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 15 min - Silent working</hands-on-title>\n\n  <ul>\n    <li>Draw a concept map of your topic of interest</li>\n    <li>Start with a question</li>\n    <li>Include 7 (+/- 2) concepts</li>\n    <li>Include relationships and cross-links between these concepts</li>\n    <li>Arrange it in a hierarchical structure with the key concepts on top</li>\n    <li>Count the items (concepts and links)</li>\n  </ul>\n</blockquote>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Give / receive feedback on concept maps - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 10 min - Group of 2 persons</hands-on-title>\n\n  <ul>\n    <li>Pair with someone</li>\n    <li>Check the concept name of your partner</li>\n    <li>Write to your partner\n      <ul>\n        <li>One thing you are confuse/not sure about the map</li>\n        <li>One thing you like/it is clear about the map</li>\n      </ul>\n    </li>\n  </ul>\n\n</blockquote>\n\n<blockquote class=\"tip\">\n  <tip-title>Further reading</tip-title>\n\n  <p>For more details about concept maps, we recommend you <span class=\"citation\"><a href=\"#novak2008theory\">Novak and Cañas 2008</a></span>\n(<a href=\"http://cmap.ihmc.us/publications/researchpapers/TheoryUnderlyingConceptMaps.pdf\">PDF</a>)</p>\n\n</blockquote>\n\n<h3 id=\"content\">Content</h3>\n\n<ul>\n  <li><strong>Content collection</strong>: collecting appropriate content to the needs and\ncapabilities of your target audience</li>\n  <li><strong>Content reduction</strong>: one of the biggest challenges in designing training\ncourses is the reduction of content to the training format. key points!</li>\n</ul>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Producing the content and the training material - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 15 min</hands-on-title>\n\n  <ul>\n    <li>\n      <p>Prepare the content for your 3 min training</p>\n\n      <p>The structure should be something like:</p>\n\n      <ul>\n        <li>0:20 sec - Introduction</li>\n        <li>2:20 sec - Topic</li>\n        <li>0:20 sec - Conclusion</li>\n      </ul>\n    </li>\n    <li>\n      <p>Use your concept map and adapt as needed</p>\n    </li>\n  </ul>\n</blockquote>\n\n<blockquote class=\"details\">\n  <details-title>From a 2-min presentation to a lesson/session: a plan</details-title>\n\n  <p>Template to help developing plan:</p>\n\n  <blockquote class=\"matrix\">\n    <table>\n      <thead>\n        <tr>\n          <th>Time</th>\n          <th>Activity</th>\n          <th>Description</th>\n          <th>Goal</th>\n        </tr>\n      </thead>\n      <tbody>\n        <tr>\n          <td> </td>\n          <td> </td>\n          <td> </td>\n          <td> </td>\n        </tr>\n        <tr>\n          <td> </td>\n          <td> </td>\n          <td> </td>\n          <td> </td>\n        </tr>\n        <tr>\n          <td> </td>\n          <td> </td>\n          <td> </td>\n          <td> </td>\n        </tr>\n      </tbody>\n    </table>\n  </blockquote>\n\n  <p>For example: for a 1h15 session</p>\n\n  <blockquote class=\"matrix\">\n    <table>\n      <thead>\n        <tr>\n          <th>Time</th>\n          <th>Activity</th>\n          <th>Description</th>\n          <th>Goal</th>\n        </tr>\n      </thead>\n      <tbody>\n        <tr>\n          <td>9:00 - 9:15</td>\n          <td>Warm-up</td>\n          <td>Learners summaries the key points of each session from the previous day and answer questions from the audience. The instructor describes the plan of the day in detail</td>\n          <td>Retrieval from memory, repetition, get prepared for new topics, expose learners</td>\n        </tr>\n        <tr>\n          <td>9:15 - 9:25</td>\n          <td>Lecture</td>\n          <td>Python functions</td>\n          <td>Learning to write a function, about function input and output, and how to call a the function</td>\n        </tr>\n        <tr>\n          <td>9:20 - 10:00</td>\n          <td>Practical activity</td>\n          <td>Two exercises to be solved in pairs on a single computer. After solving the 1st exercise, the “driver” andr”navigator” will swap. 2 learners (1 / exercise) will display their solutions to the audience. Questions and discussion</td>\n          <td>Learners will be able to write and call a function calculating the distance between 2 points in the 3D  space and a function taking the base and height of a triangle as input and returning its area</td>\n        </tr>\n        <tr>\n          <td>10:00 - 10:15</td>\n          <td>Wrap-up</td>\n          <td>Group test on functions (match input and output with specific functions: fill gaps in pieces of code). Game: repetition using ball throwing</td>\n          <td>Assess learning. Do we need to work more on functions? Repeat meaning and usage of all Python objects introduced so far</td>\n        </tr>\n      </tbody>\n    </table>\n  </blockquote>\n</blockquote>\n\n<h2 id=\"develop-assessments-to-ensure-progression\">Develop assessments to ensure progression</h2>\n\n<p>In any course, learners benefit from having opportunities to show that they’re\nprogressing. Generally, this is done using various types of assessment,\nincluding tests, feedback surveys, and so on. Nicholls’ model includes two\ndifferent types of assessment, to evaluate:</p>\n\n<ol>\n  <li><strong>learning</strong>, to detect changes in learner performance during instruction, to\nidentify their strengths, and diagnose their weaknesses – i.e., <strong>formative\nassessment</strong> (or feedback). This can inform decisions about how to modify\ninstruction to better promote learning; it can also inform learners about\nchanges they may need to make to improve their learning;</li>\n  <li><strong>instructional outcomes</strong>, to verify whether learners achieved the stated LOs\nafter instruction – i.e., <strong>summative assessment</strong>. This can help to inform\ndecisions both about learners (e.g., ranking their performances) and about\nthe course (<em>i.e.</em>, whether any of its LOs, LEs, etc. need to be redesigned).</li>\n</ol>\n\n<blockquote class=\"comment\">\n  <comment-title>Definitions of key terms</comment-title>\n\n  <p><strong>Formative assessment</strong>: formal or informal assessments (or feedback) made\nduring learning so that instruction or practice can be better targeted for\nlearners to be able to fully achieve target LOs</p>\n\n  <p><strong>Summative assessment</strong>: assessments made after a period of instruction in\norder to monitor whether LOs have been achieved</p>\n\n</blockquote>\n\n<p>Formative and summative assessments (<span class=\"citation\"><a href=\"#walvoord2010assessment\">Walvoord 2010</a></span>) are\nimportant for determining whether and what learning has occurred. Summative\nassessment doesn’t generally yield information about learners’ progress: it sums\nup what learning has been achieved after instruction relative to the intended\noutcomes (via written tests, practical tasks, or other measurable activities),\nand gives valuable data about learning attainment at the level of individuals\nand entire learner cohorts. This can be tricky for short courses, but may be\nnecessary for those that give credits or offer certificates of completion.</p>\n\n<p>Formative assessments are applied throughout a course; planned thoughtfully,\nthey can improve the performance of learners and instructors. Ideally, they\nshould be used often (say, every 15-20 minutes), thereby also yielding\nopportunities to change pace and refocus learners’ attention. It may be hard to\nconceive how to integrate such assessments into a course, but they need not be\ncomplex or time-consuming (just informative about learning at a given point).</p>\n\n<blockquote class=\"details\">\n  <details-title>Simple formative assessment strategies</details-title>\n\n  <p>The most effective way to test student understanding is to do so in class:\nit’s important to seize the moment, and deal with potential misunderstandings\nas soon as they arise. These in-class tips may be helpful:</p>\n\n  <ul>\n    <li><strong>reflection</strong>: towards the end of a training session, ask learners to reflect\non, and write down, a list of new concepts and skills they’ve learned. Ask\nthem to consider how they’d apply these concepts or skills in a practical\nsetting;</li>\n    <li><strong>agreed signals</strong>: gauge learners’ satisfaction with a training session by\nasking them to use agreed signals (<em>e.g.</em>, raising coloured post-it notes to\nindicate that the pace is too fast/ slow, etc.). This engages all learners,\nand allows you to check their confi- dence with the content and its\ndelivery, even in large groups;</li>\n    <li><strong>3-2-1</strong>: at the end of a training session, ask learners to note 3 things\nthey learned, 2 things they want to know more about, and 1 question they\nhave. This stimulates reflection on the session, and helps to process their\nlearning;</li>\n    <li><strong>misconception check</strong>: present some common or predictable misconceptions\nabout a concept you’ve covered. Ask learners whether they agree or disagree,\nand to explain why;</li>\n    <li><strong>diagnostic questions/questionnaires (which may be anonymous)</strong>: ask learners\nto note one thing they didn’t understand or that they missed, and one thing\nthat was very clear to them, or make them complete a multiple choice quiz,\nthen display and discuss the answers with them.</li>\n  </ul>\n\n  <p>These, and many other simple assessments, may be found in\n<a href=\"http://www.opencolleges.edu.au/informed/features/21-ways-to-check-for-student-understanding/\">Briggs’ online list of 21 ways to check for student understanding</a>.</p>\n\n</blockquote>\n\n<p>If formative assessments are used frequently, and lead to specific decisions by\nlearners and instructors, then instruction (or learner preparation) can be\nmodified to better develop the target LOs (<span class=\"citation\"><a href=\"#dylan2008integrating\">Dylan and Thompson 2008</a></span>,\n<span class=\"citation\"><a href=\"#trumbull2013understanding\">Trumbull and Lash 2013</a></span>). Such assessments can be designed to\nanticipate, and identify which learners are experiencing, common\nmisunderstandings, and gauge their readiness to move ahead; they can also help\nlearners to identify their own strengths and weaknesses by encouraging\nreflection on what they do/don’t know or are/aren’t confident about, honing\ntheir abilities to self-assess (<span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span>). Furthermore,\nideas for how to address any issues they’ve found, or for further learning, can\nbe built in (e.g., <em>“if you chose option C, you might want to re-read the\nhandout”</em>); formative assessments can therefore also support self-instruction.</p>\n\n<p>Using actionable formative and summative assessment can help to ensure that LOs,\nand progress towards them, are explicitly supported. <strong>LOs clarify what\nspecifically needs to be assessed and why.</strong></p>\n\n<blockquote class=\"question\">\n  <question-title>Evaluate assessment</question-title>\n\n  <ul>\n    <li>\n      <p>Think of the course or tutorial you selected before (<em>e.g.</em>, the\n<a href=\"/training-material/topics/introduction/tutorials/dummy/tutorial.html\">dummy tutorial</a>)</p>\n    </li>\n    <li>How much formative assessment have been used?</li>\n    <li>Does it paint a consistent picture of learning levels for the course?</li>\n    <li>To what extent are the tests aligned with the KSAs &amp; Bloom’s levels\nexpressed in the LOs?</li>\n  </ul>\n\n</blockquote>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: Evaluate assessment in GTN tutorials\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: Evaluate assessment in GTN tutorials</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/design/quiz/assessments_GTN_tutorials.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/design/quiz/assessments_GTN_tutorials.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Assessment in mini-training - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 5 min</hands-on-title>\n\n  <ul>\n    <li>Take the content of your 3 min training</li>\n    <li>Analyse the flow of the lesson, identify points where you could introduce\nformative-feedback sessions</li>\n    <li>For each portion of the lesson between two sets of feedback, imagine (&amp;\nwrite down) a quick activity – an exercise, a question, a reflection – that\nlearners could carry out that would help you understand whether they’re\nfollowing the lesson &amp; that learning is occurring, or whether they’re\nlagging behind or are lost.</li>\n  </ul>\n\n</blockquote>\n\n<h2 id=\"evaluate-course-effectiveness\">Evaluate course effectiveness</h2>\n\n<p>The final step is to perform an actionable evaluation by collecting qualitative\nand quantitative course data to assess its effectiveness in leading learners to\nthe stated LOs. Summative assessments can be useful here: <em>e.g.</em>, if they reveal\nuniformly low levels of achievement, it may indicate that future revisions are\nneeded to ensure that LEs, assessments and LOs are aligned; it could also flag\nproblems with the assessment – it’s vital to understand whether performance\nreflects student learning levels or issues with the assessment itself (poorly\nworded test questions, ambiguous response options, etc.), and, if not, to take\nsteps to ensure that it does.</p>\n\n<p>Even if a full quantitative course evaluation isn’t possible, it may still be\npossible to solicit actionable evidence of its impact via short- or long-term\nfeedback surveys. It’s tempting to use completion rates or learner satisfaction\nas proxies for success; however, although simple to collate, these outcomes\naren’t informative about learners’ growth or course effectiveness. Satisfaction\nsurveys often use pre- and post-course questionnaires\n(<span class=\"citation\"><a href=\"#jordan_kari_2018_1325464\">Jordan <i>et al.</i> 2018</a></span>, <span class=\"citation\"><a href=\"#gurwitz2020framework\">Gurwitz <i>et al.</i> 2020</a></span>) to collect\ndemographic details, and solicit learners’ self-evaluations and reactions to a\ncourse. Reviewing learners’ perceptions can help to identify whether the\nconditions for learning were present, but alone will not shed light on whether\nthe intended LOs were achieved: learner perceptions may be affected by factors\nunrelated to course effectiveness, and their self-assessments may be biased\n(e.g., less-skilled learners notoriously overestimate their abilities – the\nDunning-Kruger effect (<span class=\"citation\"><a href=\"#kruger1999unskilled\">Kruger and Dunning 1999</a></span>)).</p>\n\n<p>There are many evaluation methods, each with advantages and disadvantages; all\nconcur that multiple features need to be considered. One framework collates\nlearner reactions, their actual learning, changes in their behaviour, and the\nimpact of the course on their organisation.</p>\n\n<blockquote class=\"details\">\n  <details-title>Methods to evaluate training effectiveness</details-title>\n\n  <p>Evaluation methods provide systematic frameworks for analysing the\neffectiveness of training courses. The first approach was introduced by\nRaymond Katzell in 1956 and later popularised by Kirkpatrick\n(<span class=\"citation\"><a href=\"#kirkpatrick1979techniques\">Kirkpatrick 1979</a></span>, <span class=\"citation\"><a href=\"#kirkpatrick2006evaluating\">Kirkpatrick and Kirkpatrick 2006</a></span>).\nThe Kirkpatrick-Katzell method proposes a four-level strategy:</p>\n\n  <ol>\n    <li><strong>Reaction</strong> – what do learners feel about the training?</li>\n    <li><strong>Learning</strong> – what did learners retain from the training?</li>\n    <li><strong>Behaviour</strong> – did learners put their learning into practice\n  on-the-job (did their working behaviour change)?</li>\n    <li><strong>Results</strong> – did their behavioural changes have an overall impact on\n  their organisation (e.g., greater productivity)?</li>\n  </ol>\n\n  <p>Surveying each level helps collect qualitative and quantitative data to\nevaluate training effectiveness. Note: this isn’t a real taxonomy, as there’s\nno evidence that outcomes at successive levels are linked (<em>e.g.</em>, no\ncorrelation has been found between the reaction and learning stages\n<span class=\"citation\"><a href=\"#gessler2009correlation\">Gessler 2009</a></span>). However, if level 2 results indicate that\nlearning didn’t occur, those from level 1 may identify aspects of a course\nthat disappointed learners and help understand what should be improved. Many\nother approaches to training evaluation have been developed,\n<a href=\"https://kodosurvey.com/blog/training-evaluations-models-complete-guide\">each focusing on slightly different levels or stages</a>.</p>\n\n</blockquote>\n\n<p>Such features can be explicitly targeted in short- or long-term surveys: <em>e.g.</em>,\nend-of-course, summative quizzes can be used to test achievement of intended\nLOs; longer-term questions (say, 6-12 months after a course) can focus on the\nextent to which learners have put their acquired KSAs into working practice; and\nso on. Overall, it’s important to choose an appropriate evaluation method for your\ncircumstances, and, alongside learner reactions to the course, for your\nevaluation to consider what results you expected to achieve, whether the LOs\nwere achieved, and whether learners’ on-the-job practices changed.</p>\n\n<p>Actionable evaluation is essential for identifying aspects of a course that may\nbenefit from intervention, leading to concrete decisions about what needs to be\nremediated and why (<span class=\"citation\"><a href=\"#worthen1997program\">Worthen <i>et al.</i> 1997</a></span>). Designing meaningful\nevaluations requires thought; in some cases, it may help to appoint independent\nevaluators or advisory boards, as external reviewers can give objective\nappraisals, and may also help to frame the course against national/international\nstandards. <strong>Ultimately, the evaluation should identify what works in a course,\nand what needs remediation, to better support the achievement of the intended\nLOs</strong>.</p>\n\n<blockquote class=\"question\">\n  <question-title>Evaluate effectiveness</question-title>\n\n  <ul>\n    <li>\n      <p>Think of the course or tutorial you selected before (<em>e.g.</em>, the <a href=\"/training-material/topics/introduction/tutorials/dummy/tutorial.html\">dummy tutorial</a>)</p>\n    </li>\n    <li>\n      <p>Do you evaluate its effectiveness?</p>\n\n      <blockquote class=\"solution\">\n        <solution-title>for the dummy tutorial</solution-title>\n\n        <ul>\n          <li>Embeded feedback form</li>\n          <li>Collecting feedback at the end of courses</li>\n        </ul>\n\n      </blockquote>\n\n      <p>If so, how do you do this? How do you determine its effectiveness in leading learners to your intended LOs?</p>\n    </li>\n    <li>\n      <p>Consider the Kirkpatrick-Katzell framework. What level(s) does your evaluation incorporate?</p>\n    </li>\n    <li>\n      <p>What adjustments would you need to make, if any, in order to align your evaluation with the Kirkpatrick-Katzell strategy?</p>\n    </li>\n  </ul>\n\n</blockquote>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: Evaluate effectiveness in GTN tutorials\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: Evaluate effectiveness in GTN tutorials</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/design/quiz/effectiveness_GTN_tutorials.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/design/quiz/effectiveness_GTN_tutorials.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<blockquote class=\"solution\">\n  <solution-title>Evaluate effectiveness in GTN tutorials</solution-title>\n\n  <p>Tutorials are evaluated using</p>\n  <ul>\n    <li>Embeded feedback forms at the</li>\n    <li>Collecting feedback at the end of courses</li>\n  </ul>\n\n</blockquote>\n\n<!-- Challenges and options in implementing Nicholl's curriculum-development model-->\n\n<!-- ELIXIR TtT -->\n<h1 id=\"testing-the-mini-training\">Testing the mini-training</h1>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Delivery planning - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 10 min - Silent working</hands-on-title>\n\n  <ul>\n    <li>Think if you want to make your training interactive</li>\n    <li>Think whether you need or want to use a visual support (images)</li>\n    <li>Think whether you need to distribute material in advance to the audience</li>\n    <li>Prepare for your choices</li>\n    <li>Be creative!</li>\n  </ul>\n\n</blockquote>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Deliver mini-training and Give / receive feedback on its delivery - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 15 min - Groups of 2 persons</hands-on-title>\n\n  <ul>\n    <li>\n      <p>Deliver each one your 3 minute session to others with 1 person noting down feedback in real-time</p>\n\n      <blockquote class=\"details\">\n        <details-title>How to give feedback on training</details-title>\n\n        <ul>\n          <li>Listen actively and attentively</li>\n          <li>Ask for clarification if you are confused</li>\n          <li>Do not interrupt one another</li>\n          <li>\n            <p>Collect constructive feedback on content and presentation: positive and\n negative feedback using the following matrix as template:</p>\n\n            <blockquote class=\"matrix\">\n              <table>\n                <tbody>\n                  <tr>\n                    <td>Content</td>\n                    <td> </td>\n                    <td> </td>\n                    <td> </td>\n                  </tr>\n                  <tr>\n                    <td>Presentation</td>\n                    <td> </td>\n                    <td> </td>\n                    <td> </td>\n                  </tr>\n                </tbody>\n              </table>\n            </blockquote>\n          </li>\n          <li>Challenge one another, but do so respectfully</li>\n          <li>Critique ideas, not people</li>\n          <li>Do not offer opinions without supporting evidence</li>\n          <li>Take responsibility for the quality of the discussion</li>\n          <li>Build on one another’s comments; work toward shared understanding.</li>\n          <li>Do not monopolise discussion.</li>\n          <li>Speak from your own experience, without generalizing.</li>\n          <li>If you are offended by anything said during discussion, acknowledge it\nimmediately.</li>\n        </ul>\n      </blockquote>\n    </li>\n    <li>Describe your own feedback on your delivery</li>\n    <li>Provide feedback to the presenter</li>\n    <li>Share with the group any insights/thoughts/comments to share from your breakout room</li>\n  </ul>\n\n</blockquote>\n\n<!--\n## Logistics that will help or hinder learning\n\nReproducibility of compute environments\n\n- Identical installation setup on every computer and sufficient hardware (power\n  and memory) to run the tools\n- Different courses, different compute requirements: Unix, R, Python,\n  metagenomics, long read sequencing\n- Installation process time-consuming and technically challenging\n- Virtual machines, cloud computing, containers, software images\n  - Allocate time (pre-sessions) to make sure installations are up and running\n\nTraining rooms for bioinformatics\n\nPhysical environment\n\n- Room geometry: seats’ quality, the lighting, the room temperature control, the\n  stability of power and network connections\n- Functionality : video, audio, drawing surfaces (whiteboard, flipchart paper),\n  a corkboard to pin materials\n- Hardware needs: power suppliers, network connections with a good quality wifi\n  access\n -->\n\n<h1 id=\"training-material-sharing-and-making-re-use-possible\">Training material: sharing and making re-use possible</h1>\n\n<p>When developing a course, it’s helpful to document the design process, including\ndetails of how it was conceptualised, the assumptions and decisions made along\nthe way, the assessment criteria, etc., and to share that documentation with\ninstructors and learners (this can be done via community mailing lists, through\nblog posts, collaborative repositories, social channels, using GitHub, Slack,\netc.). By way of example, <a href=\"https://carpentries.org/\">The Carpentries</a> provide\n<a href=\"https://swcarpentry.github.io/shell-novice/guide/\">instructor note</a> for most of\ntheir courses. These are collectively-written documents that reflect on the\nstrengths and weaknesses of the course design (and its materials), what\ndid/didn’t work, suggested improvements, tips for teaching, challenges\nencountered, learner feedback, and indications of where alignment of\nLOs/LEs/content/assessments failed, and why.</p>\n\n<blockquote class=\"question\">\n  <question-title>Resources in the Galaxy Training Network</question-title>\n\n  <p>What are the provided resources by the Galaxy Training Network to document\ntraining resources?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <ul>\n      <li>Gitter / Matrix channel</li>\n      <li>GitHub Pull Request</li>\n      <li>Details box in tutorials</li>\n      <li><a href=\"/training-material/feedback.html\">Feedback page</a></li>\n      <li><a href=\"https://github.com/galaxyproject/training-material/discussions/1452\">Workshop Instructor Feedback</a></li>\n    </ul>\n  </blockquote>\n\n</blockquote>\n\n<p>Best practices like this help course designers and communities of trainers to\nunderstand what was intended, what was done, and why those might be different,\nif they are. This is particularly valuable for courses whose materials are not\ndeveloped by its instructors. Such documentation can thus facilitate reflection\nand promote good practice, and can help new instructors prepare to deliver the\ncourse. If made available to learners, it can help them to understand what they\ncan expect from a course, and make informed decisions about whether it will help\nthem to achieve their learning goals; it may also help them to better gauge their\nperformance, and to identify what will help them perform better – it may therefore\nalso improve learning outcomes.</p>\n\n<p>As data and models should be FAIR (Findable, Accessible, Interoperable &amp; Re-usable),\ntraining materials (slides, exercises, datasets, etc) should also be FAIR</p>\n\n<ul>\n  <li><strong>Findable</strong> - can be searched and found by the trainers community</li>\n  <li><strong>Accessible</strong> - can be read/downloaded by other trainers</li>\n  <li><strong>Interoperable</strong> - can be understood clearly in the context of the original\ncourse</li>\n  <li><strong>Re-usable</strong> - can be used by other trainers</li>\n</ul>\n\n<p><strong><em>How to make training material FAIR?</em></strong> You can follow the recommendations from\n<span class=\"citation\"><a href=\"#garcia2020ten\">Garcia <i>et al.</i> 2020</a></span>:</p>\n\n<figure id=\"figure-5\" style=\"max-width: 90%;\"><img src=\"images/fair_training_material.png\" alt=\"It is like a circle with in the middle &quot;1 - Share&quot; then turning clock wise from left middle: &quot;2 - Describe properly&quot;, &quot;3 - Give unique identity&quot;, &quot;4 - Register online&quot;, &quot;5 - Define access rules&quot;, &quot;6 - Use interoperable format&quot;, &quot;7 - Make (re)usable for trainers&quot;, &quot;8 - Make usable for trainees&quot;, &quot;9 - Welcome contributions&quot;, &quot;10 - Keep material up-to-date&quot;. On the top of rules, &quot;Findable&quot; for 2, 3, 4, &quot;Accessible&quot; for 3, 4, 5, &quot;Interroperable&quot; for 6, &quot;Reusable&quot; for 7, 8, 9, 10. \" width=\"2186\" height=\"1157\" loading=\"lazy\" /><a target=\"_blank\" href=\"images/fair_training_material.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 5</strong>:</span> Ten simple rules for making training materials FAIR. The first rule—to share—is the central starting point; the Findability rules include description, identity, and registration; the latter two, together with access rules, correspond to Accessibility; Interoperability stands on its own, with one rule about formats; the remaining four rules cover different aspects of Reusability. Illustration from Luc Wiegers and Celia van Gelder (<span class=\"citation\"><a href=\"#garcia2020ten\">Garcia <i>et al.</i> 2020</a></span>, <span class=\"citation\"><a href=\"#wiegers2019\">Wiegers and van Gelder 2019</a></span>)</figcaption></figure>\n\n<blockquote class=\"question\">\n  <question-title>Is GTN material FAIR?</question-title>\n\n  <ul>\n    <li>\n      <p>Look at the any GTN tutorial (<em>e.g.</em>, the\n<a href=\"/training-material/topics/introduction/tutorials/dummy/tutorial.html\">dummy tutorial</a>)</p>\n    </li>\n    <li>\n      <p>Is this training material FAIR ? If so, how?</p>\n    </li>\n  </ul>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <!--SNIPPET-->\n    <blockquote class=\"tip\">   <div class=\"box-title tip-title\" id=\"tip-how-does-the-gtn-ensure-our-training-materials-are-fair\"><button class=\"gtn-boxify-button tip\" type=\"button\" aria-controls=\"tip-how-does-the-gtn-ensure-our-training-materials-are-fair\" aria-expanded=\"true\"><i class=\"far fa-lightbulb\" aria-hidden=\"true\"></i> <span>Tip: How does the GTN ensure our training materials are FAIR?</span><span class=\"fold-unfold fa fa-minus-square\"></span></button></div>   <p>This infrastructure has been developed in accordance with the FAIR (Findable, Accessible, Interoperable, Reusable) principles for training materials <span class=\"citation\"><a href=\"#Garcia2020\">Garcia <i>et al.</i> 2020</a></span>. Following these principles enables trainers and trainees to find, reuse, adapt, and improve the available tutorials.</p>   <p>The GTN receives a 100% score on the <a href=\"https://fair-checker.france-bioinformatique.fr/check\">FAIR Checker</a>, as noted in our recent <a href=\"/training-material/news/2024/05/13/fair.html\">news post</a></p>   <table>   <thead>     <tr>       <th>10 Simple Rules</th>       <th>Implementation in GTN framework</th>     </tr>   </thead>   <tbody>     <tr>       <td>Plan to share your training materials online</td>       <td>Online <a href=\"https://training.galaxyproject.org/\">training material portfolio</a>, managed via <a href=\"https://github.com/galaxyproject/training-material\">a public GitHub repository</a></td>     </tr>     <tr>       <td>Improve findability of your training materials by properly describing them</td>       <td>Rich metadata associated with each tutorial that are visible and accessible via schema.org on each tutorial webpage.</td>     </tr>     <tr>       <td>Give your training materials a unique identity</td>       <td>URL persistency with redirection in case of renaming of tutorials. Data used for tutorials stored on Zenodo and associated with a Digital Object Identifiers (DOI)</td>     </tr>     <tr>       <td>Register your training materials online</td>       <td>Tutorials automatically registered on TeSS, the <a href=\"https://tess.elixir-europe.org/\">ELIXIR’s Training e-Support System</a></td>     </tr>     <tr>       <td>If appropriate, define access rules for your training materials</td>       <td>Online and free to use without registration</td>     </tr>     <tr>       <td>Use an interoperable format for your training materials</td>       <td>Content of the tutorials and slides written in Markdown. Metadata associated with tutorials stored in YAML, and workflows in JSON. All of this metadata is available <a href=\"/training-material/api/index.html\">from the GTN’s API</a></td>     </tr>     <tr>       <td>Make your training materials (re-)usable for trainers</td>       <td>Online. Rich metadata associated with each tutorial: title, contributor details, license, description, learning outcomes, audience, requirements, tags/keywords, duration, date of last revision. Strong technical support for each tutorial: workflow, data on Zenodo and also available as data libraries on UseGalaxy.*, tools installable via the Galaxy Tool Shed, list of possible Galaxy instances with the needed tools.</td>     </tr>     <tr>       <td>Make your training materials (re-)usable for trainees</td>       <td>Online and easy to follow hands-on tutorials. Rich metadata with “Specific, Measurable, Attainable, Realistic and Time bound” (SMART) learning outcomes following Bloom’s taxonomy. Requirements and follow-up tutorials to build learning path. List of Galaxy instances offering needed tools, data on Zenodo and also available as data libraries on UseGalaxy.*. Support chat embedded in tutorial pages.</td>     </tr>     <tr>       <td>Make your training materials contribution friendly and citable</td>       <td>Open and collaborative infrastructure with contribution guidelines, a CONTRIBUTING file and a chat. Details to cite tutorials and give credit to contributors available at the end of each tutorial.</td>     </tr>     <tr>       <td>Keep your training materials up-to-date</td>       <td>Open, collaborative and transparent peer-review and curation process. Short time between updates.</td>     </tr>   </tbody> </table> </blockquote>\n    <p><!--END_SNIPPET--></p>\n\n  </blockquote>\n\n</blockquote>\n\n<p><strong>Creating and sharing documentation with instructors and learners fosters the\ndevelopment of communities of best practice, and can support both learning and\nthe success of a course.</strong></p>\n\n<!--\n> <hands-on-title>Apply - _⏰ 5 min_</hands-on-title>\n>\n> - Articulate a goal of good teaching practice that you are ready to apply for\n>   your next training\n> - Share in the shared notes\n{: .hands_on}\n-->\n\n<h1 id=\"conclusion\">Conclusion</h1>\n\n<p>Course design is prefaced by determining the purpose of the programme, analysing\nthe context in which the course will be delivered and who will benefit.\nFundamental to this process is to identify the needs the course will address,\nits target audience, and the prerequisite KSAs that learners must have in order\nto profit most from the course. Identifying the target audience and learner\nprerequisites helps to define criteria for selecting participants, should a\nlimit be needed to maximise course effectiveness.</p>\n\n<p>Once such ‘situational analysis’ has been completed, the starting point, and\npivotal reference for all subsequent stages of the course-design process, is to\narticulate SMART LOs. As part of this process, Bloom’s taxonomy is useful for\ndefining LOs that are measurable, and whose cognitive complexity increases along\na developmental trajectory; and Messick’s questions help both to select KSAs and\nLOs, and to ensure alignment of instruction and assessment. Crucially, informed\nchoices need to be made about the LEs (and the content they use) that best align\nwith the goal of achieving specific LOs <strong>in the time available</strong>. General topic\nareas (life sciences, computer science, data science, etc.) may provide the\noverarching framework, but your goals for learners should drive how content is\nselected, taught and assessed. In terms of assessment approaches, formative\nassessment is generally more relevant for short courses, but summative\nassessment may be necessary for accredited courses. Ultimately, it’s important\nto understand what each type of assessment contributes to the course-design\nprocess and to build your practice to maximise the effectiveness of each.</p>\n\n<p>Evaluating course effectiveness should be the final stage of a robust design\nprocess, and the first step towards course re-design and improvement, should the\ncourse be delivered regularly. To do this rigorously, it’s helpful to employ a\nmulti-level evaluation strategy, in which learner satisfaction is just one\nstrand (used alone, learner satisfaction is not a reliable metric of success).</p>\n\n<p>Course design requires thought and time. Successful courses support learners as\nthey develop from entry-level performance to the minimum performance level for\nachieving the target LOs. If designed specifically to support learners and LOs,\nand evaluated against that objective, the instruction that’s delivered and\nlearning that’s intended are more likely to match. This can’t guarantee success\nfor all learners, but does create the optimal circumstances for success.</p>\n\n<p>Structured approaches benefit course design by leveraging what’s already known\nabout learning, and providing a framework for decision-making. The process can\nbe challenging, but investing in it is likely to pay dividends. Ultimately,\neverything in the design should lead to, and support development of, the LOs\nthat learners should possess, and be able to demonstrate, on completion of a\ncourse. For ease of reference, the approach outlined here can be distilled into\nthe simple set of recommendations summarised:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>N</th>\n      <th>Recommendation</th>\n      <th>Benefits</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><strong>1</strong></td>\n      <td>Follow a structured paradigm for course design.</td>\n      <td>Leverages what’s known about education &amp; learning; provides a framework for decision-making.</td>\n    </tr>\n    <tr>\n      <td><strong>2</strong></td>\n      <td>Focus on LOs first, to inform all other course-design decisions</td>\n      <td>LOs provide context for decision-making by instructors &amp; learners.</td>\n    </tr>\n    <tr>\n      <td>2.1</td>\n      <td>Leverage LOs to determine appropriate LEs</td>\n      <td>LOs help to choose LEs that support learners to achieve the LOs.</td>\n    </tr>\n    <tr>\n      <td>2.2</td>\n      <td>Leverage LOs to select content that promotes achievement of the LOs.</td>\n      <td>LOs help to focus on relevant content, &amp; to avoid material that is non-essential &amp;/or too narrow</td>\n    </tr>\n    <tr>\n      <td>2.3</td>\n      <td>Assess learners’ progress towards LOs &amp; the achievement of LOs using formative &amp; summative assessment, respectively</td>\n      <td>LOs clarify what specifically needs to be assessed &amp; why.</td>\n    </tr>\n    <tr>\n      <td><strong>3</strong></td>\n      <td>Plan &amp; execute an actionable course evaluation.</td>\n      <td>Helps identify what works &amp; what to remedy in the course to better support achievement of LOs.</td>\n    </tr>\n    <tr>\n      <td><strong>4</strong></td>\n      <td>Document &amp; share the course features with learners.</td>\n      <td>Helps to support learning &amp; promotes success of the course.</td>\n    </tr>\n  </tbody>\n</table>\n\n<!--\nConsiderations for training and self-directed learning\nDesigning instruction is challenging, requiring thought, attention and time; this is just as true for\nshort-form and self-instruction as it is for curricula and programs of study (Diamond, 2008). Self-\ndirected learners need to make informed decisions about which training sessions will be most likely\nto help them achieve their own learning goals; they therefore need to develop a sense of whether\n  14\nparticular learning opportunities or LEs can actually support the stated LOs (e.g., in order to be\nable to choose between several different offerings of a ‘data science’ course that appear\nsuperficially similar). Similarly, trainers need to focus on, and make informed choices about, the\nLEs that best align with the objective of achieving specific LOs in the time available.\nAssessment presents greater challenges for training and self-directed learning. Trainers can use\nshort- and longer-term evaluations to determine, say, interest in, or consistency in implementing,\nthe training material; but formative assessment is generally the most relevant assessment tool for\nthis context. Self-directed learners may be unlikely to create formative assessments, but they may\nformulate LOs for themselves and then try to determine whether they have met them, or whether\nthey need to augment their learning with supplemental reading or exercises/activities. Job\ndescriptions and published descriptors (the European Qualifications Framework (European\nCommunities, 2008), etc.) can be leveraged by self-directed learners and trainers; these concretely\ndescribe specific KSAs that can be used as targets, against which to compare the LOs or LEs they\nare considering.\n\n\n-->\n"],"ref_slides":[],"hands_on":true,"slides":false,"mod_date":"2023-11-03 14:30:27 +0000","pub_date":"2022-09-23 10:02:09 +0000","version":30,"quiz":[{"id":"LEs_GTN_tutorials.yaml","path":"topics/contributing/tutorials/design/quiz/LEs_GTN_tutorials.yaml","title":"LEs in GTN tutorials","contributors":["bebatut"]},{"id":"assessments_GTN_tutorials.yaml","path":"topics/contributing/tutorials/design/quiz/assessments_GTN_tutorials.yaml","title":"Evaluate assessment in GTN tutorials","contributors":["bebatut"]},{"id":"effectiveness_GTN_tutorials.yaml","path":"topics/contributing/tutorials/design/quiz/effectiveness_GTN_tutorials.yaml","title":"Evaluate effectiveness in GTN tutorials","contributors":["bebatut"]},{"id":"evaluate_learning_outcomes.yaml","path":"topics/contributing/tutorials/design/quiz/evaluate_learning_outcomes.yaml","title":"Evaluate Learning outcomes","contributors":["bebatut"]}],"api":"https://training.galaxyproject.org/training-material/api/topics/contributing/tutorials/design/tutorial.json","tools":[],"supported_servers":[],"topic_name_human":"Contributing to the Galaxy Training Material","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial","contributors":[{"name":"Bérénice Batut","email":"berenice.batut@gmail.com","twitter":"bebatut","linkedin":"berenicebatut","matrix":"bebatut:matrix.org","orcid":"0000-0001-9852-1987","joined":"2017-09","elixir_node":"fr","contact_for_training":true,"location":{"country":"FR","lat":45.77,"lon":3.08},"fediverse":"https://piaille.fr/@bebatut","fediverse_flavor":"mastodon","affiliations":["gallantries","ifb","elixir-europe"],"id":"bebatut","url":"https://training.galaxyproject.org/training-material/api/contributors/bebatut.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/bebatut/"},{"name":"Fotis E. Psomopoulos","email":"fpsom@certh.gr","twitter":"fopsom","matrix":"fpsom:matrix.org","orcid":"0000-0002-0222-4273","linkedin":"fpsom","joined":"2019-03","elixir_node":"gr","affiliations":["gallantries","elixir-europe"],"id":"fpsom","url":"https://training.galaxyproject.org/training-material/api/contributors/fpsom.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/fpsom/"},{"name":"Allegra Via","joined":"2022-09","id":"allegravia","url":"https://training.galaxyproject.org/training-material/api/contributors/allegravia.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/allegravia/"},{"name":"Patricia Palagi","joined":"2022-09","id":"ppalagi","url":"https://training.galaxyproject.org/training-material/api/contributors/ppalagi.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/ppalagi/"},{"name":"ELIXIR Goblet Train the Trainers","joined":"2022-09","github":false,"avatar":"/training-material/shared/images/elixir.png","id":"elixir-goblet-ttt","url":"https://training.galaxyproject.org/training-material/api/organisations/elixir-goblet-ttt.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/elixir-goblet-ttt/"},{"name":"Gallantries: Bridging Training Communities in Life Science, Environment and Health","short_name":"Gallantries","start_date":"2020-09-01","end_date":"2023-09-30","joined":"2020-09","avatar":"https://gallantries.github.io/assets/images/gallantries-logo.png","github":false,"funder":true,"url":"https://training.galaxyproject.org/training-material/api/funders/gallantries.json","funder_name":"Erasmus+ Programme","funding_id":"2020-1-NL01-KA203-064717","funding_system":"erasmusplus","funding_statement":"This project (<a href=\"https://erasmus-plus.ec.europa.eu/projects/search/details/2020-1-NL01-KA203-064717\"><code class=\"language-plaintext highlighter-rouge\">2020-1-NL01-KA203-064717</code></a>) is funded with the support of the Erasmus+ programme of the European Union. Their funding has supported a large number of tutorials within the GTN across a wide array of topics.\n<img src=\"https://gallantries.github.io/assets/images/logosbeneficaireserasmusright_en.jpg\" alt=\"eu flag with the text: with the support of the erasmus programme of the european union\" />\n<img src=\"https://www.erasmusplus.nl/assets/images/logo.png\" alt=\"erasmus plus logo\" />","members":["abretaud","bebatut","colineroyaux","fpsom","hexylena","shiltemann","yvanlebras"],"id":"gallantries","page":"https://training.galaxyproject.org/training-material/hall-of-fame/gallantries/"}]}