{
  "layout": "tutorial_hands_on",
  "title": "Mass spectrometry: LC-MS data processing",
  "zenodo_link": "https://zenodo.org/record/5179809",
  "level": "Introductory",
  "questions": [
    "Why should one consider performing data processing steps when dealing with Metabolomics data?",
    "How to conduct LCMS-based untargeted metabolomic data processing using Galaxy?"
  ],
  "objectives": [
    "To comprehend the key role of data processing.",
    "To comprehend the diversity of steps necessary to perform untargeted LC-MS metabolomic data processing.",
    "To be familiar with the \"identify then perform\" approach necessary to deploy relevant data processing strategies."
  ],
  "time_estimation": "2H",
  "key_points": [
    "Data processing is a key step in untargeted Metabolomics analyses. The question of data filtering and correction must be addressed in all projects, even thought in some cases it may lead to the decision of no action on data. In particular, blank filtering, pool variation study and signal drift correction are common aspects to consider when dealing with LC-MS.",
    "Although some main steps are standard, various ways to combine tools exist. Remember that depending on your context (type of samples, protocol specificities...) specific filters/normalisations may be needed, independently of standards ones.",
    "A variety of tools is available in Galaxy, but do not forget that you need appropriate knowledge to decide what to use depending on your data."
  ],
  "contributors": [
    {
      "name": "Mélanie Petera",
      "joined": "2019-06",
      "id": "melpetera",
      "url": "https://training.galaxyproject.org/training-material/api/contributors/melpetera.json"
    },
    {
      "name": "Workflow4Metabolomics core team",
      "joined": "2019-06",
      "id": "workflow4metabolomics",
      "url": "https://training.galaxyproject.org/training-material/api/contributors/workflow4metabolomics.json"
    }
  ],
  "url": "/topics/metabolomics/tutorials/lcms-dataprocessing/tutorial.html",
  "topic_name": "metabolomics",
  "tutorial_name": "lcms-dataprocessing"
}