{"layout":"tutorial_hands_on","title":"FAIR and its Origins","abbreviations":{"FAIR":"Findable, Accessible, Interoperable, Reusable"},"zenodo_link":"","questions":["What is FAIR and the FAIR Guiding Principles?","Where does FAIR come from?"],"objectives":["Identify the FAIR principles and their origin.","Explain the difference between FAIR and open data.","Contextualise the main principles of FAIR around the common characteristics of identifiers, access, metadata and registration."],"time_estimation":"40M","key_points":["FAIR stands for Findable, Accessible, Interoperable and Reusable.","Metadata, Identifiers, Registration and Access are 4 key components in the process of FAIRification.","FAIR data is as open as possible, and as closed as necessary."],"tags":["fair","dmp","data stewardship"],"priority":1,"contributions":{"authorship":["robertmand","nsjuty","smza","nsoranzo","saramorsy","kellsnow","khens","proccaserra","lcooper","sitjart","asmasonomics","bfranicevic","saskia-lawson-tovey","kkamieniecka","khaled196","poterlowicz-lab"],"funding":["elixir-uk-dash"]},"subtopic":"pointers","follow_up_training":[{"type":"internal","topic_name":"fair","tutorials":["fair-metadata"]}],"requirements":[{"type":"internal","topic_name":"fair","tutorials":["fair-intro"]}],"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"T00433","url":"/topics/fair/tutorials/fair-origin/tutorial.html","topic_name":"fair","tutorial_name":"fair-origin","dir":"topics/fair/tutorials/fair-origin","symlink":null,"id":"fair/fair-origin","ref_tutorials":["<p>FAIR as an acronym, its origins and its guiding principles are introduced.  Learners will be able to explain the difference between FAIR and open data and contextualise the main principles of FAIR around the common characteristics of identifiers, access, metadata and registration.</p>\n\n<blockquote class=\"agenda\">\n  <agenda-title></agenda-title>\n\n  <p>In this tutorial, we will cover:</p>\n\n<ol id=\"markdown-toc\">\n  <li><a href=\"#fair\" id=\"markdown-toc-fair\">FAIR</a></li>\n  <li><a href=\"#open-data-and-fair\" id=\"markdown-toc-open-data-and-fair\">Open data and FAIR</a></li>\n  <li><a href=\"#what-is-meant-by-fairification-and-fairness-of-data\" id=\"markdown-toc-what-is-meant-by-fairification-and-fairness-of-data\">What is meant by FAIRification and FAIRness of data?</a></li>\n  <li><a href=\"#fairs-origins\" id=\"markdown-toc-fairs-origins\">FAIR’s origins</a></li>\n  <li><a href=\"#course-structure\" id=\"markdown-toc-course-structure\">Course structure</a></li>\n  <li><a href=\"#glossary-of-fair-terms\" id=\"markdown-toc-glossary-of-fair-terms\">Glossary of FAIR terms</a></li>\n  <li><a href=\"#useful-resources\" id=\"markdown-toc-useful-resources\">Useful Resources</a></li>\n</ol>\n\n</blockquote>\n\n<h1 id=\"fair\">FAIR</h1>\n\n<p>The concepts underlying the FAIR principles are intuitively grounded in good scientific practice, though formalising them as easily measurable is not straightforward.  Being completely ‘FAIR’ is somewhat of an ideal, where it is often more pragmatic to be ’FAIR enough’ for a particular purpose or use case.</p>\n\n<p>FAIR’s primary goal is to maximise data reuse by researchers.  The FAIR principles enable reuse by helping researchers share and manage their data, though FAIR is not limited to data alone and can be applied to services, software, training and workflows.  The word FAIR is an acronym, derived from its major components: ‘F’indable, ‘A’ccessible, ‘I’nteroperable, and ‘R’eusable which form the foundation of the FAIR Guiding Principles.</p>\n\n<p><strong>Findable</strong> means that data and its metadata can be found/discovered by humans and computers.  Part of this is making rich metadata and keywords available to search engines and data repositories, so that companion data can be discovered.</p>\n\n<p><strong>Accessible</strong> means that once discovered, data and metadata can be accessed/downloaded by humans and computers.  Typically this means the commitment of the resource to its long term hosting and availability, with a suitable licence, and in appropriate format.</p>\n\n<p><strong>Interoperable</strong> means that data and metadata are supplied in formats that can be easily used and interpreted by humans and computers. The file formats and terms (vocabularies) used can be integrated easily with other datasets and software.</p>\n\n<p><strong>Reusable</strong> means that metadata is rich, enabling appropriate reuse.  Commonly FAIR will encourage the use of community standards for data curation.</p>\n\n<p>These 4 major components form headings for the 15 FAIR Guiding Principles shown in <strong>Table 1.1</strong></p>\n\n<table>\n  <thead>\n    <tr>\n      <th>The FAIR Guiding Principles</th>\n      <th> </th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>To be Findable:</td>\n      <td>F1. (meta)data are assigned a globally unique and persistent identifier<br />F2. data are described with rich metadata (defined by R1 below)<br />F3. metadata clearly and explicitly include the identifier of the data it describes <br />F4. (meta)data are registered or indexed in a searchable resource</td>\n    </tr>\n    <tr>\n      <td>To be Accessible:</td>\n      <td>A1. (meta)data are retrievable by their identifier using a standardized communications protocol <br />A1.1 the protocol is open, free, and universally implementable<br />A1.2 the protocol allows for an authentication and authorization procedure, where necessary <br />A2. metadata are accessible, even when the data are no longer available</td>\n    </tr>\n    <tr>\n      <td>To be Interoperable:</td>\n      <td>I1. (meta)data use a formal, accessible, shared, and broadly applicable language for knowledge representation. <br />I2. (meta)data use vocabularies that follow FAIR principles<br />I3. (meta)data include qualified references to other (meta)data</td>\n    </tr>\n    <tr>\n      <td>To be Reusable:</td>\n      <td>R1. meta(data) are richly described with a plurality of accurate and relevant attributes <br />R1.1. (meta)data are released with a clear and accessible data usage license<br />R1.2. (meta)data are associated with detailed provenance<br />R1.3. (meta)data meet domain-relevant community standards</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Table 1.1: The FAIR guiding principles as described in Wilkinson, M., Dumontier, M., Aalbersberg, I. et al. The FAIR Guiding Principles for scientific data management and stewardship. Sci Data 3, 160018 (2016) <span class=\"citation\"><a href=\"#Wilkinson2016\">Wilkinson <i>et al.</i> 2016</a></span>.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>Look at the wording of the FAIR principles in <strong>Table 1.1</strong>. Which terms are used more than once?  Which terms are you seeing for the first time?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>Shared terms are: <strong>data</strong> (F1, F2, F4, A1, A2, I1, I2, I3, R1, R1.1, R1.2, R1,3), <strong>metadata</strong> (F1, F2, F3, F4, A1, A2, I1, I2, I3,  R1, R1.1, R1.2, R1,3), <strong>identifier</strong> (F1, F3, A1), <strong>protocol</strong> (A1, A1.1, A1.2). <br /> Not so obviously shared terms are: <strong>vocabularies</strong> (I1, I2), <strong>access</strong> (A1, A1.1, A1.2, R1.1) <br /> Terms which you may be seeing for the first time are: metadata, persistent identifier, searchable resource, standardised communications protocol, authentication and authorisation procedure, knowledge representation, vocabularies, qualified references, data usage license, provenance, domain-relevant community standards.</p>\n\n  </blockquote>\n</blockquote>\n\n<p>The aim of this course is to put these principles into context and familiarise learners with  terms used commonly around FAIR.  A glossary of terms appears at the bottom of this episode as a point of reference.</p>\n\n<h1 id=\"open-data-and-fair\">Open data and FAIR</h1>\n\n<figure id=\"figure-1\" style=\"max-width: 90%;\"><img src=\"../../images/figure1-2_fair-vs-open.png\" alt=\"FAIR_is_not_the_same_as_Open_data. \" width=\"850\" height=\"150\" loading=\"lazy\" /><a target=\"_blank\" href=\"../../images/figure1-2_fair-vs-open.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 1</strong>:</span> FAIR is not the same as Open data</figcaption></figure>\n\n<p>Since FAIR promotes data sharing, it is often misunderstood as Open data.</p>\n\n<p>The <a href=\"https://opendatahandbook.org/\">Open Data handbook</a> defines Open data as <strong>“data that can be freely used, reused and redistributed by anyone.”</strong>  Commonly, FAIR data is open however FAIR compliance does not mandate access without restriction. Instead, for instances where FAIR data is subject to restricted access, the conditions of access need to be stated to be compliant with FAIR, for example access around sensitive data.  Often in FAIR data, people adhere to the philosophy of <strong>“as open as possible, and as closed as necessary”</strong> thereby maximising opportunities to reuse data.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>Under which circumstances would restricted or closed  access to FAIR data be advisable?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>Where data is sensitive or subject to intellectual property.  Protecting sensitive data overrules mandating research data should be open access. <br /> Note though that in most cases, people following FAIR principles will be looking to share their data openly. Also note that sensitive data can be released through anonymisation and in many cases subject to controlled access by the authority of the principal investigator or data access committee.</p>\n\n  </blockquote>\n</blockquote>\n\n<h1 id=\"what-is-meant-by-fairification-and-fairness-of-data\">What is meant by FAIRification and FAIRness of data?</h1>\n\n<p><strong>FAIRification</strong> is the process of making your data FAIR compliant by applying the 15 Guiding Principles shown in <strong>Table 1.1</strong>.  The extent to which you apply these principles defines the <strong>FAIRness</strong> of your data.  In other words, FAIRness refers to the extent by which your data is FAIR and implies some implicit means of measuring its compliance.</p>\n\n<h1 id=\"fairs-origins\">FAIR’s origins</h1>\n\n<p>A <a href=\"https://zenodo.org/record/1285272#.ZD_9KhXMIqt\">report from the European Commission Expert Group on FAIR data</a> describes the origins of FAIR and its development in 2014-2015 by a FORCE11 Working Group.  The following exercise dips into this report and asks you to investigate some of FAIR’s history and foundation.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>Read page 11 of <a href=\"https://zenodo.org/record/1285272#.ZD_9QxXMIqu\">the European Commission report</a>, under the heading “Origins and definitions of FAIR”. What benefit did the FORCE11 Working Group see to coining the word FAIR?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>The report states: “a FORCE11 Working Group coined the FAIR data definition, latching onto an arresting and rhetorically useful acronym. The wordplay with fairness, in the sense of equity and justice, has also been eloquent in communicating the idea that FAIR data serves the best interests of the research community, and the advancement of science as a public enterprise that benefits society.”</p>\n\n  </blockquote>\n</blockquote>\n\n<h1 id=\"course-structure\">Course structure</h1>\n\n<p>During the remainder of this course we will put the FAIR Guiding Principles into context using the 4 FAIR characteristics of <strong>metadata</strong>, <strong>data registration</strong>, <strong>access</strong> and <strong>identifiers</strong>, and devote an episode to each of these.  Whilst we teach, we will map content to the appropriate FAIR principle and define all relevant terms identified.</p>\n\n<h1 id=\"glossary-of-fair-terms\">Glossary of FAIR terms</h1>\n\n<p>All terms in this glossary are mentioned in the FAIR Guiding Principles (Table 1.2) and referenced in the following episodes of this course.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>The FAIR Guiding Principles</th>\n      <th> </th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>To be Findable:</td>\n      <td>F1. (meta)data are assigned a <strong>globally unique and persistent identifier</strong><br />F2. data are described with rich metadata (defined by R1 below)<br />F3. metadata clearly and explicitly include the <strong>identifier</strong> of the data it describes <br />F4. (meta)data are registered or <strong>indexed in a searchable resource</strong></td>\n    </tr>\n    <tr>\n      <td>To be Accessible:</td>\n      <td>A1. (meta)data are retrievable by their <strong>identifier</strong> using a <strong>standardized communications protocol</strong> <br />A1.1 the protocol is open, free, and <strong>universally implementable</strong><br />A1.2 the protocol allows for an <strong>authentication and authorization procedure</strong>, where necessary <br />A2. metadata are accessible, even when the data are no longer available</td>\n    </tr>\n    <tr>\n      <td>To be Interoperable:</td>\n      <td>I1. (meta)data use a formal, accessible, shared, and broadly applicable <strong>language for knowledge representation</strong>. <br />I2. (meta)data use <strong>vocabularies</strong> that follow FAIR principles<br />I3. (meta)data include <strong>qualified references</strong> to other (meta)data</td>\n    </tr>\n    <tr>\n      <td>To be Reusable:</td>\n      <td>R1. meta(data) are richly described with a plurality of accurate and relevant attributes <br /> R1.1. (meta)data are released with a clear and accessible <strong>data usage license</strong><br />R1.2. (meta)data are associated with detailed <strong>provenance</strong><br />R1.3. (meta)data meet domain-relevant <strong>community standards</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Table 1.2: Terms used by the FAIR Principles that appear in this glossary are highlighted in <strong>black</strong>.</p>\n\n<p><strong>Globally unique and persistent identifier</strong>: a reference to a digital resource such as a dataset, a document, a database, etc, usually given as a URL, that takes the user to that resource.  The persistent identifier (PID) is unique, globally, in the sense that it is not used to identify any other digital resource.  The PID is persistent, in that it enables a resource to be located long term, preferably permanently.  For more see: <a href=\"https://howtofair.dk/how-to-fair/persistent-identifiers/\">How to FAIR</a> and <a href=\"https://faircookbook.elixir-europe.org/content/recipes/findability/identifiers.html\">FAIR Cookbook</a>, episode 5 (identifiers).</p>\n\n<p><strong>Indexed in a searchable resource</strong>: repositories and catalogues that can be queried (search box) are examples of searchable resources.  Indexing refers to processes within the architecture of the data repository where (meta)data are organised so that they can be queried based on defined fields.  Indexing by an internet search engine (for example, Google) is another example of an indexed and searchable resource.  For more see: <a href=\"https://www.go-fair.org/fair-principles/f4-metadata-registered-indexed-searchable-resource/\">GO FAIR</a>.</p>\n\n<p><strong>Standardised communications protocol</strong>: a method that connects two computers and ensures secure data transfer. Examples of this include the hypertext transfer protocol (<a href=\"https://en.wikipedia.org/wiki/HTTP\">http</a>(s)) and the file transfer protocol (<a href=\"https://en.wikipedia.org/wiki/File_Transfer_Protocol\">ftp</a>) that permit data to be requested and downloaded by selecting a link on a webpage, or launched from within a script, for example using an (application programming interface) API. For more see the <a href=\"https://ardc.edu.au/resource/standardised-communications-protocols/\">Australian Research Data Commons</a>.</p>\n\n<p><strong>Universally implementable</strong>: in the context of a standardised communications protocol such as http(s), universally implementable means it can be used by a number of resources and software, for example Firefox, Chrome and Unix commands such as wget.  For more see the <a href=\"https://ardc.edu.au/resource/standardised-communications-protocols/\">Australian Research Data Commons</a>.</p>\n\n<p><strong>Authentication and authorisation procedure</strong>: data repositories with authentication and authorisation procedures generally require a login (and password) to access (meta)data.  For more see the <a href=\"https://ardc.edu.au/resource/standardised-communications-protocols/\">Australian Research Data Commons</a>.</p>\n\n<p><strong>Language for knowledge representation</strong>: in the context of (meta)data exchange between computers, (meta)data should be in formats that are universally recognised (interoperable standards).  For more see <a href=\"https://www.go-fair.org/fair-principles/i1-metadata-use-formal-accessible-shared-broadly-applicable-language-knowledge-representation/\">GO FAIR</a> and <a href=\"https://faircookbook.elixir-europe.org/content/recipes/introduction/FAIR-and-knowledge-graphs.html\">FAIR Cookbook</a>.</p>\n\n<p><strong>Vocabularies</strong>: (or <strong>controlled vocabulary</strong>) is a dictionary of terms you can use when producing (meta)data.  Controlled vocabularies are often shared between databases and communities so by using them you can allow data from different sources to be merged (interoperable), based on a shared understanding of the concepts.   Ontologies are related to vocabularies, where terms in the vocabulary are organised by relations between them.  A commonly used ontology is the <a href=\"https://www.ncbi.nlm.nih.gov/taxonomy\">NCBI taxonomy</a> where the term ‘Homo sapiens’ belongs to a hierarchy of parent terms such as ‘Primates’ and ‘Mammalia’.   The ontology defines the vocabularies and the parent/child relationships.   For more see Ten simple rules for making a vocabulary FAIR <span class=\"citation\"><a href=\"#Cox2021\">Cox <i>et al.</i> 2021</a></span>.</p>\n\n<p><strong>Qualified references</strong>: are terms used to describe relationships to pieces of (meta)data.  For more see <a href=\"https://www.go-fair.org/fair-principles/i3-metadata-include-qualified-references-metadata/\">GO FAIR</a>.</p>\n\n<p><strong>Data usage license</strong>: describes the legal rights on how others use your data.  For more details on considerations in selecting a licence, or to find out more about types of licence that are available, see <a href=\"https://rdmkit.elixir-europe.org/licensing\">RDMkit</a>.</p>\n\n<p><strong>Data provenance</strong>: refers to metadata describing the origin of a piece of data, including information such as version, original location of the data, and usually an audit trail up to the current version.  For more see <a href=\"https://rdmkit.elixir-europe.org/data_provenance#how-to-document-and-track-your-data-provenance\">RDMkit</a>.</p>\n\n<p><strong>Community standards</strong>: are standard guidelines used to structure and exchange data, usually supported by community-developed resources and/or software.  In the context of (meta)data, community standards relate often to the standardised ontologies used by a domain of research, and minimum information guidelines allowing data to be interoperable.  For more see <a href=\"https://fair-dom.org/community_standards\">FAIRDOM</a>.</p>\n\n<p><strong>Machine-readable</strong>: though this term is not referenced in the FAIR principles, it is often discussed within the FAIR context. Machine-readable (meta)data is supplied in a structured format that can be read by a computer.  For more see <a href=\"https://opendatahandbook.org/glossary/en/terms/machine-readable/\">Open Data Handbook</a> and <a href=\"https://rdmkit.elixir-europe.org/machine_actionability\">RDMkit</a>.</p>\n\n<p><strong>(Meta)data</strong>: is shorthand for ‘metadata and data’.</p>\n\n<h1 id=\"useful-resources\">Useful Resources</h1>\n<ul>\n  <li>The published FAIR Guiding Principles: Wilkinson, M., Dumontier, M., Aalbersberg, I. et al. The FAIR Guiding Principles for scientific data management and stewardship. Sci Data 3, 160018 (2016) <span class=\"citation\"><a href=\"#Wilkinson2016\">Wilkinson <i>et al.</i> 2016</a></span>.</li>\n  <li>Recipes for data FAIRification, written by domain experts giving real-world examples: <a href=\"https://faircookbook.elixir-europe.org/content/home.html\">FAIR Cookbook</a></li>\n  <li>Documentation and frameworks for data FAIRification.  Each of the 15 FAIR principles is put into context with real data examples: <a href=\"https://www.go-fair.org/fair-principles/\">GO FAIR</a></li>\n  <li>FAIR walkthrough using examples from across all academic disciplines: <a href=\"https://howtofair.dk/\">How to FAIR</a></li>\n</ul>\n"],"ref_slides":[],"video_library":{"tutorial":null,"slides":null,"demo":null,"both":null,"session":null},"hands_on":true,"slides":false,"mod_date":"2024-03-26 14:35:58 +0000","pub_date":"2024-03-26 08:27:31 +0000","version":15,"api":"https://training.galaxyproject.org/training-material/api/topics/fair/tutorials/fair-origin/tutorial.json","tools":[],"supported_servers":{"exact":[],"inexact":[{"name":"UseGalaxy.eu","url":"https://usegalaxy.eu","id":"eu","human":"Galaxy Europe","usegalaxy":true},{"name":"UseGalaxy.org","url":"https://usegalaxy.org","id":"us","human":"Galaxy Main","usegalaxy":true},{"name":"UseGalaxy.org.au","url":"https://usegalaxy.org.au","id":"au","human":"Galaxy Australia","usegalaxy":true},{"name":"UseGalaxy.fr","url":"https://usegalaxy.fr","id":"fr","human":"Galaxy France","usegalaxy":true}]},"topic_name_human":"FAIR Data, Workflows, and Research","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial","contributors":[{"name":"Robert Andrews","email":"andrewsr9@cardiff.ac.uk","orcid":"0000-0002-3491-2361","joined":"2021-10","elixir_node":"uk","affiliations":["elixir-europe"],"id":"robertmand","url":"https://training.galaxyproject.org/training-material/api/contributors/robertmand.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/robertmand/"},{"name":"Nick Juty","orcid":"0000-0002-2036-8350","joined":"2024-04","id":"nsjuty","url":"https://training.galaxyproject.org/training-material/api/contributors/nsjuty.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/nsjuty/"},{"name":"Munazah Andrabi","joined":"2023-09","orcid":"0000-0002-7718-5109","id":"smza","url":"https://training.galaxyproject.org/training-material/api/contributors/smza.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/smza/"},{"name":"Nicola Soranzo","matrix":"nsoranzo:matrix.org","orcid":"0000-0003-3627-5340","twitter":"NicolaSoranzo","joined":"2017-09","elixir_node":"uk","fediverse":"https://mstdn.science/@nsoranzo","fediverse_flavor":"mastodon","linkedin":"nicola-soranzo-7884125","affiliations":["earlham","elixir-europe"],"id":"nsoranzo","url":"https://training.galaxyproject.org/training-material/api/contributors/nsoranzo.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/nsoranzo/"},{"name":"Sara Morsy","joined":"2021-10","orcid":"0000-0002-2477-1139","elixir_node":"uk","id":"saramorsy","url":"https://training.galaxyproject.org/training-material/api/contributors/saramorsy.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/saramorsy/"},{"name":"Kellie Snow","joined":"2024-03","id":"kellsnow","url":"https://training.galaxyproject.org/training-material/api/contributors/kellsnow.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/kellsnow/"},{"github":false,"name":"Korneel Hens","joined":"2024-03","id":"khens","url":"https://training.galaxyproject.org/training-material/api/contributors/khens.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/khens/"},{"name":"Philippe Rocca-Serra","joined":"2024-03","orcid":"0000-0001-9853-5668","elixir_node":"uk","affiliations":["elixir-europe"],"id":"proccaserra","url":"https://training.galaxyproject.org/training-material/api/contributors/proccaserra.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/proccaserra/"},{"name":"Laura Cooper","joined":"2024-03","github":false,"id":"lcooper","url":"https://training.galaxyproject.org/training-material/api/contributors/lcooper.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/lcooper/"},{"name":"Xenia Perez Sitja","joined":"2024-03","orcid":"0000-0002-7166-0183","elixir_node":"uk","affiliations":["elixir-europe"],"id":"sitjart","url":"https://training.galaxyproject.org/training-material/api/contributors/sitjart.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/sitjart/"},{"name":"Andrew Mason","joined":"2024-02","orcid":"0000-0002-8222-3974","elixir_node":"uk","id":"asmasonomics","url":"https://training.galaxyproject.org/training-material/api/contributors/asmasonomics.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/asmasonomics/"},{"name":"Branka Franicevic","joined":"2021-10","orcid":"0000-0002-3440-6581","elixir_node":"uk","affiliations":["elixir-europe"],"id":"bfranicevic","url":"https://training.galaxyproject.org/training-material/api/contributors/bfranicevic.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/bfranicevic/"},{"name":"Saskia Lawson-Tovey","joined":"2024-03","orcid":"0000-0002-8611-162X","id":"saskia-lawson-tovey","url":"https://training.galaxyproject.org/training-material/api/contributors/saskia-lawson-tovey.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/saskia-lawson-tovey/"},{"name":"Katarzyna Kamieniecka","twitter":"katemurat","orcid":"0009-0004-2454-5950","joined":"2018-08","elixir_node":"uk","affiliations":["elixir-europe"],"id":"kkamieniecka","url":"https://training.galaxyproject.org/training-material/api/contributors/kkamieniecka.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/kkamieniecka/"},{"name":"Khaled Jum’ah","email":"k.jumah@bradford.ac.uk","orcid":"0000-0001-5481-8893","joined":"2022-09","elixir_node":"uk","affiliations":["elixir-europe"],"id":"khaled196","url":"https://training.galaxyproject.org/training-material/api/contributors/khaled196.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/khaled196/"},{"name":"Krzysztof Poterlowicz","twitter":"bioinfbrad","orcid":"0000-0001-6173-5674","joined":"2017-09","elixir_node":"uk","affiliations":["elixir-europe"],"id":"poterlowicz-lab","url":"https://training.galaxyproject.org/training-material/api/contributors/poterlowicz-lab.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/poterlowicz-lab/"},{"name":"DASH UK","joined":"2023-10","github":false,"avatar":"/training-material/shared/images/dash.png","url":"https://training.galaxyproject.org/training-material/api/funders/elixir-uk-dash.json","funder":true,"funding_system":"ukri","funding_id":"MR/V038966/1","funding_statement":"This Fellowship was funded through the ELIXIR-UK DaSH project as part of the UKRI Innovation Scholars: Data Science Training in Health and Bioscience call (DaSH). (MR/V038966/1). The project aims to embed Research Data Management (RDM) know-how into UK universities and institutes by producing and delivering training in FAIR data stewardship using ELIXIR-UK knowledge and resources.","id":"elixir-uk-dash","page":"https://training.galaxyproject.org/training-material/hall-of-fame/elixir-uk-dash/"}]}