{
  "layout": "tutorial_hands_on",
  "title": "End-to-End Tissue Microarray Image Analysis with Galaxy-ME",
  "zenodo_link": "https://doi.org/10.5281/zenodo.7622545",
  "questions": [
    "What tools are available for pre-processing multiplex tissue images in Galaxy?",
    "What tools are available for downstream analysis of multiplex tissue images in Galaxy?",
    "How do I pre-process and analyze Tissue Microarray data?",
    "How can I visualize multiplex tissue images and associated data?",
    "How can I assign phenotypes to cells in an MTI dataset?"
  ],
  "objectives": [
    "Understand the tools available in Galaxy for multiplex tissue imaging analysis",
    "Analyze and visualize publicly available TMA data using Galaxy"
  ],
  "time_estimation": "3H",
  "key_points": [
    "Galaxy has tools and workflows that can be used to process and analyze multiplex tissue images",
    "Cell feature tables produced by the Galaxy TMA workflow can be used for downstream single-cell and spatial analyses",
    "There are powerful interactive visualization tools available in Galaxy that can combine the real images with associated data",
    "Tissue Microarray data can be analyzed using workflows that invoke MTI tools in batch",
    "Segmentation quality can vary significantly depending on features of the input image, tool used, and parameters"
  ],
  "contributors": [
    {
      "name": "Cameron Watson",
      "joined": "2022-07",
      "email": "watsocam@ohsu.edu",
      "orcid": "0000-0002-6942-2469",
      "id": "CameronFRWatson",
      "url": "https://training.galaxyproject.org/training-material/api/contributors/CameronFRWatson.json"
    },
    {
      "name": "Allison Creason",
      "email": "creason@ohsu.edu",
      "orcid": "0000-0001-5724-1276",
      "joined": "2023-02",
      "id": "alliecreason",
      "url": "https://training.galaxyproject.org/training-material/api/contributors/alliecreason.json"
    }
  ],
  "url": "/topics/imaging/tutorials/multiplex-tissue-imaging-TMA/tutorial.html",
  "topic_name": "imaging",
  "tutorial_name": "multiplex-tissue-imaging-TMA",
  "dir": "topics/imaging/tutorials/multiplex-tissue-imaging-TMA"
}