{"layout":"tutorial_hands_on","title":"Principles of learning and how they apply to training and teaching","subtopic":"pedagogy","time_estimation":"2h","questions":["What are the main principles that drive learning?","How can these principles be applied to training and teaching?"],"objectives":["Describe how learning works according to a few learning models","Explain how learning models can help you improve your teaching in the classroom","List learning strategies and principles suggested by evidence-based research results"],"key_points":["Teaching and training is not only a matter of knowledge","Educators help learners, specially novices, build and develop mental models","Educators help learners make connections","Educators should be aware of the limitations of expertise, e.g. the expert blind spot or fluid representations","Educators should detect and remediate misconceptions"],"contributions":{"authorship":["bebatut","fpsom","allegravia","ppalagi","gallardoalba","elixir-goblet-ttt"],"funding":["gallantries"]},"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"T00067","url":"/topics/contributing/tutorials/learning-principles/tutorial.html","topic_name":"contributing","tutorial_name":"learning-principles","dir":"topics/contributing/tutorials/learning-principles","symlink":null,"id":"contributing/learning-principles","ref_tutorials":["<p>In this tutorial we will discuss the principles of learning</p>\n\n<blockquote class=\"quote\">\n  <p><em>Learning results from what the student does and thinks and only from what the student does and thinks. The teacher can advance learning only by influencing what the student does to learn</em></p>\n\n  <p><a href=\"https://en.wikipedia.org/wiki/Herbert_A._Simon\">H.A. Simon</a> (one of the founders of the field of <a href=\"https://en.wikipedia.org/wiki/Cognitive_science\">Cognitive Science</a> and Nobel Laureate)</p>\n</blockquote>\n\n<p>This quotation from Herbert A. Simon clearly indicates that we cannot talk about teaching, teaching practices or effective teaching techniques if we don’t understand first how people learn.</p>\n\n<p>In this lesson, we want to share with you what we have collectively learnt about how learning works. Our knowledge in the field of cognition and learning comes from diving into pedagogical and cognitive research results, reading books such as <a href=\"https://www.amazon.it/How-Learning-Works-Research-Based-Principles/dp/0470484101\">“How Learning Works”</a> (<span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span>) or <a href=\"https://www.wiley.com/en-gb/Small+Teaching%3A+Everyday+Lessons+from+the+Science+of+Learning%2C+2nd+Edition-p-9781119755555\">“Small Teaching”</a> (<span class=\"citation\"><a href=\"#smallTeaching2021\">Lang 2021</a></span>) and many others, studying research articles published in the field of cognitive science and educational psychology, attending instructor training courses (like this one), and - last but not least - from our own experience as both instructors/teachers, learners, and passionate observers of learning processes and teaching practices.</p>\n\n<p>Since this material cannot cover the broad literature on the subject of learning we strongly invite you to commit to read at least one book on how learning works (<span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span>, <span class=\"citation\"><a href=\"#smallTeaching2021\">Lang 2021</a></span>), have a look at the <a href=\"http://swcarpentry.github.io/instructor-training/\">Software Carpentry Instructor training materials</a> and explore the material available through the <a href=\"https://elixir-europe.org/platforms/training/train-the-trainer\">ELIXIR Train-the-Trainer course</a>.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Sources</comment-title>\n\n  <p>This tutorial is significantly based on <span class=\"citation\"><a href=\"#via2020course\">Via <i>et al.</i> 2020</a></span>, session one\nof ELIXIR-GOBLET Train the Trainer curriculum.</p>\n</blockquote>\n\n<!--## Instruction design in 5 Phases\n\nSo how can we now use the knowledge we have gathered during this time in the course? Here we will go through the Instructional design in 5 phases and explain why learning outcomes (to articulate and specify these) is so important for the curricula and the course design process.\n\n<figure id=\"figure-1\" style=\"max-width: 90%;\"><img src=\"images/PhasesInstructionalDesign.png\"  alt=\"A flow chart of the five phases of the instructional design. The 1st phase is to select the Learning Outcomes, followed by the selection of the corresponding Learning Experiences. The third phase is to select the content that is relevant to the LO. The fourth phase is the development of the necessary assessments for the learners, with the final phase being the evaluation of the effectiveness of the LE and the LO, at which point the flow connects back to the first phase for the refinement of the process.\"  width=\"1280\" height=720 loading=\"lazy\"><a target=\"_blank\" href=\"images/PhasesInstructionalDesign.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br/><br/><figcaption><span class=\"figcaption-prefix\"><strong>Figure 1</strong>:</span> 5 phases of instructional design described by Nicholls et al in Developing teaching and learning in higher education. London, UK: Routledge. pp 51-75</figcaption></figure>\n\n1. **Writing LOs**: Important to build the training\n2. **Selection learning experiences**: Focus on LOs\n3. **Selection of content relevant to LOs**: we usually (traditionally) starting by the contentm, but here only 3rd step\n4. **Develop assessment**\n\n    Example: formative assessment as the previous challenge\n\n5. **Evaluation** of your training\n\n    Example\n    * Final exams at university\n    * Final feedback\n-->\n\n<h1 id=\"how-do-people-learn\">How do people learn?</h1>\n\n<p>So let’s start with “How do people learn and how does learning work”</p>\n\n<h2 id=\"general-definition-of-learning\">General definition of learning</h2>\n\n<p>(Relatively) permanent changes in behaviour, skills, knowledge, or attitudes resulting from identifiable psychological or social experiences.</p>\n\n<ul>\n  <li>A key feature of learning: permanence</li>\n  <li>The change has to last</li>\n  <li>Changes do not count as learning if they are temporary</li>\n  <li>Example: learning a phone number</li>\n</ul>\n\n<p>Why is it important to learn about how people learn?</p>\n\n<ul>\n  <li>It is common to confuse our effort (i.e. our teaching) with what learners get from our efforts (i.e. their learning)\n    <ul>\n      <li>We usually assume learners learnt</li>\n      <li>Nevertheless, the distinction between learning and teaching is especially important for teachers to remember and it is essential that teachers become aware of the fact that the way they think about learning affects the way they teach and that the very circumstances of teaching can influence teachers’ perceptions of learning, and therefore also influence how they teach.</li>\n      <li>For example, imagine that a cognitive scientist convinced you that people don’t retain anything of what you tell them after 20 minutes of passively listening to you. Would you keep lecturing for more than 20 minutes?</li>\n      <li>And how would you teach if, in contrast, you assumed that the mind is a vessel to be filled?</li>\n      <li>Moreover, most teachers tend to think that what is taught is equivalent to what is learned, namely that what they teach is the same as what students understand or retain of what they teach  (even though most of them know that assuming this is a mistake and that teaching and learning can be quite different).</li>\n    </ul>\n  </li>\n  <li>Learning how learning works helps clarify this distinction</li>\n  <li>The way we think about learning affects the way we teach</li>\n  <li>Understanding  how people learn makes you a more aware and therefore better teacher</li>\n  <li>You  can use such knowledge to improve your day-to-day teaching</li>\n</ul>\n\n<p>According the <strong>Meaningful Learning Theory</strong>, developed by the psychologist David Ausubel, meaningful learning generally arises from a process of learning to learn. He considers that if meaningful learning is achieved, it transcends the rote repetition of unconnected content and allows for the construction of meaning, making sense of what has been learned, and understanding its scope of application and relevance in academic and everyday situations.</p>\n\n<h2 id=\"learning-metaphors-theories-and-models\">Learning metaphors, theories and models</h2>\n\n<p>Learning - similarly to thinking - is a complex process that requires multiple approaches spanning many different disciplines, ideas, theories and models to be understood.</p>\n\n<p>Many learning theories, models, concept and ideas from from the <strong>Science of Learning</strong>, <strong>Educational Psychology</strong>, and the <strong>Cognitive Sciences</strong> are relevant to classrooms, in that they describe at least some of what usually happens there and offer guidance for assisting learning.</p>\n\n<p>This session will provide you with some understanding of how learning works but it is far from being exhaustive. In particular, we will present and discuss learning models, concepts and perspectives that are important for you to know as they suggest things that you might do in your classroom to make learners’ learning more productive and your teaching more effective and mindful.</p>\n\n<p>A metaphor is a word from one thematic domain that has been embedded in another one, thus entering a network of new linguistic relations. This is, indeed, what metaphors are all about: they are transplants from one discourse to another. They are a source of new ways of seeing things. “Metaphors of learning” are a source of new ways of seeing learning.</p>\n\n<p>We can use metaphors to shape and reveal our way of thinking about learning and, therefore, shape our actions as teachers.</p>\n\n<hr />\n\n<blockquote class=\"quote\" author=\"Plutard\">\n  <p>A mind is a fire to be kindled, not a vessel to be filled</p>\n\n</blockquote>\n\n<hr />\n\n<p>How the mind-as-a-vessel-to-be-filled metaphor may affect your way of teaching? You are likely to spend your time in the class at the blackboard, trying to ‘transmit’ to the students your own knowledge.</p>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: Learning metaphors\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: Learning metaphors</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/learning_metaphors.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/learning_metaphors.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Learning metaphors - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 5 min</hands-on-title>\n\n  <ol>\n    <li>Think about the following metaphors “A mind is a fire to be kindled”. How this metaphors may affect your way of teaching?</li>\n    <li>Think about the following metaphors “Teaching is growing a garden”. How this metaphors may affect your way of teaching?</li>\n  </ol>\n\n</blockquote>\n\n<h2 id=\"metaphors-define-the-role-of-the-teacher-and-the-learners\">Metaphors define the role of the teacher and the learners</h2>\n\n<table>\n  <thead>\n    <tr>\n      <th>Metaphor</th>\n      <th>Teacher</th>\n      <th>Learner</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Learning is knowledge transfer</td>\n      <td>Defines, develops and prepares contents</td>\n      <td>Receivers and memorizes</td>\n    </tr>\n    <tr>\n      <td>Learning metaphors</td>\n      <td>Prepares the environment, guides the exploration</td>\n      <td>Explores, works on information, attributes meanings</td>\n    </tr>\n    <tr>\n      <td>Learning is participation in social practices</td>\n      <td>Community that shares activities and social practices</td>\n      <td>As teacher</td>\n    </tr>\n  </tbody>\n</table>\n\n<h1 id=\"learning-theories\">Learning theories</h1>\n\n<p>Learning theories describes how students receive, process, and retain knowledge during learning. However, there is no single one theory (as in physics for example). There is a massive catalogue of learning theories out there and there is no universal theory of learning.</p>\n\n<figure id=\"figure-2\" style=\"max-width: 90%;\"><img src=\"images/LearningTheories.png\" alt=\"The figure shows a dendrogram of the main learning theories that are currently available. The information is organized across four main levels; the Scientific Discipline (such as Organization, Education, Philosophy, etc), the Learning Theorists (such as Montessori and Bloom), the Learning Paradigms (such as Behaviourism, Constructivism), and the key concepts.\" width=\"1600\" height=\"1088\" loading=\"lazy\" /><a target=\"_blank\" href=\"images/LearningTheories.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 2</strong>:</span> This is a diagram representing the landscape of many known learning theories available.</figcaption></figure>\n\n<p>Philosphers and researchers from multiple disciplnes have proposed a large number of learning theories: a flavour of the diversity of approaches and philosophies can be gained, for example, from the <a href=\"http://cmapspublic3.ihmc.us/rid=1LNV3H2J9-HWSVMQ-13LH/Learning%20Theory.cmap\">HoTEL</a> (Holistic approach to Technology-Enhanced Learning) website. But which should we rely on? Which should we learn, teach and apply?</p>\n\n<p>There is no universal theory of learning, but there are interesting elements for classroom teaching in many different theories There are elements of truth in different theories, and <strong>evidence-based</strong> research results that support learning principles recognized and applied today. In this sense there are interesting elements for a teacher in many different theories.</p>\n\n<p>In the following sections we will explore the most important learning theories.</p>\n\n<blockquote class=\"comment\">\n  <comment-title>Principal learning theories</comment-title>\n\n  <p>We will briefly describe the key ideas from each of these perspectives and explain how you can use them in your classroom to support learners’ learning.</p>\n\n  <h4 id=\"behaviourist-learning-theory\">Behaviourist Learning Theory</h4>\n\n  <p><strong>Behaviorism</strong> is a psychological movement that posits behavior should be studied as a natural science akin to fields like chemistry or physics. It conceives learning as changes in overt behavior. In this context, learning is acquiring new behaviours by conditioning, reflex response to stimuli, reward/punishment.</p>\n\n  <p>An important concept from this theory is <strong>operant conditioning</strong>, a variety of behaviourism that focuses on how the consequences of a behaviour affect the behaviour over time.</p>\n\n  <p>This theory is based on the idea that certain consequences (reinforcement or inhibition of a behaviour) tend to make a behaviour happen more or less frequently. According to the behaviorist perspective on learning, the instructor assumes a dominant role within the classroom, exerting complete control over the learning process. Evaluation of learning is carried out by the teacher, who determines what is considered correct or incorrect.</p>\n\n  <h4 id=\"cognitivist-learning-theory\">Cognitivist Learning Theory</h4>\n\n  <p>Diverse authors agree that, in order to implement adequate online teaching practices, it is necessary to take into account the characteristics of mental processes (<span class=\"citation\"><a href=\"#Wu1998\">Wu <i>et al.</i> 1998</a></span>, <span class=\"citation\"><a href=\"#Chandler2004\">Chandler 2004</a></span>).</p>\n\n  <p><strong>Cognitivism</strong> emerged in the 1950s as a response to Behaviorism, which was deemed inadequate in explaining cognition. <strong>Cognitive Learning Theory</strong> aims to describe the links between cognitive structures -defined as the mental representations of objects or ideas- and the learning process (<span class=\"citation\"><a href=\"#Qin2009\">Qin 2009</a></span>, <span class=\"citation\"><a href=\"#vanderVeer1988\">van der Veer and Felt 1988</a></span>), with a special focus on the processing of information. Two important theories derive from this one: <strong>Information Processing Theory</strong> and <strong>Cognitive load theory</strong>:</p>\n\n  <p>The <strong>Information Processing Theory</strong> describes learning as the result of sequential processing of information, which involve three types of memory: immediate memory, working memory and long term memory (<span class=\"citation\"><a href=\"#Gentner2014\">Gentner and Stevens 2014</a></span>). According to this theory, adequate learning resources require to assume two key elements: firstly, the fact that working memory is limited; and secondly, that the interaction between working and long term memory plays an important role in the construction and transferability of knowledge (<span class=\"citation\"><a href=\"#Chandler2004\">Chandler 2004</a></span>, <span class=\"citation\"><a href=\"#Herring1993\">Herring 1993</a></span>, <span class=\"citation\"><a href=\"#Yilmaz2011\">Yilmaz 2011</a></span>).</p>\n\n  <p>On the other hand, <strong>Cognitive Load Theory</strong> seeks specifically to address the efficiency with which information is processed. It states that the verbal and visual information is processed by independent cognitive structures, both of them with a limited capacity (<span class=\"citation\"><a href=\"#Fori2012\">Forišek and Steinová 2012</a></span>, <span class=\"citation\"><a href=\"#Via2013\">Via <i>et al.</i> 2013</a></span>, <span class=\"citation\"><a href=\"#Kats2010\">Kats 2010</a></span>, <span class=\"citation\"><a href=\"#Wright2010\">Wright <i>et al.</i> 2010</a></span>). An interesting concept derived from this theory is the cognitive overload, which refers to those situations in which the information flow exceeds the learner’s processing capacity, resulting in an inhibition of the learning process (<span class=\"citation\"><a href=\"#Aidi2009\">Aidi 2009</a></span>).</p>\n\n  <h4 id=\"constructivist-learning-theory\">Constructivist Learning Theory</h4>\n\n  <p><strong>Constructivism</strong> holds that learning is essentially active; a person who learns something new incorporates it into their previous experiences and their own mental structures. Each new piece of information is assimilated and deposited into a network of previously existing knowledge and experiences  (<span class=\"citation\"><a href=\"#Abbot1999\">Abbot and Ryand 1999</a></span>). All these ideas have been taken from different nuances, and two authors stand out: Jean Piaget with <strong>psychological constructivism</strong> and Lev Vigotsky with <strong>social constructivism</strong>.</p>\n\n  <p>From the perspective of <strong>psychological constructivism</strong>, learning is fundamentally a personal matter. It maintains the idea that the individual, both through cognitive and social aspects of knowledge as well as affective ones, is not a mere product of the environment or a simple result of his or her internal dispositions, but a construction of his or her own that is produced day by day as a result of the interaction between these two factors. The driving force of this activity would be cognitive conflict; in any constructivist activity there must be a circumstance that shakes the previous structures of knowledge and forces a rearrangement of the old knowledge in order to assimilate the new.</p>\n\n  <p>According to the <strong>social approach of Lev Vigotsky</strong>, learning is that process in which the individual assimilates certain historical-cultural experience at the same time as he/she appropriates it, which requires an active subject who gives meaning to this experience, transforming it into his/her subjectivity (<span class=\"citation\"><a href=\"#RodrguezRuiz2005\">Ruiz Mayra Rodrı́guez and Garcı́a Emilio Garcı́a-Merás 2005</a></span>).</p>\n\n  <p>The aim of Vigotsky’s theory is to discover and stimulate the <strong>zone of potential development</strong> or zone of proximal development in each student, which is defined as the distance between the actual level of development, determined by the ability to independently solve a problem, and the level of development potential, determined through solving a problem in collaboration with a more able peer (<span class=\"citation\"><a href=\"#Moreira1997\">Moreira 1997</a></span>).</p>\n\n  <p>For Vigotsky, cognitive development cannot be understood without reference to the social, historical and cultural context in which it occurs. According to this author, higher mental processes (thought, language,voluntary behaviour) have their origin in social processes; cognitive development would be the conversion of social relations into mental functions (<span class=\"citation\"><a href=\"#Moreira1997\">Moreira 1997</a></span>).</p>\n\n  <h4 id=\"critical-learning-theory\">Critical Learning Theory</h4>\n\n  <p>The <strong>Critical Learning Theory</strong>, also known as Transformative Learning Theory, aims to define the mechanisms involved in the development of critical thinking during the learning process. It considers that thought must be capable of questioning even the logic of reasoning itself, that is, it must be capable of problematising what has hitherto been treated as self-evident, of turning into an object of reflection what had previously been simply a tool. According to <span class=\"citation\"><a href=\"#Marcuse1964\">Marcuse 1964</a></span>, critical thinking aims to define the irrational character of established rationality.</p>\n\n  <p>According this theory, learning occurs when the learning process induces a shift in the student’s frame of reference. Although this goal can be achieved in multiple ways, a successful strategy is to stimulate reflection on uncritically accepted assumptions. It is the educator responsibility to cultivate students’ skills related to autonomous thinking by designing activities for that purpose.</p>\n\n  <p>Critical Learning Theory emphasises two elements: the importance of the subjective role of each learner in finding meaning for him/herself, and how social and economic conditions constrain and distort the social construction of meaning (<span class=\"citation\"><a href=\"#Giroux2018\">Giroux 2004</a></span>).</p>\n\n</blockquote>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>How do you go about learning something new? / How do you approach learning new things? - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 5 min</hands-on-title>\n\n  <ul>\n    <li>Order the following approaches (from the most to the less effective one) for you when you want to learn something new\n      <ul>\n        <li>Read about it</li>\n        <li>Attend a training session !</li>\n        <li>Have a go ?</li>\n        <li>Do, reflect, process, further understand?</li>\n      </ul>\n    </li>\n    <li>Write if you recognise elements of one of more learning perspectives (constructivism / behaviourism) in your way of learning.</li>\n  </ul>\n\n</blockquote>\n\n<h1 id=\"principal-learning-theories-practical-examples\">Principal learning theories: practical examples</h1>\n\n<p>In this section we will introduce some examples of practical applications from the different learning theories:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Learning theory</th>\n      <th>Example</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Behaviorist</td>\n      <td>Dreyfuss model for skill acquisition.</td>\n    </tr>\n    <tr>\n      <td>Cognitivist</td>\n      <td>Human Memory and Learning from cognitive sciences</td>\n    </tr>\n    <tr>\n      <td>Constructivist</td>\n      <td>Bloom’s Taxonomy</td>\n    </tr>\n    <tr>\n      <td>Critical</td>\n      <td>The hidden curriculum</td>\n    </tr>\n  </tbody>\n</table>\n\n<h2 id=\"behaviorist-learning-theory-dreyfuss-model-for-skill-acquisition\">Behaviorist Learning theory: Dreyfuss model for skill acquisition</h2>\n\n<p>The Dreyfus model of skill acquisition presents a framework illustrating the process by which learners acquire skills through a combination of formal instruction and dedicated practice. It was presented by Hubert and Stuart Dreyfus in 1980 in a report on their research at the University of California, Berkeley, Operations Research Center for the United States Air Force Office of Scientific Research. Hubert Lederer Dreyfus (1929-2017) was a prominent American philosopher and a professor of philosophy. His areas of expertise encompassed phenomenology, existentialism, and the philosophy of psychology, literature, and artificial intelligence, exploring their profound philosophical implications. Stuart E. Dreyfus holds the position of professor emeritus in the Industrial Engineering and Operations Research Department at the University of California.</p>\n\n<p>The Dreyfus model for skills acquisition by brothers Stuart and Huber Dreyfus uses a 5 stage from novice to expert.</p>\n\n<figure id=\"figure-3\" style=\"max-width: 90%;\"><img src=\"./images/DreyfussModel.png\" alt=\"A representation of the Dreyfuss model, as a gradient bar. Starting from the left, is the Novice which relies primarily on rules to organize their skills. The Novice, with experience, transitions to Advanced Beginner and then competent, increasing the use of their intuition along with the rules. The next two stages are Proficient and Expert (at the right end of the bar), which know relies almost exclusively on their intuition.\" width=\"1280\" height=\"720\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/DreyfussModel.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 3</strong>:</span> Dreyfuss model</figcaption></figure>\n\n<p>The stages follow a progression from rigid adherence (novice) to rules to an intuitive mode of reasoning based on tacit knowledge “silent knowledge” (expert).</p>\n\n<p>The fundamental idea is that when teaching a concept, you have to tailor the style of teaching to where the learner is in their understanding and that progression follows a common pattern. Early stages of learning focus on concrete steps to imitate, the focus then shifts to understanding principles and finally into self-directed innovation.</p>\n\n<p>The skill level is tied to a mental function transitioning from recollection (non-situational or situational), recognition (decomposed or holistic), decision (analytical or intuitive), and awareness (monitoring or absorbed)</p>\n\n<h3 id=\"example-of-dreyfus-model-the-carpentries\">Example of Dreyfus model: the Carpentries</h3>\n\n<p>The Carpentries (a global organization building global capacity in essential data and computational skills for research) uses the Dreyfus model as its global <a href=\"https://carpentries.github.io/instructor-training/02-practice-learning/index.html#the-acquisition-of-skill\">approach</a> for skill acquisition:</p>\n\n<figure id=\"figure-4\" style=\"max-width: 90%;\"><img src=\"./images/DreyfussModelCarpentries.jpg\" alt=\"A simplified version of the Dreyfus model, as built by the Carpentries. There are three levels; the Novice, the Competent Practicioner and the Expert.\" width=\"1432\" height=\"840\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/DreyfussModelCarpentries.jpg\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 4</strong>:</span> Carpentries build on the Dreyfus model. Source: The Carpentries Instructor training</figcaption></figure>\n\n<ul>\n  <li>\n    <p><strong>Novice</strong>: someone who does not know what they do not know, i.e., they do not yet know what the key ideas in the domain are or how they relate. Novices may have difficulty formulating questions, or may ask questions that seem irrelevant or off-topic as they rely on prior knowledge, without knowing what is or is not related yet.</p>\n\n    <p>Example: A novice learner in a Carpentries workshop might never have heard of the bash shell, and therefore may have no understanding of how it relates to their file system or other programs on their computer.</p>\n  </li>\n  <li>\n    <p><strong>Competent practitioner</strong>: someone who has enough understanding for everyday purposes. They will not know all the details of how something works and their understanding may not be entirely accurate, but it is sufficient for completing normal tasks with normal effort under normal circumstances.</p>\n\n    <p>Example: A competent practitioner in a Carpentries workshop might have used the shell before and understand how to move around directories and use individual programs, but they might not understand how they can fit these programs together to build scripts and automate large tasks.</p>\n  </li>\n  <li>\n    <p><strong>Expert</strong>: someone who can easily handle situations that are out of the ordinary.</p>\n\n    <p>Example: An expert in a Carpentries workshop may have experience writing and running shell scripts and, when presented with a problem, immediately sees how these skills can be used to solve the problem.</p>\n  </li>\n</ul>\n\n<blockquote class=\"details\">\n  <details-title>The Carpentries</details-title>\n\n  <p><a href=\"https://carpentries.org/\">The Carpentries</a> was started by Greg Wilson and Brent Gorda and they coined the term “The Carpentries” for enabling researchers to do “computational thinking” and use tools of computation effectively.</p>\n\n  <p>The Style of the Carpentries are that teachers are where the learners are e.g. by doing live-coding together.</p>\n</blockquote>\n\n<h2 id=\"cognitivist-learning-theory-memory-and-learning\">Cognitivist Learning Theory: Memory and learning</h2>\n\n<p>In a simple model from cognitive science, learning happens when information moves from <strong>working memory</strong> to <strong>long-term memory</strong>. This process can be impacted by <strong>environment</strong></p>\n\n<figure id=\"figure-5\" style=\"max-width: 90%;\"><img src=\"./images/HowMemoryWorks.png\" alt=\"A figure showning a simple representation of how memory works. The main interaction is between the two central boxes, representing the working memory and the long-term memory. The working memory maintain the active consiousness, when paying attention to the envnironment, and is extremely fast but rather limited in capacity (experiments have shown that it can keep track of 7+/-2 items). The long-term memory is much larger in capacity, but it's significantly slower to access - using a process called &quot;remembering&quot;. At the same time, the process of depositing information from the working memory into the long-term memory, is the learning process.). \" width=\"921\" height=\"406\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/HowMemoryWorks.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 5</strong>:</span> Simple model (brain is much more complex)</figcaption></figure>\n\n<!--1. Environment\n2. Working memory\n3. Long-term memory\n4. Working memory: fast\n\t* Ex: phone number\n5. Long term: slow\n\t* How much effort to remember a full poem-->\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>How short is your short term memory? - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 10 min</hands-on-title>\n\n  <p>Based on <span class=\"citation\"><a href=\"#Willingham2009\">Willingham 2009</a></span>.</p>\n\n  <ol>\n    <li>\n      <p>Read the following letter combination:</p>\n\n      <blockquote class=\"solution\">\n        <solution-title>Hide</solution-title>\n\n        <p><code class=\"language-plaintext highlighter-rouge\">APH D BDN A CKG B DCI A</code></p>\n\n      </blockquote>\n    </li>\n    <li>Hide them after 10 seconds</li>\n    <li>Take a piece of paper and write what you remember</li>\n    <li>Unhide them after 2 minutes</li>\n    <li>\n      <p>Check how many consecutive letters you can remember</p>\n    </li>\n    <li>\n      <p>Read the following letter combination</p>\n\n      <blockquote class=\"solution\">\n        <solution-title>Hide</solution-title>\n\n        <p><code class=\"language-plaintext highlighter-rouge\">A   PHD   B   DNA   C   KGB   D   CIA</code></p>\n\n      </blockquote>\n    </li>\n    <li>Hide them after 10 seconds</li>\n    <li>Take a piece of paper and write what you remember</li>\n    <li>Unhide them after 2 minutes</li>\n    <li>Check how many consecutive letters you can remember</li>\n  </ol>\n\n</blockquote>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: How short is your short term memory?\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: How short is your short term memory?</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/short_term_memory.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/short_term_memory.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<p>The amount of space in working memory does not depend on the number of letters. It depends on the <strong>number of meaningful objects</strong>. In the 2nd round, the meaning of the words (long-term memory) or connecting words with a story helps to remember. It make room in working memory.</p>\n\n<p>To facilitate learning, we as instructors have to make room in working memory.</p>\n\n<h3 id=\"what-can-we-do-to-make-room-in-working-memory\">What can we do to make room in working memory?</h3>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: How short is your short term memory?\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: How short is your short term memory?</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/short_term_memory.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/short_term_memory.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>How can you avoid to overload learners working memory?  - *<i class=\"fas fa-info-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">details</span> 5 min - Groups of 2/3 persons*</hands-on-title>\n\n  <ul>\n    <li>Discuss one thing a teacher could do to avoid overloading their students’ working memory</li>\n    <li>Write your proposal in the shared notes</li>\n  </ul>\n</blockquote>\n\n<p>What can we do to make room in working memory?</p>\n<ul>\n  <li>\n    <p>Chunking</p>\n\n    <p>Example: Short theoretical sessions alternated with practical sessions to allow the processing of the material</p>\n  </li>\n  <li>\n    <p>Avoid extraneous <strong>cognitive load</strong></p>\n\n    <p>Example: Avoid too crowded slides</p>\n  </li>\n</ul>\n\n<h3 id=\"cognitive-load\">Cognitive load</h3>\n\n<p>There are 3 cognitive loads recognized by cognitive science:</p>\n\n<ul>\n  <li><strong>Intrinsic cognitive load</strong>: effort associated with a specific topic.</li>\n  <li><strong>Germane cognitive load</strong>: the (desirable) mental effort required to create linkages between new information and old.</li>\n  <li><strong>Extraneous cognitive load:</strong> everything else that distracts or gets in the way. It refers to the way information or tasks are presented to a learner.</li>\n</ul>\n\n<h3 id=\"attention-split-effect\">Attention split effect</h3>\n\n<p>Split-attention occurs when learners are required to <strong>split their attention</strong> between <strong>at least two sources of information</strong> that have been separated either spatially or temporally</p>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Extraneous cognitive load - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 10 min - Groups of 2/3 persons</hands-on-title>\n\n  <ul>\n    <li>Pick one task you teach in your lessons/courses</li>\n    <li>Think and discuss within the room about the following questions\n      <ul>\n        <li>What would be the extraneous load in performing this tak?</li>\n        <li>How can you avoid it?</li>\n      </ul>\n    </li>\n  </ul>\n</blockquote>\n\n<h3 id=\"six-strategies-for-effective-learning-from-cognitive-psychology\">Six strategies for effective learning from cognitive psychology</h3>\n\n<p><strong>Six strategies for effective learning</strong> (from “Understanding how we learn” <span class=\"citation\"><a href=\"#weinstein2018understanding\">Weinstein <i>et al.</i> 2018</a></span>) are based on evidence from cognitive research.</p>\n\n<figure id=\"figure-6\" style=\"max-width: 90%;\"><img src=\"./images/StrategiesEffectiveLearning.png\" alt=\"Six circles representing the six Strategies for Effective Learning.\" width=\"1285\" height=\"887\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/StrategiesEffectiveLearning.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 6</strong>:</span> Six Strategies for Effective Learning <span class=\"citation\"><a href=\"#weinstein2018understanding\">Weinstein <i>et al.</i> 2018</a></span> Six Strategies for Effective Learning by [Yana Weinstein, Megan Smith, &amp; Oliver Caviglioli](http://www.learningscientists.org/downloadable-materials/) / [Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License](http://creativecommons.org/licenses/by-nc-nd/4.0/), based on a work at[http://www.learningscientists.org](http://www.learningscientists.org/), [teachinghow2s.com/cogsci](http://teachinghow2s.com/cogsci).</figcaption></figure>\n\n<ul>\n  <li>\n    <p><strong>Spaced practice</strong>: Creating a study schedule that spreads study activities out over time</p>\n\n    <p>Spaced practice is the exact opposite of cramming. When you cram, you study for a long, intense period of time close to an exam. When you space your learning, you take that same amount of study time, and spread it out across a much longer period of time. Doing it this way, that same amount of study time will produce more <em>long-lasting learning.</em></p>\n  </li>\n  <li>\n    <p><strong>Interleaving</strong>: Switching between topics while studying</p>\n\n    <p>You shouldn’t study one idea, topic, or type of problem for too long. Instead, you should change it up often. Especially good for problem-solving topics like bioinformatics. Then you should jump from one topic to another and go back to the previous one, with the aim of developing the connections among topics.</p>\n  </li>\n  <li>\n    <p><strong>Elaboration</strong>: Asking and explaining why and how things work</p>\n\n    <p>It can be used to mean a lot of different things. It involves explaining and describing ideas with many details. Elaboration also involves making connections among ideas you are trying to learn and connecting the material to your own experiences, memories, and day-to-day life.</p>\n  </li>\n  <li>\n    <p><strong>Concrete examples</strong>: When studying / explaining abstract concepts, illustrating them with specific examples</p>\n\n    <p>The idea is to take an abstract concept and use real world examples to increase understanding and 2 examples are better than 1.</p>\n  </li>\n  <li>\n    <p><strong>Dual coding</strong>: Combining worlds with visuals</p>\n\n    <p>Dual coding is combining words and visuals such as pictures, diagrams, graphic organizers, and so on. The idea is to provide two different representations of the information, both visual and verbal. Adding visuals to a verbal description can make the presented ideas more concrete, and provides two ways of understanding the presented ideas. The visuals should be meaningful.</p>\n  </li>\n  <li>\n    <p><strong>Retrieval practice</strong>: Bringing learned information to mind from long term memory</p>\n\n    <p>Concept maps are examples of a retrieval practice when you bring out knowledge/memories from long-term memory</p>\n  </li>\n</ul>\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>How do you understand the 6 strategies for effective learning? - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 15 min - Groups of 2 persons</hands-on-title>\n\n  <ul>\n    <li>Pick up one strategy per group</li>\n    <li>Discuss about the strategy\n      <ul>\n        <li>Did you understand it the same way?</li>\n        <li>Do you have any questions?</li>\n      </ul>\n    </li>\n    <li>Find out an example on how you would implement it as a teacher/instructor (what would you do as a teacher in order to facilitate learning based on the strategy at hand)</li>\n  </ul>\n</blockquote>\n\n<p>We highly recommend to look at the materials in a book and a website and blog as they are intended to teach about principles of learning and to provide teachers and students with flexible guiding principles to guide learning and studying. In <a href=\"/training-material/topics/teaching/tutorials/learner_participation_engagement/tutorial.html\">“Training techniques to enhance learner participation and engagement” tutorial</a>, a number of teaching practices are described. You should try to reconnect them to these learning strategies, i.e. try to understand how the proposed teaching practices facilitate learning based on these six strategies.</p>\n\n<h3 id=\"seven-learning-principles-from-cognitive-sciences\">Seven learning principles from cognitive sciences</h3>\n\n<p>From <a href=\"https://www.academia.edu/6743627/How_Learning_Works_Seven_Research_Based_Principles_for_Smart_Teaching_Susan_A_Ambrose_Michael_W_Bridges_Michele_DiPietro_Marsha_C_Lovett_Marie_K_Norman_with_a_Foreword_by_Richard_E_Mayer\">“How Learning works”</a> <span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span></p>\n\n<ul>\n  <li>\n    <p><strong>Principle P1</strong>: Students’ <strong>prior knowledge</strong> can help or hinder learning.</p>\n\n    <p>Hindrances include prior knowledge which may be accurate but insufficient to support learning new material. Inappropriate for the specific class, thus distorting comprehension of new material; or, completely inaccurate.</p>\n  </li>\n  <li>\n    <p><strong>Principle P2</strong>: How students <strong>organise knowledge</strong> influences how they learn and apply what they know.</p>\n\n    <p>Generally, people organize knowledge “as a function of their experience, the nature of their knowledge, and the role that that knowledge plays in their lives”</p>\n  </li>\n  <li>\n    <p><strong>Principle P3</strong>: Students <strong>motivation</strong> determines, directs and sustains what they do learn.</p>\n\n    <p><span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span> define motivation as “the personal investment that an individual has in reaching a desired state or outcome” and identify three core concepts for understanding motivation</p>\n    <ul>\n      <li>the subjective value of a goal</li>\n      <li>the expectancies for successfully reaching the goal</li>\n      <li>??</li>\n    </ul>\n  </li>\n  <li>\n    <p><strong>Principle P4</strong>: To develop mastery, students must acquire <strong>component skills</strong>, practice <strong>integrating</strong> them, and  know when to <strong>apply</strong> what they have learned</p>\n\n    <p>Mastery refers to “the attainment of a high degree of competence with a particular area”. It could be either beneficial or detrimental.</p>\n  </li>\n  <li>\n    <p><strong>Principle P5</strong>: <strong>Goal-directed</strong> practice coupled with <strong>targeted feedback</strong> enhances the quality of students’ learning</p>\n\n    <p>Learning and performance are advanced when students employ a methodology that</p>\n    <ul>\n      <li>focuses on a specific performance goal</li>\n      <li>pinpoints a suitable level of challenge relative to students’ current performance,</li>\n      <li>is in an amount and frequency sufficient to meet the performance criteria.</li>\n    </ul>\n  </li>\n  <li>\n    <p><strong>Principle P6</strong>: Students’ current level of development interacts with the <strong>social, emotional, and intellectual climate</strong> of the course to impact learning</p>\n\n    <p><span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span> maintain that “student-centered teaching requires us to teach students, not content”.</p>\n  </li>\n  <li>\n    <p><strong>Principle P7</strong>: To become self-directed learners, students must learn to <strong>monitor and adjust</strong> their approaches to learning.</p>\n\n    <p>This principle relates to metacognition, or “the process of reflecting on and directing one’s own thinking”. You can find more information on the connection of metacognition to student learning and performance here <span class=\"citation\"><a href=\"#Stanton2021\">Stanton <i>et al.</i> 2021</a></span>.</p>\n\n    <p>Students develop metacognitive skills by learning to</p>\n    <ul>\n      <li>assess the task at hand,</li>\n      <li>evaluate their own strengths and weaknesses,</li>\n      <li>plan appropriate approaches to complete the task,</li>\n      <li>apply strategies to monitor their performance, while making adjustments to the selected approach.</li>\n    </ul>\n  </li>\n</ul>\n\n<!-- \n> <hands-on-title>How do you understand the 7 principles of learning?  - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 15 min - Groups of 2/3 person</hands-on-title>\n>\n> * Read and reflect together the principles\n> * Pick one principle that is not (fully) clear to you\n> * Ask one question about this principle\n> * Write here any insights/thoughts/comments to share from your breakout room\n{: .hands_on}-->\n\n<blockquote class=\"details\">\n  <details-title>Resources to learn more about the Cognitive Learning Theory</details-title>\n\n  <p>There is a great deal of literature on how learning works.</p>\n\n  <p>The reason why we mention these three books is that they show how to integrate effective, research based strategies for learning into classroom practice.</p>\n\n  <p>Educational practice usually does not rely on research findings. People tend to rely on their intuitions about what’s best for learning. But relying on intuition may be a bad idea for teachers and learners alike.</p>\n\n  <ul>\n    <li>\n      <p><a href=\"https://www.amazon.it/How-Learning-Works-Research-Based-Principles/dp/0470484101\">“How Learning Works”</a> (<span class=\"citation\"><a href=\"#ambrose2010learning\">Ambrose <i>et al.</i> 2010</a></span>)</p>\n\n      <p>This book presents a set of evidence-based principles for how to help people learn that is grounded in cognitive theory (that is, the science of instruction). It tries to help teachers understand how research in the science of learning can improve their reaching.</p>\n\n      <p>The book is organised around seven learning principles. Each principle is based on research evidence from the science of learning and the science of instruction.</p>\n    </li>\n    <li>\n      <p><a href=\"https://www.wiley.com/en-gb/Small+Teaching%3A+Everyday+Lessons+from+the+Science+of+Learning%2C+2nd+Edition-p-9781119755555\">“Small Teaching”</a> (<span class=\"citation\"><a href=\"#smallTeaching2021\">Lang 2021</a></span>)</p>\n\n      <p>Cognitive psychologists, neuroscientists, and biologists all have produced a revealing body of research over the past several decades on how human beings learn, but often translating these findings into the classroom is overwhelming for busy instructors.</p>\n\n      <p>“Small Teaching” bridges the gap between research and practice  by providing a fully developed strategy for making deliberate, structured, and incremental steps towards tuning into how students are hardwired to learn.</p>\n\n      <p>The book introduces small activities that require minimal preparation and grading. The models presented are specifically designed to be used as both one-time experiences to innovate a course session or unit plan as well as a menu of options that can be combined into an entirely new teaching approach.</p>\n    </li>\n    <li>\n      <p>“Understanding how we learn” <span class=\"citation\"><a href=\"#weinstein2018understanding\">Weinstein <i>et al.</i> 2018</a></span></p>\n\n      <p>By the “learning scientists” Weinstein and Sumeracki (and illustrated by Oliver Caviglioli), the books examines the cognitive psychology’s application to education</p>\n\n      <p>It is designed to convey the concepts of research to the reality of an instructor’s classroom. The book proposes 6 strategies for effective learning (based on evidence from cognitive research). It is structured in four parts:</p>\n      <ul>\n        <li>Evidence-based education and the science of learning</li>\n        <li>Basics of human cognitive processes</li>\n        <li>Strategies for effective learning</li>\n        <li>Tips for students, teachers, and parents</li>\n      </ul>\n    </li>\n    <li>\n      <p><a href=\"https://carpentries.github.io/instructor-training/\">The Carpentries Instructor Training materials</a></p>\n\n      <p>The Carpentries is a community of volunteers teaching computational and data management skills worldwide. The community also developed training materials to teach pedagogical skills. Much of the GTN TtT was inspired by the pedagogical materials from the Carpentries and the ELIXIR TtT.</p>\n    </li>\n  </ul>\n\n</blockquote>\n\n<!-- \n> <hands-on-title>What is learning in your opinion/experience? How does learning occur? - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 5 min</hands-on-title>\n>\n> _Break-out_ room (2 ppl per room)\n>\n> We follow the first challenge with another one. Now IN PAIRS in breakout rooms (Zoom). Here the reflection is on LEARNING and what learning is in your experience. Write your thoughts, one or more sentences, in the shared Google Doc.\n> \t* Discuss your reflections on learning and what learning is in your experience\n>\t* Write here any insights/thoughts/comments to share from your breakout room\n{: .hands_on} -->\n\n<h2 id=\"constructivist-learning-theory-the-blooms-taxonomy\">Constructivist Learning Theory: The Bloom’s Taxonomy</h2>\n\n<p>And one of the most used “models” or concepts is the one based on the Bloom’s six categories of cognitive skills. This tool is important to develop training, but not only.</p>\n\n<p><strong>Bloom’s taxonomy</strong> is a set of six categories of cognitive skills, that are accompanied by actionable verb.</p>\n\n<figure id=\"figure-7\" style=\"max-width: 90%;\"><img src=\"./images/bloomsTaxonomyPyramid.png\" alt=\"The pyramid of Blooms Taxonomy of verbs. Starting from the bottom layer, the corresponding aspects are: remembering, understanding, applying, analyzing, evaluating and creating.\" width=\"847\" height=\"622\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/bloomsTaxonomyPyramid.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 7</strong>:</span> Source: https://tips.uark.edu/blooms-taxonomy-verb-chart/</figcaption></figure>\n\n<p>From bottom to top:</p>\n<ul>\n  <li><strong>Remembering (original Knowledge):</strong> involves recognizing or remembering facts, terms, basic concepts, or answers without necessarily understanding what they mean.</li>\n  <li><strong>Understand (original comprehension):</strong> involves demonstrating an understanding of facts and ideas by organizing, summarizing, translating, generalizing, giving descriptions, and stating the main ideas.</li>\n  <li><strong>Apply/Application:</strong> involves using acquired knowledge—solving problems in new situations by applying acquired knowledge, facts, techniques and rules. Learners should be able to use prior knowledge to solve problems, identify connections and relationships and how they apply in new situations.</li>\n  <li><strong>Analyze:</strong> involves examining and breaking information into component parts, determining how the parts relate to one another, identifying motives or causes, making inferences, and finding evidence to support generalizations.</li>\n  <li><strong>Evaluate:</strong> involves presenting and defending opinions by making judgments about information, the validity of ideas, or quality of work based on a set of criteria</li>\n  <li><strong>Create (original synthesize):</strong>involves building a structure or pattern from diverse elements; it also refers to the act of putting parts together to form a whole.</li>\n</ul>\n\n<p>It is important to highlight that, under this framework, <strong>critical thinking is considered a combination of analyzing, evaluating and creating</strong>, i.e. the top three layers of the taxonomy. Blooms taxonomy levels are very useful to align instruction with learners’ level of complexity of thinking as well as experience.</p>\n\n<p>What are the uses of this tool?</p>\n<ul>\n  <li>For learners\n    <ul>\n      <li>Help to structure their knowledge</li>\n    </ul>\n  </li>\n  <li>For instructors\n    <ul>\n      <li>Knowing at which level of cognitive complexity you want to teach</li>\n      <li>\n        <p>Write Learning Outcomes</p>\n\n        <figure id=\"figure-8\" style=\"max-width: 90%;\"><img src=\"./images/bloomsTaxonomy.png\" alt=\"6 levels of Bloom's taxonomy (and their verbs) from bottom (lower-order thinking skills) to top (higher-order 'critical' thinking skills): Remember (recall or reiterate information) with memorize, recognise, identify, describe, reproduce, list, define, label, name, state, outline, order, arrange; Understand (demonstrate understanding of facts) with distinguish, classify, select, review, discuss, indicate, explain, estimate, locate, summarise; Apply (apply knowledge to real situations) with operate, manipulate, experiment, choose, modify, prepare, produce; Analyze (resolve ideas into simple parts, identify patterns) with calculate, examine, model, test, break down, infer, predict, solve; Synthesise (pull ideas into a coherent whole, create new ideas) with combine, formulate, illustrate, imagine, design, invent, compose; Evaluate (make &amp; defend judgements, assess theories &amp; outcomes) with critique, compare ideas, solve, recommend, rate. \" width=\"1090\" height=\"536\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/bloomsTaxonomy.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 8</strong>:</span> ACTION verbs express levels of cognitive complexity</figcaption></figure>\n      </li>\n      <li>Design instruction and learning experiences i.e. how you are to teach/train, which infrastructure and how to present the materials etc</li>\n      <li>Assess learning (taking place during curricula or course and after)</li>\n      <li>Align instruction with learners’ level of complexity of thinking as well as experience.</li>\n    </ul>\n  </li>\n</ul>\n\n<h2 id=\"critical-learning-theory-the-hidden-curriculum-theory\">Critical Learning Theory: The Hidden Curriculum Theory</h2>\n\n<p>The concept of hidden curriculum refers to the learning that is incorporated by students though these aspects do not appear explicitly in the official curriculum, relying on the organisational aspects of classroom life that are generally not perceived by either students or teachers (<span class=\"citation\"><a href=\"#Giroux2018\">Giroux 2004</a></span>).</p>\n\n<p>According the Hidden Curriculum Theory, what students learn from the formally sanctioned content of the curriculum is much less important than what they learn from the ideological assumptions embodied in the communicative systems. Through the hidden curriculum, students would internalise values that emphasise respect for authority, punctuality, cleanliness, docility and conformity (<span class=\"citation\"><a href=\"#Giroux2018\">Giroux 2004</a></span>). It considers that elements such as exposure to a core of common subjects would lead to a dissolution of individuality in the mass, in the collective, to a standardisation and homogenisation of psychologies (<span class=\"citation\"><a href=\"#Olivo2005\">Olivo 2005</a></span>).</p>\n\n<p>According the Hidden Curriculum Theory, if there is really an interest in <strong>fostering critical thinking</strong>, the <strong>discursive mode that should dominate in the classroom should be the interrogative one</strong>. It considers that questioning is a way of thinking, and that is why thinking is not only deriving conclusions, but often consists of the opposite: starting from the accepted conclusions of a community and turning them upside down (<span class=\"citation\"><a href=\"#Sztajnszrajber2013\">Sztajnszrajber 2013</a></span>).</p>\n\n<p>According this theory, technological tools, due to their design, do not act just as neutral means for transmitting information, but they also transmit values and habits of thought (<span class=\"citation\"><a href=\"#Anders1980\">Anders 1980</a></span>). As <span class=\"citation\"><a href=\"#Giroux2018\">Giroux 2004</a></span> notes, no matter how progressive an approach to critical thinking may be, it will squander its own potential if it operates on the basis of a web of social relations in the classroom that are authoritarianly hierarchical and promote passivity, docility and silence.</p>\n\n<h1 id=\"mental-models\">Mental models</h1>\n\n<p><strong>Mental model</strong> is a collection of concepts and facts, along with the relationships between those concepts, that a person has about a topic or field. It is how people organize their knowledge</p>\n\n<p>You can think of mental models as a graph with nodes (facts, concepts) and edges (connections), as seen in the figure of the mental model of animals below:</p>\n\n<figure id=\"figure-9\" style=\"max-width: 90%;\"><img src=\"./images/animalMentalModel.png\" alt=\"A dendrogram showing the various descriptors of an animal, and the relationships between them. For example, the box &quot;animal&quot; is connected to the entities &quot;eats&quot;, &quot;breathes&quot; and &quot;can move&quot;, as well as sub-entities, such as &quot;bird&quot; and &quot;fish&quot;. Each one of these, in turn, is connected to even more specific sub-entities (such as &quot;penguin&quot; for &quot;bird&quot; and &quot;salmon&quot; for &quot;fish&quot;).\" width=\"635\" height=\"357\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/animalMentalModel.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 9</strong>:</span> mental model of animals</figcaption></figure>\n\n<p>The mental model of an expert in any given subject will be far larger and more complex than that of a novice, including both more concepts and more detailed and numerous relationships. Linking with Dreyfus model:</p>\n\n<ul>\n  <li>A novice has a minimal mental model of surface features of the domain. Inaccuracies based on limited prior knowledge may interfere with adding new information. Predictions are likely to borrow heavily from mental models of other domains which seem superficially similar.</li>\n  <li>A competent practitioner has a mental model that is useful for everyday purposes. Most new information they are likely to encounter will fit well with their existing model. Even though many potential elements of their mental model may still be missing or wrong, predictions about their area of work are usually accurate.</li>\n  <li>An expert has a densely populated and connected mental model that is especially good for problem solving. They quickly connect concepts that others may not see as being related. They may have difficulty explaining how they are thinking in ways that do not rely on other features unique to their own mental model.</li>\n</ul>\n\n<h2 id=\"misconceptions\">Misconceptions</h2>\n\n<ul>\n  <li><strong>Simple factual errors</strong>: These are the easiest to correct.</li>\n  <li><strong>Broken models</strong>: We can address these by having learners reason through examples to see contradictions.</li>\n  <li><strong>Fundamental beliefs</strong>: These beliefs are deeply connected to the learner’s social identity and are the hardest to change.</li>\n</ul>\n\n<h1 id=\"teaching-or-training\">Teaching or training?</h1>\n\n<!--\n\n\n<div markdown=\"1\">\n> <div class=\"box-title\" aria-label=\"quiz box: Teaching or training?\"><i class=\"far fa-question-circle\" aria-hidden=\"true\"></i><span class=\"visually-hidden\"></span> Quiz: Teaching or training?</div>\n> Check your knowledge with a quiz!\n>\n>  - [Self Study Mode](/training-material/quiz/quiz.html?mode=self&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/teaching_or_training.yaml) - do the quiz at your own pace, to check your understanding.\n>  - [Classroom Mode](/training-material/quiz/quiz.html?mode=teacher&quiz=/training-material/topics/contributing/tutorials/learning-principles/quiz/teaching_or_training.yaml) - do the quiz synchronously with a classroom of students.\n{: .question}\n</div>\n-->\n\n<blockquote class=\"hands_on\">\n  <hands-on-title>Teaching or training?  - <i class=\"fas fa-hourglass-half\" aria-hidden=\"true\"></i><span class=\"visually-hidden\">time</span> 15 min</hands-on-title>\n\n  <ul>\n    <li>Based on your experience, what are the differences between teaching and training?</li>\n    <li>Write your reflexions in the shared notes</li>\n  </ul>\n</blockquote>\n\n<figure id=\"figure-10\" style=\"max-width: 90%;\"><img src=\"./images/teachingVStraining.png\" alt=\"A cartoon showing one of the differences between teaching and training. One the left side, the teacher is showing the information on a blackboards - in training, the instructor is showing, in practice, how this can be applied.\" width=\"1024\" height=\"737\" loading=\"lazy\" /><a target=\"_blank\" href=\"./images/teachingVStraining.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 10</strong>:</span> A cartoon showing one of the differences between teaching and training. Source: [Open Science Training Handbook](https://www.fosteropenscience.eu/content/open-science-training-handbook)</figcaption></figure>\n\n<p>Teaching is more theoretical and abstract, while training (when done well) is more hands-on and practical.</p>\n\n<p>Teaching seeks to impart knowledge and provide information, while training is intended to develop abilities.</p>\n\n<ul>\n  <li><strong>Teach</strong>: to provide knowledge, instruction or information</li>\n  <li><strong>Train</strong>: to develop abilities through practice with instruction or supervision</li>\n</ul>\n\n<p>For example, it is possible to teach someone about buoyancy, fluid dynamics, water displacement and coastline safety, but that knowledge will not make them a good swimmer. Specific, practical and applied training is necessary to use abstract knowledge to learn or master a skill. In many cases, teaching and training are complementary. Vocational training programs often combine teaching and training quite nicely.</p>\n\n<h1 id=\"conclusion\">Conclusion</h1>\n\n<p>After going through the theory of learning with the 6 strategies and the Ambrose 7 principles as well as the differences between teaching and training, the next step is to understand how these elements can be applied in designing an effective curriculum developmental trajectory.</p>\n"],"ref_slides":[],"hands_on":true,"slides":false,"mod_date":"2023-11-21 13:51:43 +0000","pub_date":"2022-09-23 10:02:09 +0000","version":56,"quiz":[{"id":"learning_metaphors.yaml","path":"topics/contributing/tutorials/learning-principles/quiz/learning_metaphors.yaml","title":"Learning metaphors","contributors":["bebatut"]},{"id":"overloading_short_term_memory.yaml","path":"topics/contributing/tutorials/learning-principles/quiz/overloading_short_term_memory.yaml","title":"How can you avoid to overload learners working memory?","contributors":["bebatut"]},{"id":"short_term_memory.yaml","path":"topics/contributing/tutorials/learning-principles/quiz/short_term_memory.yaml","title":"How short is your short term memory?","contributors":["bebatut"]},{"id":"teaching_or_training.yaml","path":"topics/contributing/tutorials/learning-principles/quiz/teaching_or_training.yaml","title":"Teaching or training?","contributors":["bebatut"]},{"id":"verbs.yaml","path":"topics/contributing/tutorials/learning-principles/quiz/verbs.yaml","title":"Identify observable and non observable actions (verbs)","contributors":["bebatut"]}],"api":"https://training.galaxyproject.org/training-material/api/topics/contributing/tutorials/learning-principles/tutorial.json","tools":[],"supported_servers":[],"topic_name_human":"Contributing to the Galaxy Training Material","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial","contributors":[{"name":"Bérénice Batut","email":"berenice.batut@gmail.com","twitter":"bebatut","linkedin":"berenicebatut","matrix":"bebatut:matrix.org","orcid":"0000-0001-9852-1987","joined":"2017-09","elixir_node":"fr","contact_for_training":true,"location":{"country":"FR","lat":45.77,"lon":3.08},"fediverse":"https://piaille.fr/@bebatut","fediverse_flavor":"mastodon","affiliations":["gallantries","ifb","elixir-europe"],"id":"bebatut","url":"https://training.galaxyproject.org/training-material/api/contributors/bebatut.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/bebatut/"},{"name":"Fotis E. Psomopoulos","email":"fpsom@certh.gr","twitter":"fopsom","matrix":"fpsom:matrix.org","orcid":"0000-0002-0222-4273","linkedin":"fpsom","joined":"2019-03","elixir_node":"gr","affiliations":["gallantries","elixir-europe"],"id":"fpsom","url":"https://training.galaxyproject.org/training-material/api/contributors/fpsom.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/fpsom/"},{"name":"Allegra Via","joined":"2022-09","id":"allegravia","url":"https://training.galaxyproject.org/training-material/api/contributors/allegravia.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/allegravia/"},{"name":"Patricia Palagi","joined":"2022-09","id":"ppalagi","url":"https://training.galaxyproject.org/training-material/api/contributors/ppalagi.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/ppalagi/"},{"name":"Cristóbal Gallardo","joined":"2020-11","elixir_node":"de","orcid":"0000-0002-5752-2155","former_affiliations":["uni-freiburg","elixir-europe"],"id":"gallardoalba","url":"https://training.galaxyproject.org/training-material/api/contributors/gallardoalba.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/gallardoalba/"},{"name":"ELIXIR Goblet Train the Trainers","joined":"2022-09","github":false,"avatar":"/training-material/shared/images/elixir.png","id":"elixir-goblet-ttt","url":"https://training.galaxyproject.org/training-material/api/organisations/elixir-goblet-ttt.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/elixir-goblet-ttt/"},{"name":"Gallantries: Bridging Training Communities in Life Science, Environment and Health","short_name":"Gallantries","start_date":"2020-09-01","end_date":"2023-09-30","joined":"2020-09","avatar":"https://gallantries.github.io/assets/images/gallantries-logo.png","github":false,"funder":true,"url":"https://training.galaxyproject.org/training-material/api/funders/gallantries.json","funder_name":"Erasmus+ Programme","funding_id":"2020-1-NL01-KA203-064717","funding_system":"erasmusplus","funding_statement":"This project (<a href=\"https://erasmus-plus.ec.europa.eu/projects/search/details/2020-1-NL01-KA203-064717\"><code class=\"language-plaintext highlighter-rouge\">2020-1-NL01-KA203-064717</code></a>) is funded with the support of the Erasmus+ programme of the European Union. Their funding has supported a large number of tutorials within the GTN across a wide array of topics.\n<img src=\"https://gallantries.github.io/assets/images/logosbeneficaireserasmusright_en.jpg\" alt=\"eu flag with the text: with the support of the erasmus programme of the european union\" />\n<img src=\"https://www.erasmusplus.nl/assets/images/logo.png\" alt=\"erasmus plus logo\" />","members":["abretaud","bebatut","colineroyaux","fpsom","hexylena","shiltemann","yvanlebras"],"id":"gallantries","page":"https://training.galaxyproject.org/training-material/hall-of-fame/gallantries/"}]}