{"layout":"tutorial_hands_on","title":"Metadata","abbreviations":{"FAIR":"Findable, Accessible, Interoperable, Reusable"},"zenodo_link":"","questions":["What is metadata?","What is good metadata?","Using community standards to write (meta)data"],"objectives":["Define the term ‘metadata’.","Recall examples of community/domain standards that apply to data and metadata."],"time_estimation":"40M","key_points":["Metadata is data about data.","Metadata is used to help you find and interpret data.","Domain-relevant community standards help researchers write better, interoperable metadata."],"tags":["fair","dmp","data stewardship"],"priority":2,"contributions":{"authorship":["robertmand","nsjuty","smza","nsoranzo","saramorsy","kellsnow","khens","proccaserra","lcooper","sitjart","asmasonomics","bfranicevic","saskia-lawson-tovey","kkamieniecka","khaled196","poterlowicz-lab"],"funding":["elixir-uk-dash"]},"subtopic":"pointers","follow_up_training":[{"type":"internal","topic_name":"fair","tutorials":["fair-data-registration"]}],"requirements":[{"type":"internal","topic_name":"fair","tutorials":["fair-intro","fair-origin"]}],"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"T00432","url":"/topics/fair/tutorials/fair-metadata/tutorial.html","topic_name":"fair","tutorial_name":"fair-metadata","dir":"topics/fair/tutorials/fair-metadata","symlink":null,"id":"fair/fair-metadata","ref_tutorials":["<p>The term metadata is defined along with what constitutes rich metadata.  Learners will be able to recall examples of community/domain standards that apply to data and metadata.</p>\n\n<blockquote class=\"agenda\">\n  <agenda-title></agenda-title>\n\n  <p>In this tutorial, we will cover:</p>\n\n<ol id=\"markdown-toc\">\n  <li><a href=\"#metadata-and-the-fair-principles\" id=\"markdown-toc-metadata-and-the-fair-principles\">Metadata and the FAIR Principles</a></li>\n  <li><a href=\"#what-is-metadata\" id=\"markdown-toc-what-is-metadata\">What is metadata?</a></li>\n  <li><a href=\"#writing-fair-metadata\" id=\"markdown-toc-writing-fair-metadata\">Writing FAIR metadata</a></li>\n  <li><a href=\"#rich-metadata-in-public-data-repositories\" id=\"markdown-toc-rich-metadata-in-public-data-repositories\">Rich metadata in public data repositories</a></li>\n  <li><a href=\"#using-community-standards-for-metadata\" id=\"markdown-toc-using-community-standards-for-metadata\">Using community standards for (meta)data</a></li>\n  <li><a href=\"#useful-resources\" id=\"markdown-toc-useful-resources\">Useful resources</a></li>\n</ol>\n\n</blockquote>\n\n<h1 id=\"metadata-and-the-fair-principles\">Metadata and the FAIR Principles</h1>\n<p>Metadata relates most directly to the following 10 FAIR Principles highlighted in Table 2.1.  We will discuss and signpost these in this episode.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>The FAIR Guiding Principles</th>\n      <th> </th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>To be Findable:</td>\n      <td>F1. (meta)data are assigned a globally unique and persistent identifier<br /><strong>F2. data are described with rich metadata (defined by R1 below)</strong><br /><strong>F3. metadata clearly and explicitly include the identifier of the data it describes</strong><br />F4. (meta)data are registered or indexed in a searchable resource</td>\n    </tr>\n    <tr>\n      <td>To be Accessible:</td>\n      <td>A1. (meta)data are retrievable by their identifier using a standardized communications protocol <br />A1.1 the protocol is open, free, and universally implementable<br />A1.2 the protocol allows for an authentication and authorization procedure, where necessary <br /><strong>A2. metadata are accessible, even when the data are no longer available</strong></td>\n    </tr>\n    <tr>\n      <td>To be Interoperable:</td>\n      <td><strong>I1. (meta)data use a formal, accessible, shared, and broadly applicable language for knowledge representation</strong> <br /><strong>I2. (meta)data use vocabularies that follow FAIR principles<br />I3. (meta)data include qualified references to other (meta)data</strong></td>\n    </tr>\n    <tr>\n      <td>To be Reusable:</td>\n      <td><strong>R1. meta(data) are richly described with a plurality of accurate and relevant attributes</strong> <br /><strong>R1.1. (meta)data are released with a clear and accessible data usage license</strong><br /><strong>R1.2. (meta)data are associated with detailed provenance<br />R1.3. (meta)data meet domain-relevant community standards</strong></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Table 2.1: The 15 FAIR Guiding Principles. Principles relating directly to metadata are highlighted in <strong>black</strong>.</p>\n\n<h1 id=\"what-is-metadata\">What is metadata?</h1>\n\n<p>Metadata is information that describes your data - it is data about data.</p>\n\n<p>The provision of ‘rich’ metadata is key to FAIR since it allows data to be found, and enables other researchers to interpret data appropriately. ‘Rich’ in this context refers to extensive metadata, often connecting data to other data or terms (even in other datasets), with <strong>qualified references</strong>, Qualified references: terms used to describe relationships to pieces of (meta)data., specifying how they are connected.</p>\n\n<p>If a researcher is given access to a dataset (a spreadsheet in CSV format, for example), the data is not usable without meaningful column headings and context. For example, what is this data about?  Is it part of a larger dataset and, if so, how is it related?  What are the column headings representing, and what are the rows representing?  Additionally, if the values in the individual cells are device or assay measurements, what device was used, and what assay?</p>\n\n<p>If you look at the example of the spreadsheet below (Figure 2.1) the metadata are coloured blue and the data are in orange.  The data in this example are clinical observations for a cohort of patients and the metadata are the descriptive column headings and additional information about the origin of the data.  The column headings provide context for the data values in each cell.  The contact information enables a researcher to direct questions about data reuse and context.  This raises an interesting point though, because metadata should be rich enough to allow any person to reuse the underlying data without ambiguity (FAIR Principles F2, R1).</p>\n\n<p>Though  this Figure 2.1 shows the difference between metadata and data, it does not exemplify the use of rich metadata.</p>\n\n<figure id=\"figure-1\" style=\"max-width: 90%;\"><img src=\"../../images/figure2-1_human-welsh-cohort.png\" alt=\"spreadsheet. \" width=\"850\" height=\"427\" loading=\"lazy\" /><a target=\"_blank\" href=\"../../images/figure2-1_human-welsh-cohort.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 1</strong>:</span> A spreadsheet showing the relationship between data (orange) and metadata (blue)</figcaption></figure>\n\n<p>We are given only 2 pieces of <strong>data provenance</strong>, Data provenance: metadata describing the origin of a piece of data, including information such as version, original location of the data, and usually an audit trail up to the current version, in this example (i) the study name “LONDON DIABETES COHORT” which could help discover other documentation about the project; (ii) the name of the person who presumably led the study.  While these may help to search for further information, for a human user, this would still be fraught with issues since both names may not uniquely identify the study or its lead.  For a machine agent, such as a script, interpretation is made difficult because the metadata is not clearly marked-up (represented formally with tags).</p>\n\n<p>To fix this, contact details for investigators could be included.  Often <a href=\"https://info.orcid.org/what-is-orcid/\">ORCID IDs</a> associated with names are used since they uniquely identify an individual and do not pose problems when an investigator moves institutions and the original (email) address changes.  Coupled with this, investigators can be formally assigned a role in the provenance metadata allowing people to contact the appropriate person, for example, “data producer”, “data manager”.</p>\n\n<p>A project URL should be used where possible, ideally one that can act as a <strong>persistent identifier</strong>, Globally unique and persistent identifier: a permanent reference to a digital resource, usually given as a URL, that takes the user to that resource, for the dataset.  The landing page for that URL should provide more context for the dataset, and describe high-level information such as how the dataset relates to other project outputs, as well as providing other provenance information (dates, times, places, people).  This could include more metadata about the type of study, objectives, protocols, dates, release versioning and so on.  At the end of this episode, resources are given to help define metadata elements that could be included, including a project called <a href=\"https://www.dublincore.org/specifications/dublin-core/\">Dublin Core</a> which defines <a href=\"https://www.dublincore.org/specifications/dublin-core/dcmi-terms/\">15 such elements</a> or metadata fields.</p>\n\n<p>Terms of access and reuse are missing which could be rectified by including a <a href=\"https://rdmkit.elixir-europe.org/licensing#what-licence-should-you-apply-to-your-research-data\">data licence</a>, which often appears as part of the metadata, usually at the bottom of a webpage hosting data.\nThere could be ambiguity around the acronym, “BPM”, used in the third column header, so this should be defined within a glossary of acronyms and or ideally hyperlinked to a definition in an existing ontology.</p>\n\n<p>There are issues too with the data, as well as the metadata. The second column DISEASE TYPE could be better designed. Two pieces of information (data) are depicted in the same column: disease type (diabetes) and disease stage (early/late).  Ideally, these should be in 2 separate columns allowing researchers to subset on stage and disease type independently for downstream analysis. There are also four different terms used for diabetes (“Diabetes Mellitus II”, “Diabetes”, “Diabetes Mellitus” and “Diabetes Mellitus I”), which again does not allow a researcher to subset data efficiently.  To fix this you would use defined terms within an existing vocabulary or ontology.  The following accesses a <span class=\"citation\"><a href=\"#diseaseontology\">Ontology</a></span> we could use, where each term (for example, “type 2 diabetes mellitus”) is described and assigned a unique ID.  In the example above you would use this unique ID, or the associated descriptive  term, to tag all patients with the same disease, identically.  This then makes the data sub-setable and machine-readable.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>Look at the final row of data in Figure 2.1.  There is a missing disease type.  What problems might this cause?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>This isn’t a metadata problem, but it is worth mentioning that missing data can cause more ambiguity.  Does the blank mean the data were not available, or that the data were available but not recorded, or that the individual has no disease? This has implications on how the data are interpreted, and it is likely this data row would be discarded from an analysis.  Here you would be looking to use terms to denote missing, for example, “no disease”, “not recorded”.</p>\n\n  </blockquote>\n</blockquote>\n\n<h1 id=\"writing-fair-metadata\">Writing FAIR metadata</h1>\n\n<p>We have discussed already how rich metadata enables a dataset to be reused and interpreted correctly.  In the context of the FAIR principles, the previous exercise illustrates two of these, namely that <em>“(Meta)data are richly described with a plurality of accurate and relevant attributes”</em> (FAIR Principle R1) and that <em>“(Meta)data are associated with detailed provenance”</em> (FAIR Principle R1,2).  Further to this, the suggested use of the published <span class=\"citation\"><a href=\"#diseaseontology\">Ontology</a></span> for data, illustrates a further three principles, where <em>“(Meta)data use <strong>vocabularies</strong>,Vocabularies: (or controlled vocabulary) is a dictionary of terms you can use when producing (meta)data, that follow FAIR principles”</em> (FAIR Principle I2), and _“(Meta)data meet domain-relevant <strong>community standards</strong>, Community standards: standard guidelines used to structure and exchange data, usually supported by community-developed resources and/or software, (FAIR Principle R1.3). The use of hyperlinks specifically to terms in the ontology means that Metadata includes <em>qualified references</em>, Qualified references: terms used to describe relationships to pieces of (meta)data. , to other Metadata (FAIR Principle I3).   From the previous exercise, the <a href=\"https://disease-ontology.org/\">disease ontology</a> provides the vocabulary for the different types of diabetes: type 1 diabetes mellits <span class=\"citation\"><a href=\"#diseaseontology\">Ontology</a></span> and type 2 diabetes mellitus <span class=\"citation\"><a href=\"#diseaseontology\">Ontology</a></span>.</p>\n\n<p>The FAIR Guiding Principles also highlight the importance of providing rich metadata to enable researchers to <strong>find</strong> datasets such that <em>“Data are described with rich metadata”</em> (FAIR Principle F2).  More often than not, a researcher will find data through searching its metadata, usually via an online or a database search.  Information on how this can be achieved is discussed in the next episode on data registration.</p>\n\n<p>The use of vocabularies and cross-references is fundamental to data interoperability.  Interoperable (meta)data can be linked and combined across studies, aided by consistent,  compatible and machine-readable curation.  <a href=\"https://fairsharing.org/search?fairsharingRegistry=Standard\">FAIRsharing</a> is a useful registry of vocabularies, and standards, while more comprehensive ontology lists are maintained by <a href=\"https://www.ebi.ac.uk/ols/index\">OLS (Ontology Lookup Service)</a> and <a href=\"https://bioportal.bioontology.org/\">BioPortal</a>.</p>\n\n<p>The previous exercise also touches on <strong>machine-readability</strong>, Machine-readable: (meta)data is supplied in a structured format that can be read by a computer, of (meta)data through mention of using controlled terms in the “DISEASE TYPE” column to allow subsetting.  The <a href=\"https://opendatahandbook.org/glossary/en/terms/machine-readable/\">Open Data handbook</a> gives a nice overview of machine-readable (meta)data but in short, it is (meta)data supplied in a defined and structured format that can easily be read by an appropriate script or piece of software.  If we use our example of a spreadsheet in comma-separated value form (CSV format), the (meta)data will be organised into cells, in a format that is interoperable with many software.  This would not be true if the same data were made available as a screenshot, highlighting that human-readable data may not be machine-readable.</p>\n\n<h1 id=\"rich-metadata-in-public-data-repositories\">Rich metadata in public data repositories</h1>\n\n<p>Help with rich metadata curation is often supported by public data repositories, and data deposition is one way you can improve its level of FAIRness.  During submission, metadata is composed and linked, making it understood, accessible and searchable.</p>\n\n<p>The figure below shows a screenshot of a dataset hosted by the <a href=\"https://www.ebi.ac.uk/biostudies/\">BioStudies</a> (Figure 2.2).  BioStudies is a public database holding descriptions for biological studies and their (meta)data, and is often used by researchers to provide <strong>primary identifiers</strong> to supplementary information described in publications.</p>\n\n<figure id=\"figure-2\" style=\"max-width: 90%;\"><img src=\"../../images/figure2-2_rnaseq-database.png\" alt=\"A screenshot of a plant RNAseq dataset housed in BioStudies showing rich metadata like accession, study type, publication, etc.\" width=\"1914\" height=\"2062\" loading=\"lazy\" /><a target=\"_blank\" href=\"../../images/figure2-2_rnaseq-database.png\" rel=\"noopener noreferrer\"><small>Open image in new tab</small></a><br /><br /><figcaption><span class=\"figcaption-prefix\"><strong>Figure 2</strong>:</span> A FAIR dataset in a public repository <span class=\"citation\"><a href=\"#RubénSchlaen\">Schlaen <i>et al.</i> 2020</a></span></figcaption></figure>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>Look at the example given in Figure 2.2. What metadata is given?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p>Metadata can be categorised into 3 basic types (i) descriptive (what the data is); (ii) structural (how the data was generated, i.e. provenance); (iii) administrative (data owners, contributors and funders).  In this example, all 3 are given. <br /> <strong>Administrative metadata</strong>: authors and organisations underneath the dataset title, and the information in “Publication” <br /> <strong>Structural metadata</strong>: “Protocols” and data links on the right-hand side of the page <br />  <strong>Descriptive metadata</strong>: All other metadata on the left-hand side of the page, describing the study type through to “Samples” and “Assays and Data”.  Of note here is the use of controlled vocabularies for metadata such as Organism (<a href=\"https://www.ncbi.nlm.nih.gov/taxonomy\">taxonomy database</a>) and BioStudy-specific terms for fields such as Experimental Factors, Technology.  These allow a researcher to search for all experiments in the database around a theme or type: with queries of the type: “get me all Arabidopsis RNAseq data”.<br /></p>\n\n  </blockquote>\n</blockquote>\n\n<h1 id=\"using-community-standards-for-metadata\">Using community standards for (meta)data</h1>\n<p>Public databases often serve communities and specific types of data, and may often use community standards for metadata curation.  These standards include, usually,  open-access <strong>ontologies</strong> that can be used by researchers to annotate their (meta)data.  The <a href=\"https://fairsharing.org/search?fairsharingRegistry=Standard\">FAIRsharing</a> initiative provides a curated, searchable resource to help find many of these.  The <a href=\"https://disease-ontology.org/\">disease ontology</a> we have mentioned already in the first exercise has its <a href=\"https://fairsharing.org/FAIRsharing.8b6wfq\">own page</a> in FAIRsharing.\nAnother useful resource serving the data needs of specific communities is <a href=\"https://rdmkit.elixir-europe.org/\">RDMkit</a>.  RDMkit is an online research data management toolkit for Life Sciences, and as part of its product hosts pages for domain-specific best practices and guidelines.  <a href=\"https://rdmkit.elixir-europe.org/your_domain\">Domain pages</a> signpost detail and promote relevant considerations, tools and resources.</p>\n\n<blockquote class=\"question\">\n  <question-title></question-title>\n\n  <p>Familiarise yourself with the <a href=\"https://rdmkit.elixir-europe.org/bioimaging_data\">Bioimaging data</a> domain page on RDMkit.  Read the section on “Standard (meta)data formats” about a third of the way down. <br /> What 3 URLs are given to help a researcher gather appropriate metadata for their images?</p>\n\n  <blockquote class=\"solution\">\n    <solution-title></solution-title>\n\n    <p><a href=\"https://docs.openmicroscopy.org/ome-model/6.3.1/\">OME model</a> XML-based representation of microscopy data. <br /> <a href=\"https://quarep.org/\">Quality assessment working groups</a> <br /> REMBI <span class=\"citation\"><a href=\"#Sarkans2021\">Sarkans <i>et al.</i> 2021</a></span> <br /></p>\n\n  </blockquote>\n</blockquote>\n\n<h1 id=\"useful-resources\">Useful resources</h1>\n<ul>\n  <li>More about Metadata: <a href=\"https://rdmkit.elixir-europe.org/metadata_management\">RDMkit</a>, <a href=\"https://faircookbook.elixir-europe.org/content/recipes/introduction/metadata-fair.html\">FAIR Cookbook</a></li>\n  <li>Definition of Machine readability: <a href=\"https://www.rd-alliance.org/groups/long-tail-research-data-ig/wiki/enable-machine-readability.html\">Research Data Alliance (RDA)</a></li>\n  <li>Definition of Qualified identifiers: <a href=\"https://www.go-fair.org/fair-principles/i3-metadata-include-qualified-references-metadata/\">GO FAIR</a></li>\n  <li>More about Data licensing: <a href=\"https://rdmkit.elixir-europe.org/licensing\">RDMkit</a>,<a href=\"https://faircookbook.elixir-europe.org/content/recipes/reusability/ATI-licensing.html\"> FAIR Cookbook</a></li>\n  <li>Definition of Metadata community standards: <a href=\"https://fair-dom.org/community_standards\">FAIRDOM</a></li>\n  <li>Registry of FAIR metadata standards: <a href=\"https://fairsharing.org/search?fairsharingRegistry=Standard\">FAIRsharing</a></li>\n  <li>Making interoperable metadata: <a href=\"https://carpentries-incubator.github.io/fair-bio-practice/06-being-precise/index.html\">Ed-DaSH</a>, <a href=\"https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1009041\">Ten simple rules for making a vocabulary FAIR</a>,<br /> <a href=\"https://eosc-portal.eu/sites/default/files/Final-D4.4%20Guidelines%20for%20RIs%20to%20enable%20discoverability%20of%20research%20data-pdf.pdf\">EOSC Guidelines for research institutes to enable discoverability of research data</a></li>\n  <li>Useful metadata projects and tools: <a href=\"https://www.dublincore.org/specifications/dublin-core/dcmi-terms/\">Dublin Core</a>, <a href=\"https://isa-tools.org/index.html\">ISA framework</a>, <a href=\"https://f1000research.com/articles/9-495\">COPO</a></li>\n</ul>\n"],"ref_slides":[],"hands_on":true,"slides":false,"mod_date":"2024-03-26 14:35:58 +0000","pub_date":"2024-03-26 08:27:31 +0000","version":18,"api":"https://training.galaxyproject.org/training-material/api/topics/fair/tutorials/fair-metadata/tutorial.json","tools":[],"supported_servers":{"exact":[],"inexact":[{"name":"UseGalaxy.eu","url":"https://usegalaxy.eu","id":"eu","human":"Galaxy Europe","usegalaxy":true},{"name":"UseGalaxy.org","url":"https://usegalaxy.org","id":"us","human":"Galaxy Main","usegalaxy":true},{"name":"UseGalaxy.org.au","url":"https://usegalaxy.org.au","id":"au","human":"Galaxy Australia","usegalaxy":true},{"name":"UseGalaxy.fr","url":"https://usegalaxy.fr","id":"fr","human":"Galaxy France","usegalaxy":true}]},"topic_name_human":"FAIR Data, Workflows, and Research","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial","contributors":[{"name":"Robert Andrews","email":"andrewsr9@cardiff.ac.uk","orcid":"0000-0002-3491-2361","joined":"2021-10","elixir_node":"uk","affiliations":["elixir-europe"],"id":"robertmand","url":"https://training.galaxyproject.org/training-material/api/contributors/robertmand.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/robertmand/"},{"name":"Nick Juty","orcid":"0000-0002-2036-8350","joined":"2024-04","id":"nsjuty","url":"https://training.galaxyproject.org/training-material/api/contributors/nsjuty.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/nsjuty/"},{"name":"Munazah Andrabi","joined":"2023-09","orcid":"0000-0002-7718-5109","id":"smza","url":"https://training.galaxyproject.org/training-material/api/contributors/smza.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/smza/"},{"name":"Nicola Soranzo","matrix":"nsoranzo:matrix.org","orcid":"0000-0003-3627-5340","twitter":"NicolaSoranzo","joined":"2017-09","elixir_node":"uk","fediverse":"https://mstdn.science/@nsoranzo","fediverse_flavor":"mastodon","linkedin":"nicola-soranzo-7884125","affiliations":["earlham","elixir-europe"],"id":"nsoranzo","url":"https://training.galaxyproject.org/training-material/api/contributors/nsoranzo.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/nsoranzo/"},{"name":"Sara Morsy","joined":"2021-10","orcid":"0000-0002-2477-1139","elixir_node":"uk","id":"saramorsy","url":"https://training.galaxyproject.org/training-material/api/contributors/saramorsy.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/saramorsy/"},{"name":"Kellie Snow","joined":"2024-03","id":"kellsnow","url":"https://training.galaxyproject.org/training-material/api/contributors/kellsnow.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/kellsnow/"},{"github":false,"name":"Korneel Hens","joined":"2024-03","id":"khens","url":"https://training.galaxyproject.org/training-material/api/contributors/khens.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/khens/"},{"name":"Philippe Rocca-Serra","joined":"2024-03","orcid":"0000-0001-9853-5668","elixir_node":"uk","affiliations":["elixir-europe"],"id":"proccaserra","url":"https://training.galaxyproject.org/training-material/api/contributors/proccaserra.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/proccaserra/"},{"name":"Laura Cooper","joined":"2024-03","github":false,"id":"lcooper","url":"https://training.galaxyproject.org/training-material/api/contributors/lcooper.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/lcooper/"},{"name":"Xenia Perez Sitja","joined":"2024-03","orcid":"0000-0002-7166-0183","elixir_node":"uk","affiliations":["elixir-europe"],"id":"sitjart","url":"https://training.galaxyproject.org/training-material/api/contributors/sitjart.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/sitjart/"},{"name":"Andrew Mason","joined":"2024-02","orcid":"0000-0002-8222-3974","elixir_node":"uk","id":"asmasonomics","url":"https://training.galaxyproject.org/training-material/api/contributors/asmasonomics.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/asmasonomics/"},{"name":"Branka Franicevic","joined":"2021-10","orcid":"0000-0002-3440-6581","elixir_node":"uk","affiliations":["elixir-europe"],"id":"bfranicevic","url":"https://training.galaxyproject.org/training-material/api/contributors/bfranicevic.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/bfranicevic/"},{"name":"Saskia Lawson-Tovey","joined":"2024-03","orcid":"0000-0002-8611-162X","id":"saskia-lawson-tovey","url":"https://training.galaxyproject.org/training-material/api/contributors/saskia-lawson-tovey.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/saskia-lawson-tovey/"},{"name":"Katarzyna Kamieniecka","twitter":"katemurat","orcid":"0009-0004-2454-5950","joined":"2018-08","elixir_node":"uk","affiliations":["elixir-europe"],"id":"kkamieniecka","url":"https://training.galaxyproject.org/training-material/api/contributors/kkamieniecka.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/kkamieniecka/"},{"name":"Khaled Jum’ah","email":"k.jumah@bradford.ac.uk","orcid":"0000-0001-5481-8893","joined":"2022-09","elixir_node":"uk","affiliations":["elixir-europe"],"id":"khaled196","url":"https://training.galaxyproject.org/training-material/api/contributors/khaled196.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/khaled196/"},{"name":"Krzysztof Poterlowicz","twitter":"bioinfbrad","orcid":"0000-0001-6173-5674","joined":"2017-09","elixir_node":"uk","affiliations":["elixir-europe"],"id":"poterlowicz-lab","url":"https://training.galaxyproject.org/training-material/api/contributors/poterlowicz-lab.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/poterlowicz-lab/"},{"name":"DASH UK","joined":"2023-10","github":false,"avatar":"/training-material/shared/images/dash.png","url":"https://training.galaxyproject.org/training-material/api/funders/elixir-uk-dash.json","funder":true,"funding_system":"ukri","funding_id":"MR/V038966/1","funding_statement":"This Fellowship was funded through the ELIXIR-UK DaSH project as part of the UKRI Innovation Scholars: Data Science Training in Health and Bioscience call (DaSH). (MR/V038966/1). The project aims to embed Research Data Management (RDM) know-how into UK universities and institutes by producing and delivering training in FAIR data stewardship using ELIXIR-UK knowledge and resources.","id":"elixir-uk-dash","page":"https://training.galaxyproject.org/training-material/hall-of-fame/elixir-uk-dash/"}]}