{"layout":"tutorial_slides","logo":"shared/images/biocommons-utas.png","title":"Phylogenetics - Back to Basics - Multiple Sequence Alignment","zenodo_link":"","subtopic":"phylogenetics","priority":3,"contributors":["mcharleston"],"js_requirements":{"mathjax":14973,"mermaid":false},"short_id":"S00118","url":"/topics/evolution/tutorials/abc_intro_phylo-msa/slides.html","topic_name":"evolution","tutorial_name":"abc_intro_phylo-msa","dir":"topics/evolution/tutorials/abc_intro_phylo-msa","symlink":null,"id":"evolution/abc_intro_phylo-msa","ref_tutorials":[],"ref_slides":["# Motivation\n<br>\n<br>\nWe use sequence alignment to:\n<br>\n<br>\n- identify complex relationships among multiple species - more than just pairwise comparisons;\n- find homologous parts (sites / loci) in sequences that may be under different selection dynamics;\n- and to build phylogenetic trees!\n\n<br>\n<br>\n<b>Multiple sequence alignment (MSA) is a required step in molecular phylogenetics</b>\n---\n\n# Sequence Alignment\n<br>\n<br>\n.left[One of the best understood and best solved bioinformatics problem is *how to align two sequences*.]\n<br>      \n.left[In order to do this we need to know:]\n<br>\n1.  what an \"alignment\" really means;\n<br>\n2.  how to judge how good an alignment is;\n<br>\n3.  an algorithm to do the alignment.\n---\n\n# What is an alignment?\n<br> \nGiven two sequences like **GGGCTGAA** and **GGGACTG** \"an alignment\" is a _mapping_ of their positions (a.k.a. \"sites\") to a common ordering, by inserting gaps in one sequence or another:\n<br> \n<br> \n![Alignment of two DNA sequences GGGACTG and GGCTGAA. In the alignment gaps, indicated by -, are added to the sequences to form GGGACTG-- and -GG-CTGAA so that homologous sites are aligned at positions 2, 3, 5, 6, 7. ](images/03-msa-01-what-is-an-alignment.pdf-1.png)</p>\n---\n# Alignments represent homology\n<br>\n<br>\n     \n<p>Our goal with sequence alignment is to identify which regions, down to individual positions in a molecular sequence, are homologous: that is, their shared evolutionary history is the same as that of the taxa of interest.</p>\n<br> \n\n<p>It's like tracing the origin of a set of transcribed documents through all their copies back to the original, where each was only copied (with maybe some mistakes) from one predecessor.</p>\n<br> \n<p>Once we have identified homologous sites then we can analyse their differences and similarities under an evolutionary model - a crucial centrepiece of phylogenetic analysis, and in fact of all comparative analysis of molecular sequences.</p>\n---\n\n# Sequences evolve on a tree\n<br>\n<br>\n![Schematic example of a phylogenetic tree where species are represented by short DNA sequences to demonstrate how sequences evolve on a tree. The tree branches multiple times from a common ancestor to five extant taxa.](images/03-msa-02-a-tree-only.pdf-1.png)\n---\n\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. An A to G substitution is highlighted in the first branching event.](images/03-msa-02-b.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. A deletion of a T is highlighted in the first branching event.](images/03-msa-02-c-deleteT.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. An insertion of TT is highlighted in one of the branches.](images/03-msa-02-d-insertTT.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. An A to G substitution is highlighted in one of the branches.](images/03-msa-02-e-AtoG.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. An insertion of a T is highlighted in one of the branches.](images/03-msa-02-f-insertT.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. Two T to G substitutions have occurred on one branch.](images/03-msa-02-g-2xTtoG.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. A C to A substitution has occurred on one branch.](images/03-msa-02-h-CtoA.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. A deletion of a T has occurred on one branch.](images/03-msa-02-i-deleteT.pdf-1.png)\n---\n# Sequences evolve on a tree\n<br>\n<br>\n![A schematic of a phylogenetic tree showing the evolution of different DNA sequences from a common ancestral sequence. An A to C substitution has occurred on one branch.](images/03-msa-02-j-AtoC.pdf-1.png)\n---\n# Let's align these\n<br>\n<br>\nGaps don't remain in the history so we only have\n<br>\n<br>\n.image-50[ ![Five unaligned DNA sequences are arranged vertically. Nucleotides are colour coded G = orange, C = blue, A = green, T = pink](images/03-msa-03-a-unaligned.pdf-1.png) ]\n---\n# A good alignment\n<br>\n<br>\nThis alignment reflects truth\n<br>\n<br>\n.image-50[ ![A possible alignment of five DNA sequences arranged vertically. Gaps have been introduced to align homologous sites. Nucleotides are colour coded G = orange, C = blue, A = green, T = pink](images/03-msa-03-b-truth.pdf-1.png) ]\n---\n# Although...\n<br>\n<br>\n         \nBut this alignment also looks \"good\" (?)\n<br>\n<br>\n.image-50[ ![A possible alignment of five DNA sequences arranged vertically. Gaps have been introduced to align homologous sites. Nucleotides are colour coded G = orange, C = blue, A = green, T = pink](images/03-msa-03-c-good1.pdf-1.png) ]\n\n---\n\n# Although...\n<br>\n<br>\n        \nAnd so does this\n<br>\n<br>\n.image-50[ ![A possible alignment of five DNA sequences arranged vertically. Gaps have been introduced to align homologous sites. Nucleotides are colour coded G = orange, C = blue, A = green, T = pink](images/03-msa-03-d-good2.pdf-1.png) ]\n\n---\n\n# This is nonsensical\n<br>\nOnly matches and indels! Win?\n<br>\n<br>\n.image-50[ ![A possible alignment of five DNA sequences arranged vertically. Gaps have been introduced to align homologous sites. Nucleotides are colour coded G = orange, C = blue, A = green, T = pink](images/03-msa-03-e-nonsense.pdf-1.png) ]\n<br>\n<br>\nHere, the indels do not make sense as having come from the same phylogenetic history.\n\n---\n\n# Fixing errors\n<br>\n<br>\n![A possible alignment of six DNA sequences arranged vertically drawing attention to a position, 1, where gaps have been introduced in nearly all sequences and, 2, gaps are not aligned but could be.](images/03-msa-04-a-fixingerrors-badly.pdf-1.png)\n\nAt 1 a gap has been inserted in EVERY sequence.\n\n---\n\n# Fixing errors\n<br>\n<br>\n![A possible alignment of six DNA sequences arranged vertically drawing attention to a position, 1, where gaps have been introduced in nearly all sequences and, 2, gaps are not aligned but could be.](images/03-msa-04-a-fixingerrors-badly.pdf-1.png)\n\nAt 2 the gaps don't line up, but they *could*.\n\n---\n\n# Fixing errors\n<br>\n<br>\n![A possible alignment of six DNA sequences arranged vertically drawing attention to a position 1 where gaps have been removed to improve alignment at position 2.](images/03-msa-04-b-fixingerrors-well.pdf-1.png)\n\n        \nThis fixes both problems.\n\n---\n\n# Rating alignments\n<br>\nThis can be a bit of an art.\n<br>\n.left[You need to:]\n\n-   balance the number of gaps with number of mismatches\n\n-   notice when there are insertions / deletions that don't make sense, where there are alternative arrangements that do\n\n---\n\n# Pair-wise Alignment\n<br>\n<br>\n.center[*Dynamic Programming Approach*]\n\n---\n\n# Sequence Similarity\n<br>\n<br>\nTo do any kind of comparison we need a distance or similarity measure.\n<br>\nWithout it we can't say whether, e.g., *these* two species are more similar than *those* two.\n<br>\n-   **Sequence Dissimilarity**\n    -   Two main methods first: Hamming and *p*-distances, counting the number or proportion of differences between sequences\n-   **Edit cost**\n    -   a measure of the amount of evolutionary \"work\" that has to be done to change one character state into another one\n-   **Likelihood**\n    -   under a specific model of evolution, what is the probability that we would observe these sequences?\n\n---\n\n# Hamming Distance\n<br>\nThe *Hamming* distance between two sequences is just the number of differences between them.\n<br>\nIt makes no distinction between substitutions or insertions/deletions, and not between transitions and transversions.\n<br>\n<br>\n.image-40[ ![An alignment of two DNA sequences. Positions that are not homologous are indicated by an asterisk and assigned the value 1.](images/03-msa-05-hamming-distance.pdf-1.png) ]\n\nSequence length: 20\n<p>Number of differences: 5</p>\n\n<p>Hamming Distance = 5</p>\n<p>P-distance = 5/20 = 0.25 or 25%</p>\n---\n\n# Edit Cost\n<br>\n<br>\nWe use a matrix of costs to describe how much evolutionary \"work\" must be done to convert one character to another.\n<br>\n<br>\n.pull-left[\n\nThis is the *Edit cost matrix*.\n\n|-|A|C|G|T|-|\n|------|--------------------|\n|**A**|0|1|2|1|5|\n|**C**|1|0|1|2|5|\n|**G**|2|1|0|1|5|\n|**T**|1|2|1|0|5|\n|**-**|5|5|5|5|n/a|\n]\n.pull-right[\n\n\n<p>.image-75[\n    ![An alignment of two DNA sequences. Positions that are not homologous are indicated by an asterisk and assigned the values 1, 2 or 5.](images/03-msa-06-edit-distance.pdf-1.png)\n]</p>\n<p>Complete edit-cost = 1 + 1 + 2 + 1 + 5 = 10</p>\n]\n<br>\n\n\n\n<br>\nUsing edit costs we can describe better the relationships between sequences: for example it's less common for an  *A*  to change to a *G* in the above than for an *A* to change to a *T*, in turn less common than for an *A* to remain as an *A*.\n--\n\nAlso note we have introduced a bigger cost for aligning any nucleotide with a gap, reflecting our believe that insertion/deletion events are less common than substitutions.\n\n---\n# What price a gap?\n<br>\n<br>\nThere are two basic methods for assigning a cost *c* to a gap of length *g* in a sequence.\n<br>\n<br>\n**Linear cost**: \\\\(c = -dg\\\\)\n    where \\\\(d\\\\) is the _gap open penalty_;\n<br>\n<br>\n**Affine cost**: \\\\(c = -d - (g-1)e\\\\)\n    where \\\\(e\\\\) is the _gap extension penalty_.\n<br>\n<br>\nTypical values are \\\\(d = 10, e = 0.1\\\\).\n<br>\n<br>\nThe affine gap cost method is the most complex method we can use in order to solve the alignment of two sequences quickly.\n<br>\n<br>\nMore complex models prohibit the use of dynamic programming to solve the alignment (and must use _heuristics_).\n\n---\n# Numbers of alignments\n\nFor two sequences of length \\\\(x\\\\) and \\\\(y\\\\), there are \\\\(\\frac{(x+y)!}{x!\\ y!}\\\\) possible alignments.\n<br>\nFor three sequences, of length \\\\(x\\\\), \\\\(y\\\\) and \\\\(z\\\\) say, there are \\\\(\\frac{(x+y+z)!}{x!\\ y!\\ z!}\\\\) alignments.\n<br>\nFor \\\\(n\\\\) sequences of length 10, this increases rapidly:\n\n| n   | Hash alignments  |\n|-----|------------------|\n| 2   | 184756           |\n| 3   | 5.55 × 10^12     |\n| 4   | 4.71 × 10^21     |\n| 5   | 4.83 × 10^31     |\n| 6   | 3.64 × 10^42     |\n| 7   | 1.45 × 10^54     |\n| 8   | 2.38 × 10^66     |\n| 9   | 4.94 × 10^85     |\n| 10  | 2.35 × 10^92     |\n\n\n<br>\nIn general it is not possible - even with really fast computers - to guarantee optimal multiple alignments, even with simple costing schemes.\n---\n# Dynamic Programming\n<br>\n<br>\n.left[Dynamic Programming (DP) is a common method to solve many types of problems, including pairwise sequence alignment. ]\n<br>\n-   Solves local problems optimally\n-   Amalgamates these into globally optimal complete solutions\n-   \"Fast\"\n---\n# DP overview\n<br>\n<br>\nDynamic Programming solves problems by breaking them down recursively into (slightly) smaller problems.\n\n![Schematic representation of dynamic programming showing how the process solves a problem by breaking it down and finding optimal partial solutions that can be used to infer the full solution.](images/DPOverviewDiagram.png)\n\nIn terms of sequence alignment, this comes down to basing alignment of two sequences up to positions *i* and *j* in terms of the best alignments yet found for the two sequences, up to positions \\\\(i-1,j-10\\\\), \\\\(i,j-1\\\\), and \\\\(i-1,j\\\\).\n---\n#DP overview (cont.)\n<br>\n<br>\n![Schematic representation of how alignment of two DNA sequences progresses. Three scenarios are shown: 1. both sequences are identical 2. the sequences differ and a gap is introduced in the top sequence 3. the sequences differ and a gap is introduced in the bottom sequence.](images/03-msa-10-advancing-seqs.pdf-1.png)\n\n---\n# Dynamic Programming alignment\n\n1. Array two sequences along the top and left sides of a cost matrix.\n2. Fill in the cells of the matrix from top-left to bottom right.\n    At each stage find the minimum cost sub-alignment and add to it:\n   <p>2.1 Find the maximum score from the previous cells including gap costs;</p> \n   <p>2.2 Put the result into this new cell;</p> \n   <p>2.3 Note which cell we chose with a pointer or reference.</p> \n<br>\n\n.image-25[ ![Schematic of the dynamic programming alignment described on the slide](images/03-DPcell.png) ]\n\n\nWe add the cost of the best solution to the previous cells (above, to the left and above-left) to the best possible score for this cell.\n\n---\n\n#Alignment example\n<br>\n<br>\nWe will align two amino acid sequences next:\n<br>\n<br>\nInput sequences:\n<br>\n<br>\n.center[\n| x   | HEAGAWGHEE |\n|---|---|\n| **y**   | **PAWHEAE**    |\n]\n\n---\n# Filling in the cost matrix\n<br>\n<br>\nEdit costs for these two sequences:\n<br>\n\n|      | H  | E  | A  | G  | A  | W  | G  | H  | E  | E  |\n|------|----|----|----|----|----|----|----|----|----|----|\n| **P**    | -2 | -1 | -1 | -2 | -1 | -4 | -2 | -2 | -1 | -1 |\n| **A**    | -2 | -1 | 5  | 0  | 5  | -3 | 0  | -2 | -1 | -1 |\n| **W**    | -3 | -3 | -3 | -3 | -3 | 15 | -3 | -3 | -3 | -3 |\n| **H**    | 10 |  0 | -2 | -2 | -2 | -3 | -2 | 10 | 0  | 0  |\n| **E**    |  0 |  6 | -1 | -3 | -1 | -3 | -3 | 0  | 6  | 6  |\n| **A**    | -2 | -1 | 5  | 0  | 5  | -3 | 0  | -2 | -1 | -1 |\n| **E**    |  0 | -6 | -1 | -3 | -1 | -3 | -3 | 0  | 6  | 6  |\n\n---\n# Dynamic Programming: fill in\n<br>\n<br>\n![Cost matrix of possible alignments of the amino acid sequences HEAGAWGHEE on the x-axis and PAWHEAE on the y axis. Arrows indicate the direction taken to reach each score.](images/03-msa-08-a-DP-forward.pdf-1.png)\n---\n\n# Dynamic Programming: backtrack\n<br>\n<br>\n![Cost matrix of possible alignments of the amino acid sequences HEAGAWGHEE on the x-axis and PAWHEAE on the y axis. The optimal alignment is indicated in red. Arrows indicate the direction taken to reach each score.](images/03-msa-08-b-DP-backtrack.pdf-1.png)\n\n---\n#  Alignments are paths in the table\n<br>\n<br>\n![Cost matrix of possible alignments of the amino acid sequences HEAGAWGHEE on the x-axis and PAWHEAE on the y axis. Arrows indicate the direction taken to reach this alignment.](images/03-msa-09-alignments-are-paths.pdf-1.png)\n---\n# Conclusion of simple alignment\n<br>\n<br>\nAligned sequences:\n<br>\n<br>\n\n|         |     |     |     |     |     |    |     |     |     |     |     |\n|---------|-----|-----|-----|-----|-----|-----|-----|-----|-----|-----|-----|\n| $$s\\_{1}$$ | H | E | A | G | A | W | G | H | E | - | E |\n| $$s\\_{2}$$ | - | - | P | - | A | W | - | H | E | A | E |\n|         | -5  | -5  | -1  | -5  | +5  | +15 | -5  | +10 | +6  | -5  | +6  |\n\n<br>\n<br>\nTotal cost = 16\n\n---\n# Generalising this approach\n<br>\n<br>\nWithout too much effort it is possible to generalise this approach:\n<br>\n<br>\n**Needleman-Wunsch** is used for _local_ alignment;\n<br>\n<br>\n**Smith-Waterman** is used for _global_ alignment;\n<br>\n<br>\n**longest match** can be found by setting high match costs and large negative mis-match and gap costs;\n<br>\n<br>\n**BLAST** uses this system once good patching pairs have been found;\n<br>\n<br>\n**Affine gap scores** as mentioned, accounting for gap opening and gap extension penalties to differ.\n\n---\n#Properties of DP Pairwise Alignment\n<br>\n<br>\n-   Pairwise Sequence Alignment takes an amount of *time* that is proportional to the number of cells in the table, which is roughly the product of the lengths of the two sequences.\n\n    That means it is \\\\(O(nm)\\\\) if the lengths of the sequences are \\\\(n\\\\) and \\\\(m\\\\); usually as these are about the same we can write \\\\(O(n^{2})\\\\): it's *quadratic in sequence length*.\n\n-   The amount of space required is also quadratic in \\\\(n\\\\).\n    There is a linear-space version of the DP method (which is rarely used as it takes longer).\n\n-   This solution is globally optimal. It will always produce an optimal alignment, though there may be more than one.\n\n-   With more sequences, the size of the table increase:\n    For \\\\(k\\\\) sequences the algorithm is \\\\(O(n^{k})\\\\): not practical.\n\n---\n\n# Multiple Sequence Alignment: Aligning groups of sequences using heuristics\n<br>\n<br>\n.center[*Aligning multiple sequences*]\n---\n#Aligning multiple sequences\n<br>\n<br>\nWe cannot check all possible alignments (there are simply too many), so we must use make a compromise.\n<br>\n<br>\nWe will use pairwise alignment (which is easy) and build up a multiple sequence alignment from pairs of sequences.\n<br>\n<br>\nThese *heuristic* methods are used in Clustal, GCG and others.\n---\n# Progressive Alignment\n<br>\n<br>\n.left[The process is quite simple:]\n\n1.  Align all pairs of sequences using DP (dynamic programming).\n2.  Create a distance matrix based on the alignments.\n3.  Form a *guide tree* from the distance matrix. This is not the same as a phylogenetic tree, nor should it be interpreted as one!\n4.  Progressively align the pairs of sequences with DP, creating summary (consensus) sequences as we go.\n---\n# MAFFT, Muscle, T-COFFEE, k-align\n<br>\n<br>\n- Clustal is not that great to be honest\n- Other very good automatic alignment methods exist, such as Muscle, T-Coffee, k-align, di-align.\n- My current favourites are Muscle and MAFFT.\n\n---\n# MAFFT\n<br>\n<br>\n     \n\"MAFFT offers various multiple alignment strategies. They are classified into three types, (a) the progressive method, (b) the iterative refinement method with the WSP score, and (c) the iterative refinement method using both the WSP and consistency scores. In general, there is a tradeoff between speed and accuracy. The order of speed is a > b > c, whereas the order of accuracy is a < b < c. The results of benchmarks can be seen here. The following are the detailed procedures for the major options of MAFFT.\"\n<br>\n<br>\n<br>\n<br>\n<br>\nSource: MAFFT is available at https://mafft.cbrc.jp/; first paper 10.1093/nar/gkf436\n\n---\n# MAFFT algorithms overview\n<br>\n<br>\n![Flow chart giving an overview of algorithms used by the program MAFFT to convert distance matrices into alignments. The flow chart is described in the video recording at 37:52.](images/03-msa-11-MAFFT-1.png)\n---\n\n# *Anolis* example\n<br>\n<br>\n![Screenshot from the program SeeView showing a multiple sequence alignment of Anolis species. DNA sequences are aligned vertically and nucleotides are colour coded. Aligned sites can be identified by solid lines of colour that run from top to bottom of the image. Full description included in the video recording at 40:06.](images/AnolisPartialAlignment2.png)\n\nAround site 982-990 there is a 2 bp gap in all sequences.\n\n---\n# *Anolis* example\n<br>\n<br>\n![Screenshot from the program SeeView showing a multiple sequence alignment of Anolis species. DNA sequences are aligned vertically and nucleotides are colour coded. Aligned sites can be identified by solid lines of colour that run from top to bottom of the image. Full description included in the video recording at 40:06.](images/AnolisPartialAlignmentGapsAligned.png)\n\nHere I have lined up these gaps: more substitutions? but makes sense.\n---\n\n# *Anolis* example\n<br>\n<br>\n![Screenshot from the program SeaView showing a multiple sequence alignment of Anolis species. DNA sequences are aligned vertically and nucleotides are colour coded. Aligned sites can be identified by solid lines of colour that run from top to bottom of the image. Full description included in the video recording at 40:06.](images/AnolisPartialAlignmentGapsAlignedTidied.png)\n\n\nWe can remove the gap-only sites now.  There's more to do!\n\n---\n# What's Next?\n<br>\n<br>\nOnce your sequences are properly aligned, they can be used for _phylogenetic analysis_.\n---\n# Thank you!\n<br>\n<br>\n.center[*Next: building trees from distances!*]\n\n---\n"],"hands_on":false,"slides":true,"mod_date":"2024-04-23 01:55:40 +0000","pub_date":"2024-05-10 11:23:12 +0000","version":17,"api":"https://training.galaxyproject.org/training-material/api/topics/evolution/tutorials/abc_intro_phylo-msa/tutorial.json","tools":[],"supported_servers":{"exact":[],"inexact":[{"name":"UseGalaxy.eu","url":"https://usegalaxy.eu","id":"eu","human":"Galaxy Europe","usegalaxy":true},{"name":"UseGalaxy.org","url":"https://usegalaxy.org","id":"us","human":"Galaxy Main","usegalaxy":true},{"name":"UseGalaxy.org.au","url":"https://usegalaxy.org.au","id":"au","human":"Galaxy Australia","usegalaxy":true},{"name":"UseGalaxy.fr","url":"https://usegalaxy.fr","id":"fr","human":"Galaxy France","usegalaxy":true}]},"topic_name_human":"Evolution","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"video":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":false},"license":"CC-BY-4.0","type":"tutorial","redirect_from":["/short/evolution/abc_intro_phylo-msa/slides","/short/S00118"]}