{"layout":"tutorial_slides","logo":"GTN","title":"An introduction to scRNA-seq data analysis","subtopic":"scintroduction","priority":1,"level":"Intermediate","video":true,"zenodo_link":"","redirect_from":["/topics/transcriptomics/tutorials/scrna-intro/slides","/short/single-cell/scrna-intro/slides","/short/S00084"],"tags":null,"questions":["How are samples compared?","How are cells captured?","How does bulk RNA-seq differ from scRNA-seq?","Why is clustering important?"],"objectives":["To understand the pitfalls in scRNA-seq sequencing and amplification, and how they are overcome.","Know the types of variation in an analysis and how to control for them.","Grasp what dimension reduction is, and how it might be performed.","Be familiarised with the main types of clustering techniques and when to use them."],"time_estimation":"30m","key_points":["scRNA-seq requires much pre-processing before analysis can be performed.","Groups of similarly profiled-cells are compared against other groups.","Detectability issues requires careful consideration at all stages.","Clustering is an integral part of an analysis."],"follow_up_training":[{"type":"internal","topic_name":"single-cell","tutorials":["scrna-preprocessing"]}],"contributors":["mtekman"],"recordings":[{"captioners":["mtekman"],"date":"2021-02-15","galaxy_version":"21.01","length":"20M","youtube_id":"D3qvYWZMFa0","speakers":["awspolly"]}],"js_requirements":{"mathjax":20144,"mermaid":false},"short_id":"S00084","url":"/topics/single-cell/tutorials/scrna-intro/slides.html","topic_name":"single-cell","tutorial_name":"scrna-intro","dir":"topics/single-cell/tutorials/scrna-intro","symlink":null,"id":"single-cell/scrna-intro","ref_tutorials":[],"ref_slides":["# Single-cell RNA-seq\n\nAn introduction to scRNA-seq data analysis\n\n???\n- Greetings everybody and welcome to the Galaxy single cell RNA-seq analysis workshop.\n- Here we will walk you through some of the basics and concepts when dealing with single cell data.\n\n---\n\n\n## Bulk RNA-Seq\n\n.pull-left[![Two blobs labelled tissue A and tissue B are shown, on the right they are summarised into tables of Gene A, B, and X and their different average expression per tissue.](../../images/scrna-intro/rna_cells_bulkrez.svg)]\n\n.pull-right[\n.reduce90[\n\n|Attribute| Summary |\n|-:|:-|\n|Resolution| Entire tissues |\n|Signal | Average gene expression per tissue |\n|Differential Expression | Difference between average gene expression between tissues |\n\n]\n]\n\n\n???\n- Let's start with what the differences are between Bulk RNA-seq and single cell RNA seq data.\n- With Bulk RNA-seq we compare two tissues by looking at the average expression of each gene detected across each of the tissues.\n- Due to the number of RNA molecules being considered, the sequencing depth and the strength of the analysis is reasonably high.\n- The differential expression is then measured as the relative expression of a given gene between one tissue and another.\n\n---\n\n## Single Cell RNA-Seq\n\n.pull-left[![Red and blue clusters of cells are shown resembling the tissue blob from the previous slide. Now the graphs on the right for expression in Genes A, B, X are shown per cell instead of per tissue.](../../images/scrna-intro/rna_cells_singlerez.svg)]\n\n.pull-right[\n.reduce90[\n\n|Attribute| Summary |\n|-:|:-|\n| Resolution| Individual cells within tissues |\n| Signal | Individual gene expression per cell |\n| Differential Expression | Some cells express the same set of genes in the same way; comparing one set of cells against another |\n\n]\n]\n\n\n???\n- With single cell RNA-seq analysis, the stage shifts away from measuring the average expression of a tissue.\n- And towards measuring the specific gene expression of individual cells within those tissues.\n- Here we are no longer comparing tissue against tissue, but cell against cell.\n- Each cell is assigned a gene profile which describes the relative abundance of genes detected within it.\n- Many cells share the same gene profile, where a gene profile ideally describes a cell type.\n- Sometimes we need to compare single-cell datasets across tissues, and we see that many cells across tissues share the same cell type.\n- For example, look at the purple and green gene profiles which are shared across both tissues.\n\n\n---\n\n# From Bulk RNA to Single Cell RNA\n\n.image-50[![Tissue A and B from the first slide are shown as the collections of cells from the second slide.](../../images/scrna-intro/rna_cells_bulk2single.svg)]\n\n.reduce90[\n* In order to quantify RNA at the level of individual cells:\n  * New methods of library preparation\n  * New methods of sequencing\n  * New methods of quality control\n  * New methods of analysis\n]\n\n???\n- New technologies means new methods and techniques to harness the new features that come with them.\n- Single-cell RNA-seq data requires different means of library preparation, sequencing, quality control and analysis.\n\n---\n\n# Cell Capture and Replicates\n\n.center[*How do we prepare samples for sequencing?*]\n\n???\nFor example, how are cells captured and sequenced?\n\n--\n\n.pull-left[\n.reduce90[\n\n__Bulk RNA-seq__\n\n  1. Cut a thin slice of a tissue\n  1. Add enzyme to break down cell walls\n  1. Rinse out the unwanted DNA / RNA material\n  1. Perform sequencing on leftover goop\n\n]\n]\n\n???\nIn bulk RNA-seq analysis, the process involves taking a sample, removing unwanted molecules and sequencing everything else.\n\n--\n\n.pull-left[\n.reduce90[\n\n__Single-cell RNA-seq__\n\n  1. Cut a thin slice of a tissue\n  1. Breakdown a tissue into cells\n  1. Isolate each cell\n     * Add enzyme to break down cell walls\n     * Perform barcoding\n  1. Perform sequencing in a common pool\n\n]\n]\n\n???\n- For single cell analysis, the process is much the same, except that each sample is a cell.\n- And must therefore be sequenced separately from other cells.\n- Once isolated, unique barcodes are added to each cell, and then sequenced.\n\n\n--\n\n__Biological Replicates__\n\n.center[\n.reduce90[\n\n|Type|Notes|\n|--------:|:-----------|\n| **Bulk RNA-seq** | Each tissue slice is a sample, can take another slice |\n| **Single-cell RNA-seq** | Each cell is sample, cannot directly replicate because unique |\n\n]\n]\n\n???\n- The level of resolution in single-cell is at the cell level, and each cell is unique.\n- Therefore, the concept biological replicates is not quite the same as that in bulk RNA-seq.\n\n\n---\n\n# Capture / Sorting:\n\n*How are cells isolated?*\n\n\n???\nCell isolation can be performed in different ways.\n\n--\n\n.pull-right[.image-90[![A black and white image of a woman in the lab using her mouth to pipette cells from one test tube to another.](../../images/scrna-intro/mouthpipette.jpg)]]\n\n.pull-left[\n.reduce90[\n* Manual pipette:\n   * Use a thin glass tube to suction up a cell\n   * Maintain pressure in tube\n   * Transport to new environment\n   * Release pressure in tube\n]\n]\n\n???\nOne method is manual pipetting, where wet lab scientists suction up individual cells using a long thin tube.\n\n\n--\n\n.pull-left[\n.reduce90[\n* Repeat 1000 times to isolate 1000 cells\n  * Error-prone\n]\n]\n\n???\nThey can do this hundreds of times to isolate hundreds of cells, but it is error-prone, and often multiple cells are isolated together.\n\n\n--\n\n.pull-left[\n.reduce90[\n* Automatic pipette:\n  * Flow cytometry\n]\n]\n\n???\nAnother method is flow cytometry, which reduces the human-error component of this stage.\n\n---\n\n# Capture / Sorting: Flow Cytometry\n\n.pull-right[![Cartoon of a fluidics system with two lasers pointing through the fluidics system and filters and detectors detecting the amount of light reflected out of the system with an optics system. This goes through a detector to an electronics system.](../../images/scrna-intro/opticssystem.png)]\n\n.pull-left[\n.reduce90[\n* Stream cells along a liquid through a narrow tube\n  * Narrow to permit one cell at a time\n  * Fluid enough to allow high-throughput.\n]\n]\n\n.pull-left[\n.reduce90[\n* Screen each cell with a laser to probe properties:\n   * Cell Size and Type\n      * Front scatter vs Side scatter\n   * Cell Type by Fluorescent Labelling\n     *  Cell Surface Markers (CDs)\n     *  Fluorescent Labelling\n]\n]\n\n.pull-left[\n.reduce90[\n* Isolate a cell into its own sequencing environment\n]\n]\n\n???\n- Flow cytometry floats cells in a shallow liquid bath and streams them along a narrow channel, just narrow for one cell to pass through.\n- Cells can be screened by a variety of properties this way, such as by their light scatter properties, and from fluorescent cell labelling.\n- Cells can be tagged and isolated in this manner.\n\n---\n\n# Capture / Sorting: Size and Type\n\n.pull-right[\n  ![The same cartoon as previously](../../images/scrna-intro/opticssystem.png)\n]\n\n\n.pull-left[\n*Optical Scatter*\n  * Ratio of Cell Size:Wavelength\n  * If Cell Size < Laser Wavelength (~400nm)\n    * Low intensity and high inconsistency scatter\n\n  * Measured in terms of:\n     * Forward Scatter (FSC)\n     * Side Scatter (SSC)\n\n]\n\n???\n- Optical scatter properties can be used to probe size and consistency of the cell, where cells with a smaller size than the laser wavelength yield lower intensities and more inconsistent scatter patterns.\n- There are two main types of optical scatter: Forward scatter, and Side scatter.\n\n---\n\n# Capture / Sorting: Size and Type\n\n.pull-left[\n.reduce90[\n*Forward Scatter (FSC)*\n  * Measures along the path of the laser\n  * FSC intensity proportional to diameter of cell\n  * Good for distinguishing between immune cells\n]\n]\n\n.image-75[.pull-right[![A coloured scatter plot showing two clumps of points labelled monocytes and lymphocytes.](../../images/scrna-intro/FlowJo_Layouts__01-Mar-2017.jpg)]]\n\n\n???\n- Forward scatter is aligned with the main laser and measures the diameter of cell, which is ideal for distinguishing different cells by their size profiles.\n- For example monocytes, which are typically larger than lymphocytes, as seen on the X-axis of the example image.\n\n--\n\n.pull-left[\n.reduce90[\n<br />\n\n*Side Scatter (SSC)*\n  * Measures 90° to laser, along path of cells\n  * Much weaker intensities than FSC\n  * Refraction/reflection proportional to granularity of cell\n]\n]\n\n.image-75[.pull-right[![The same scatter plot but now monocytes and graunlocytes are shown as blobs.](../../images/scrna-intro/Granulocytes_vs_Monocytes_scatter.jpg)]]\n\n\n???\nSide scatter is perpendicular to the main laser, and measures the granularity of the cell, ideal for distinguishing cells with less defined internal structures, such as the granulocytes on the Y-axis of the example image.\n\n---\n\n# Capture / Sorting: FACS\n\n.pull-left[\n![A scatter plot cut into four regions of CD4+/- and CD8+/-](../../images/scrna-intro/CD8vsCD3.png)\n.footnote[.reduce70[Image from BD Biosciences]]\n]\n\n.pull-right[\n.reduce90[\n*Fluorescence-Activated Cell Sorting (FACS)*\n  * Cell surface markers\n    * Fluorescent Markers for each cell\n  * Positive and Negative\n    * Whether cell activated for that CD or not.\n  * Plot different CD markers against each other\n    * Isolate cell populations\n  * Can set gating thresholds to isolate analysis to enriched subset of cells\n\n]\n]\n\n???\n- Cells can also be gated and characterised by their cell surface markers via FACS.\n- By plotting different surface marker intensities against one another, cells can be separated, gated, and labelled based on these fluorescent properties.\n\n---\n\n# Barcoding Cells\n\n.center[![Groups of GGG and TCT are added to two different cells to label them.](../../images/scrna-intro/scrna_pbb_barcodes_add.svg)]\n\n.footnote[Add unique barcodes to every transcript in a cell]\n\n???\n- Once isolated, cells can be barcoded.\n- Barcodes are unique sequences that are added to each RNA molecule.\n- They are not unique to the molecule, but unique to the cell such that any two RNA molecules will be tagged by the same cell barcode, should they exist in the same cell.\n- RNA molecules from different cells will have different cell barcodes.\n\n---\n\n# Barcoding Cells\n\n.footnote[Place cells into sequencing plate]\n\n.pull-left[![Cells with barcodes are plated into individual wells based on their barcode.](../../images/scrna-intro/scrna_pbb_barcodes_overview.svg)]\n\n.pull-right[\n.reduce90[\n* From a pool of many *many* different tissue samples / cells:\n\n   * Cell Barcodes tell us which cell the transcript from\n   * UMIs can tell us how much the transcript was amplified, by comparing it with other transcripts from the same gene with the same UMI tag.\n]\n]\n\n???\nOnce the RNA molecules have been tagged by cell barcodes, they can be amplified, either separately or pooled together, where the amplified products share the same cell barcodes as their original counterparts.\n\n---\n\n### Sequencing Issues: Amplification\n\n.center[.image-75[![A cartoon of a cell with a red and blue strand. The red strand amplifies well, the blue does not.](../../images/scrna-intro/amplification_errors.svg)]]\n\n.reduce90[\n* Polymerase Chain Reaction (PCR)\n   * Takes a single-stranded read and duplicates it\n   * Works well when enough reads are present in pool\n* Low coverage\n   * When reads in sequencing pool are low, many will be missed\n   * Can lead to one-sided amplification\n]\n\n???\n- PCR amplifies the gene products to make them more easily detectable during sequencing.\n- When there is a lot of gene product to amplify, as is the case for bulk RNA-seq, PCR works quite well in amplifying all products in a reasonably well-represented manner.\n- However, in the case of single-cell products, the amount to amplify is very small, and many unique reads might be missed during this phase whereas others may be over amplified, as shown in the blue and red transcripts in the example.\n\n---\n\n### Sequencing Issues: Amp. + UMIs\n\n.pull-left[![The same cartoon but now red and blue strands are labelled with pink and grey adapters. The red and blue both amplify but at different rates.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n\n.pull-right[\n.reduce90[\n* How many red transcripts in the cell?\n\n* After PCR amplification?\n\n* What do the little coloured tags at the start of each transcript do?\n\n\n* Unique Molecular Identifiers (UMIs)\n\n* Added to help mitigate bias from amplification.\n]\n]\n\n???\n\n- To guard against this type of amplification bias, we can add a random element to the barcoding.\n- These random barcodes known as UMIs, uniquely tag transcripts such that any two transcripts of the same gene are likely to have different random barcodes.\n\n---\n\n### Sequencing Issues: Amp. + UMIs\n\n.pull-left[![The same cartoon, red and blue amplify at different rates.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n\n.pull-right[\n\n.center[Counting Reads\n\n|          | Reads |\n|---------:|:-----:|\n|  **Red** | 6     |\n| **Blue** | 3     |\n\n]\n]\n\n???\n- Let us consider the example to the left: we have 2 red transcripts and 2 blue transcripts inside the cell, which after amplification equate to 6 red transcripts and 3 blue transcripts.\n- If we were to compare the differential gene expression between the red and blue transcripts, just by looking at the amplified reads, we would come to the false conclusion that the red transcripts are expressed twice more than the blue.\n\n\n--\n\n.pull-left[\n\n.center[Grouping Reads by Gene and UMI\n\n|          | **UMIs** | **Reads** |\n|---------:|:--------:|:-----------:|\n|  **Red** | Pink     | 2           |\n|          | Cyan     | 4           |\n| **Blue** | Pink     | 1           |\n|          | Green    | 2           |\n\n]\n]\n\n.pull-right[\n\n.center[Counting de-duplicated Reads\n\n|          | **UMIs (Grouped)** | **# UMIs** |\n|---------:|:------------------:|:-----------:|\n|  **Red** | {Pink, Cyan}       | 2           |\n| **Blue** | {Pink, Green}      | 2           |\n\n]\n]\n\n???\nHowever if we group the reads by their UMIs, and then count only the number of unique UMIs per transcript, de-duplicating the reads which share the same transcript and UMI, we arrive at 2 red reads and 2 blue reads which better represents the true number of transcripts.\n\n\n---\n\n### Sequencing Issues: Unique UMIs?\n\n\n.pull-left[![The same cartoon, red and blue amplify at different rates.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n.pull-right[\n\n|          | **UMIs** | **#Reads** |\n|---------:|:------------------:|:-----------:|\n|  **Red** | {Pink, Cyan}       | 2           |\n| **Blue** | {Pink, Green}      | 2           |\n\n.reduce90[\n* Pink appears twice in different genes.\n* In what context are UMIs unique?\n]\n\n]\n\n???\n- UMIs are relatively random, but not truly random.\n- Notice that the pink UMI appears twice: once in the blue transcript and once in the red transcript.\n\n\n--\n\n<br />\n\n.reduce90[\n* Can every transcript in a cell have its own UMI?\n\n* Number of mRNA transcripts in a cell?\n  * ~ 10⁵ to 10⁶ in a mammalian cell.\n\n* Require at minimum barcodes of length *N*, where 4ᴺ = 10⁵\n]\n\n???\nThis is due to there being often more transcripts than available UMIs, both which are dependent on the number of transcripts in a cell, and the length of the barcode.\n\n---\n\n# Sequencing Issues: Unique UMIs?\n\n.center[Barcodes of length *N* with Edit Distance of *B*:]\n\n.pull-left[\n\n.center[*N = 5* and *B = 1*]\n\n```\nAAAAA AAAAC AAAAG AAAAT AAACA ····\nCCCCC CCCCA CCCCG CCCCT CCCAC ····\n              ·\n              ·\n              ·\n```\n\n.center[*4⁵ = 1024* barcodes]\n\n]\n\n.pull-right[\n\n.center[*N = 5* and *B = 2*]\n\n```\nAAAAA AAACC AAAGG AAATT AACCA ····\nCCCCC CCCAA CCCGG CCCTT CCCAA ····\n              ·\n              ·\n              ·\n```\n\n.center[*4⁵⁻¹ = 512* barcodes]\n\n]\n\n.footnote[\n\nEdit distances guard against **sequencing errors.**\n\n]\n\n???\n\n- Consider a set of barcodes of length 5 with an edit distance of 1 between adjacent barcodes, and another set with an edit distance of 2.\n- The former is not robust against common sequencing errors of 1 base pair, but the latter only allows for half the number of barcodes.\n- This trade-off between the number of available barcodes and guarding against sequencing errors is instrumental in the design of cell barcodes and UMIs.\n\n---\n\n# Sequencing Issues: Unique UMIs?\n\n.pull-left[![The same cartoon, red and blue amplify at different rates.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n.pull-right[\n\n|          | **UMIs**      | **# Reads** |\n|---------:|:-------------:|:----------:|\n|  **Red** | {Pink, Cyan}  | 2          |\n| **Blue** | {Pink, Green} | 2          |\n\n.reduce90[\n* Pink appears twice in different genes.\n* In what context are UMIs unique?\n\n<br />\n<br />\n\n]\n\n]\n\n.reduce90[\n*In what context are UMIs unique?*\n  * UMIs are \"random salt\"\n    * 'Unique enough' at the transcript level\n\n  * We wish to count transcripts only\n    * De-duplication of UMIs at transcript level\n    * Good estimation of true transcript abundance\n]\n\n???\nIn the context of amplification, UMIs do not need to be unique, they just need to be random enough to deduplicate transcripts in order to give a more accurate estimate of the number of transcripts within a cell.\n\n---\n\n# Cell Barcodes and UMIs (Recap)\n\nFor Each Cell:\n\n1. Add Cell Barcodes to Cells\n![Groups of GGG and TCT are added to two different cells to label them.](../../images/scrna-intro/scrna_pbb_barcodes_add.svg)\n\n???\nSo let's just recap what we've learned: First each cell has cell barcodes added to each RNA molecule in each cell.\n\n---\n\n# Cell Barcodes and UMIs (Recap)\n\nFor Each Cell:\n\n1. Add Cell Barcodes to Cells\n1. Add UMIs to Cell Barcoded Cells\n![Random mixtures of three letter barcodes are shown, in addition to the two cells from the last cartoon which had GGG in one and TCT labelled reads in the other cell. Now they all have random prefixes before the GGG in one cell and TCT in the other.](../../images/scrna-intro/scrna_umi_add.svg)\n\n\n???\n- Then we add random UMIs to all transcripts, which further tag the molecules.\n- These can then be used deduplicate the transcripts after amplification.\n- After amplification we need to perform some quality control.\n\n---\n\n# QC: Overcoming Background Noise\n\n\n\n.center[![A matrix of Genes 1, 2, 3 and cells per column is changed into two matrices, one with counts of genes detected per cell, and counts of cells detected per gene](../../images/scrna-intro/raceid_libsize.svg)]\n\n* Num. features per cell, and library size should follow a normal curve.\n* Min-Max filtering helps clip off the fat-tails of a distribution.\n\n???\n- One way to do this is to set thresholds on the limits of detectability for genes and for cells.\n- Consider an analysis governed only by 3 genes (G1, G2 and G3), and 5 cells (A, B, C, D and E).\n- The first row of the top table defines the library size, which is total number of messenger RNAs across all genes in each cell.\n- The subsequent rows are the thresholds of gene detectability, displaying how many genes are detected in each cell for genes greater than the threshold amounts of 0 to 4.\n- We see that even a threshold of greater than 3 transcripts detected in a given cell  still keeps 3 cells in the analysis: B, C, and E. In the lower table, the opposite is represented, with the total number of transcripts across all cells for each gene.\n- By setting thresholds of detectability, we can see how many cells are described by the gene for that threshold.\n- In both cases, we can see that if we set the thresholds too low, then we risk keeping low quality genes or cells, but if we set the thresholds of detectability too high, then we risk losing too many.\n\n---\n\n# Normalisation: Bulk vs Single-Cell\n\n.pull-left[\n\n*Bulk RNA-seq*: High Coverage\n\n|            |  T1 | T2 | T3 |\n|:-----------|----:|---:|----|\n| **GeneA** | 100 | 80 | 40 |\n| **GeneB** |  45 | 30 | 40 |\n\n.reduce70[* Median Gene Expression is high]\n\n\n<br />\n\n*scRNA-seq*: Very Low Sequencing Depth\n\n|            | C1 | C2 | C3 | C4 | C5 |\n|:-----------|---:|---:|---:|---:|---:|\n| **GeneA** |  0 |  0 |  2 |  0 |  1 |\n| **GeneB** |  2 |  0 | 15 |  0 |  0 |\n\n.reduce70[* Median Gene Expression is zero]\n\n]\n\n\n.pull-right[\n\n__Why is this a problem?__\n\n.center[\n$$R(s,g) = \\frac{X\\\\_{sg}}{(\\prod\\\\_{s} X\\\\_{s})^{\\frac{1}{n}}}$$\n\n$$DESeq(s,g) = \\frac{X\\\\_{sg}}{Med(R\\\\_{s})}$$\n\n]\n]\n\n???\n- Filtering can be a luxury however, as many single-cell RNA-seq datasets have typically low sequencing depth compared to bulk RNA-seq.\n- During the process of normalisation, samples are scaled against one another to make them more comparable.\n- This is normally performed by using median values. For example, for DE-Seq normalisation, the geometric mean count for a cell is taken, and each gene value in that cell is divided by it and by the median value of all geometric means of all cells.\n- If median gene expression is high, then this normalisation method works quite well.\n\n--\n\n.pull-right[\nCan't divide by zero!\n]\n\n???\n- But if the median gene expression is zero, as is often the case with single-cell data, then we have the problem of dividing by zero.\n- There are methods to get around these zero counts.\n\n---\n\n# Normalisation: SCRAN method\n\n.footnote[.small[[*Pooling across cells to normalize single-cell RNA sequencing data with many zero counts*, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n\n.pull-left[![Blue and red bubbles are mixed, then separated into two groups, and then arranged around a circle, red going from small to large around the right half, blue from small to large around the left. The bottom of the circle is labelled 6, the top is labelled 12.](../../images/scrna-intro/scran_pooling_left.svg)]\n\n\n.pull-right[\n.reduce90[\n1. Calculate the library sizes of all cells\n\n1. Calculate the library size of a pseudo reference cell (average)\n\n1. Separate odd sizes (red) and even sizes (blue) into two groups\n\n1. Sort each group by library size and place on opposite sides of a \"ring\"\n]\n]\n\n???\n- One such method is the SCRAN method which works by creating overlapping pools of cells such that any individual cell is characterized by cells of similar library sizes.\n- The method involves splitting all cells into an odd and even group by their library size, and arranging them onto a ring structure where neighbouring cells on the ring have similar sizes.\n\n---\n\n# Normalisation: SCRAN method\n\n.footnote[.small[[*Pooling across cells to normalize single-cell RNA sequencing data with many zero counts*, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n\n.pull-right[![The same final graph with blue and red circles of increasing size with an arrow pointing to a large number of formulas that overlap.](../../images/scrna-intro/scran_pooling_right.svg)]\n\n.pull-left[\n.reduce90[\n1. Define overlapping pools of adjacent cells of size *k*\n\n1. For each pool\n    1. Sum the library sizes of all cells within\n    1. Derive a size factor by dividing by the reference cell\n\n1. For each cell\n    1. Find which pools it belongs to\n    1. Build a linear model using these size factors\n    1. Estimate the size factor of the cell on this linear model\n]\n]\n\n???\n- Overlapping pools of fixed sizes are defined, resulting in each cell being defined by multiple pools.\n- A linear model for that cell can then be built by the pools it occurs within, and normalisation factors for all cells can be determined this way.\n\n---\n\n# Normalisation: SCRAN method\n\n.footnote[.small[[*Pooling across cells to normalize single-cell RNA sequencing data with many zero counts*, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n\n.center[![The two previous graphs now in one graph.](../../images/scrna-intro/scran_pooling.svg)]\n\n???\n- By this method, the issue of low sequence coverage is worked around by turning cells with low library sizes into useful components of a size factor that can be applied to similar cells.\n- Such novel normalization methods were commonplace a few years ago, but as sequencing technologies have improved, the issue of many zero counts in a matrix becomes less important, and normalisation size factors can be derived using bulk RNA-seq methods once again.\n\n\n---\n\n# Wanted vs Unwanted Variation\n\n.pull-right[![Three overlapping line graphs mapping contributing variance to density. Top N genes is shown increasing in density as contributing variance increases, which genes per cell, transcripts, and batch source decrease.](../../images/scrna-intro/variance.svg)]\n\n.pull-left[\n.reduce90[\n*Wanted Variation*\n  * Expression from the top most differentially expressed genes\n\n*Unwanted Variation*\n  * \"Confounders\"\n  * Technical Variation\n     * Batch source\n     * Library Size\n  * Biological Variation\n     * Intrinsic cell noise\n]\n]\n\n???\n- Other factors that we need to take into account during a single cell RNA analysis are the unwanted factors that can confound the analysis.\n- Ideally we wish to see the gene profiles that separate different types of cells are driven by biological variance.\n- There is however confounding variation from both technical and biological sources that are not useful to the analysis but do contribute to the variance.\n\n---\n\n# Confounding Variation: Biological\n\n.center[![A cartoon on the left shows a question mark with arrows to nothing and to transcripts shown. On the right are the cell cycle phases and different amounts of transcripts in each phase.](../../images/scrna-intro/raceid_cellcycle.svg)]\n\n.pull-left[\n.reduce90[\n.center[*Transcription Bursting*]\n * Transcription not continuous, occurs in \"bursts\"\n * Phenomenon hidden in bulk RNA-seq\n]\n]\n\n.pull-right[\n.reduce90[\n.center[*Cell Cycle*]\n * Cells of the same type have twice the amount of mRNA at M-phase than G1-phase\n]\n]\n\n???\n- Confounding biological variance appears in two forms: Transcriptional bursting, and Cell cycle variation.\n- Transcriptional bursting is a phenomenon that occurs in cells in which transcription occurs in discrete states of active and inactive, where the interval between these states is hard to model.\n- In bulk RNA-seq, this phenomenon is unnoticeable as the effects are averaged out over many cells. But in single cell, two cells of the same type may exhibit different gene profiles simply because one cell was actively transcribing and the other was not.\n- This is not something we can control for in the analysis, but it is something we should be aware of when understanding why cell clusters can be noisy.\n- Cell cycle variation on the other hand is a much more well understood process, where the amount of RNA in a cell is approximately double that from a cell of the same type due to one being in the early G1 phase and the other being in the M-phase during the cell cycle.\n- There are genes which are known to covary with the cell cycle, and so by regressing the effect of these genes, we can control against the cell cycle.\n\n\n---\n\n# Confounding Variation: Technical\n\n.center[![Library size variation points to two cells with red and blue transcripts in identical numbers. However during amplification in one cell it produces results, while in the other blue is dropped.](../../images/scrna-intro/raceid_technical_variation.svg)]\n\n.pull-left[\n.reduce90[\n*Amplification Bias*\n* Different transcripts are amplified more than others\n* Mitigated via UMIs\n]\n]\n\n.pull-left[\n.reduce90[\n*Dropout Events*\n* Some genes are falsely not detected in cells\n* Mitigated via better capture methods and normalisation\n]\n]\n\n???\n- Confounding technical variance appears in a three forms: Amplification bias, Dropout events, and Library size variation.\n- Amplification bias can be mitigated by UMIs as demonstrated before.\n- Dropout events give rise to the prevalent zeroes in the count matrices, and their effect can be reduced by using clever normalisation techniques such as the pooling method shown previously, as well as by using better sequencing methods.\n\n---\n\n# Confounding Variation: Technical\n\n.center[![Library size variation points to two cells with red and blue transcripts in identical numbers. However during amplification in one cell it produces results, while in the other blue is dropped.](../../images/scrna-intro/raceid_technical_variation.svg)]\n\n*Library Size Variation*\n* Cells have different transcription rates and capture rates\n* Mitigated via normalisation\n\n???\n- Library size variation arises for a variety of different reasons, but is the main source of variation within an analysis.\n- Like bulk RNA-seq, this is reduced with good normalisation methods.\n\n---\n\n# Relationships Between Cells\n\nConsider:\n * 1,000s of Cells\n * 10,000s of Genes\n * 10k dimensional dataset, with 1k observations\n\nAim:\n * Find groupings of Cells in a subset of these Genes\n\nNote:\n* Some cells can have very similar expression in one gene, and very far different expression in all others.\n* How to represent this?\n\n???\n- Once we have removed unwanted confounders from the analysis we have the issue of quantifying the relationships between cells.\n- From a data analysis standpoint, we treat each cell as an observation, and each gene as a variable.\n- For large genomes this means extremely high dimensional datasets. Cells exist as points in this extremely sparsely populated high dimensional space, making it difficult to see the natural groupings.\n- The high dimensional space can be reduced a lot by simply filtering out genes that do not appear to be differentially expressed across all cells.\n- To find the relationships between these cells however, we need to define the distances between cells.\n\n---\n\n# Distance Matrix\n\n![A count matrix of genes vs cells is plotted in N-dimensional space with each gene representing the different axes. A distance formula for 3 dimensions is shown, and then a final table is shown from the count matrix with the distances between each of the cells, based on their genes.](../../images/scrna-intro/raceid_distance.svg)\n\n???\n- A distance matrix does just this, defining the distance between any two cells by a single score.\n- Here we use the Euclidean distance on a 3 dimensional dataset of 3 genes (G1, G2 and G3), and 3 cells (R, P and V).\n- The distance between any two cells can be calculated as the sum of squares of the difference in gene values.\n- Note how the distance matrix is symmetrical along the diagonal, confirming that for example the distance from cells R to V is the distance from V to R as expected.\n\n---\n\n# Relatedness of Cells: KNN\n\n![A plot of cells across three genes is shown with the label high dimensional dataset of cells. This produces a distance matrix (symmetric), and then via KNN with k=2, a non-symmetric matrix. This is then plotted again in the gene-dimensional space to show connections between cells.](../../images/scrna-intro/scrna_knn.svg)\n\n* Perform *K-nearest neighbours* to connect edges to cell vertices.\n\n???\n- Once a distance matrix is generated, we can perform K-nearest neighbours upon the distance matrix where directed edges are generated between cells.\n- For each row of the distance matrix, K of the cells with the smallest distance values are selected representing the nearest neighbour that current row's cell has to the selected column cells.\n- If the edges are mutually shared between neighbouring cells, then this is called a shared nearest neighbour approach.\n\n\n---\n\n# Dimensional Reduction\n\n![Matrix of genes vs cells is plotted in gene-dimensions, and then reduced into 2 dimensions.](../../images/scrna-intro/raceid_dimred.svg)\n\n.pull-left[\n.reduce90[\n*Aim:*\n* Take a high-dimensional dataset and reduce it into a lower dimension that we can understand.\n  * e.g. 10000-D → 2D\n]\n]\n\n.pull-right[\n.reduce90[\n*Constraint*\n* Preserve the high dimensional topology in a low dimensional space.\n   * e.g. if Cell A is far from Cell D yet close to Cell B in 3D, it should replicate those relationships in 2D.\n]\n]\n\n???\n- We can represent this 3 dimensional space easily as 3 independent axes with points that denote the cells.\n- Extrapolating this relatively low dimensional example set to a real dataset which thousands of dimensions is beyond the scope of human possibility.\n- Dimensional reduction is a type of technique that takes a high dimensional dataset and produces a low dimensional representation, usually 2 dimensional, that tries to preserve the distances between the data points.\n- Here the relative differences between cells is maintained in both the high and low dimensional representations.\n- There are  many different kinds of dimension reduction techniques, each with their own strengths and weaknesses dependent on the type and the dimensionality of the data.\n\n\n---\n\n### Clustering\n\n.pull-left[.image-100[![A scatter plot with many groups of cells labelled by different colours. The cells are largely clustered well, with few outlying cells.](../../images/scrna-intro/singlecellplot3.png)]]\n\n.pull-right[\n.reduce90[\n1. 2D Projection\n   * Each dot is a cell\n   * Clustering colours the dots, where different coloured cells belong to different clusters\n   * Different clusters represent different cell types\n]\n]\n\n???\n- Once the number of variables of the dataset have been sufficiently reduced via filtering and dimensional reduction, clustering can be performed more easily.\n- Here in this 2D projection, each circle is a cell, and the unique colours depict the clusters they have been assigned to.\n- The physical distances between the groups of coloured cells tell us how good the clustering is for this projection.\n\n\n---\n\n### Clustering\n\n.pull-left[.image-100[![Same scatter plot with clustering as before, but now the clusters are labelled things like Neurons, NSC, Glial Prog., Astrocytes, etc.](../../images/scrna-intro/singlecellplot4.png)]]\n\n.pull-right[\n.reduce90[\n1. 2D Projection\n1. Discrete Cell Types\n  * Each cluster should represent a different type\n  * Look for the most DE genes in each cluster\n    * Find the marker genes → Cell Type\n]\n]\n\n???\n- By inspecting the top differentially expressed genes in each cluster against all other clusters, clues to the type of cell that the cluster describes can be found.\n- Cell types are often characterized by the expression of specific marker genes, and the presence of these genes are strong indicators of type.\n- Marker gene discovery can then be used to annotate the clusters.\n\n\n---\n\n### Clustering\n\n.pull-left[.image-100[![The same labelled graph, but now arrows connect the next nearest groups of cell types.](../../images/scrna-intro/singlecellplot6.png)]]\n\n.pull-right[\n.reduce90[\n1. 2D Projection\n1. Discrete Cell Types\n1. Relationships infer Lineage\n  * Neural Stem Cells differentiate into mature cell types\n  * Lineage trees are constructed by taking into account\n     * Entropy of cluster\n     * Proximity of cluster\n]\n]\n\n???\nWe can also further derive the relationships between these clusters by computing lineage trees based on the amount of noise in each cluster, with the expectation that stem cells have noisy expression profiles yielding broader clusters, and mature cells have very clear expression profiles yielding tighter clusters.\n\n\n---\n\n## Clustering: Hard vs Soft\n\n\n|  |  |\n|--|--|\n| .image-100[![Same set of distinct clusters with very clear separation](../../images/scrna-intro/singlecellplot3.png)] | .image-100[![Clusters now bleed into one another, and the separate is not clear.](../../images/scrna-intro/10xdata.png)] |\n| .center[**Hard**] | .center[**Soft**] |\n| Big spaces between clusters | Clusters bleed into one another |\n| Cell types are well defined and the clustering reflects that | Cell types seem to intermingle with one another. |\n\n\n???\n- The types of clustering you are likely to encounter in an analysis is dependent on the input datasets, where cells taken from late stage samples are less likely to be bunched together and are more likely to yield large visible gaps known as hard clusters that clearly defined different types.\n- Earlier stage datasets are more likely to yield softer clusters, where neighbouring clusters share soft boundaries as clusters intermingle slightly with one another.\n\n---\n\n# Continuous Phenotypes:\n\n.center[![The graph charts development time of reticulocytes as they pass through an intermediate or rare cell phase, into their final form: red blood cells.](../../images/scrna-intro/raceid_contpheno.svg)]\n.reduce90[\n* Cells aren't discrete, they transition\n* Continuously changing over time from a less mature type to more mature type\n]\n\n???\nSoft clustering is to be expected, since although clustering is a statistical method for discretely partitioning data, the underlying cell biology of the data is a continuous process, where cells transition from one well-defined state to another through intermediate stages which are represented in-between two cluster centres.\n\n---\n\n## Performing Clustering\n\n.pull-left[\n![Discrete expression profiles: Three mountains are shown with clouds, we just see three peaks. Cells in red, green, and blue are shown at the peaks. Continuous expression landscape: the clouds are removed and we see the mountains are actually connected and there are cells in between in various intermediate colours.](../../images/scrna-intro/raceid_mountains.svg)\n]\n\n.pull-right[\n.reduce90[\n*Dynamic datasets with continuously dynamic clusters*\n  * single-cell datasets\n  * PCA is too discrete in partitioning data\n  * Manifold learning algorithms, learn the landscape\n\n\n*Variety of different clustering methods*\n\n  * K-means\n  * K-medians\n  * Hierarchical Clustering\n  * Community Clustering\n]\n]\n\n\n???\n- Because of the continuous nature of these single-cell datasets and the extremely high dimensionality of the data, discrete partitioning is often a poor model for partitioning the data.\n- If we instead assume that cell clusters are related to one another via transitional cells which would naturally lie in-between clusters, then manifold learning techniques are better suited.\n- These techniques derive an expression landscape that can not only be used to relate clusters to one another, but also can be used to infer lineage and hierarchy.\n- To actually perform the clustering there are three commonly-used methods: K-means, hierarchical and community clustering.\n\n---\n\n### Performing Clustering: K-means\n\n.pull-right[![An animated figure showing several iteration of an algorithm that is optimising a 3-way split between a scatter plot of cells. There is no clear boundary making the final result appear only marginally better.](../../images/scrna-intro/kmeans.gif)]\n\n.pull-left[\n.reduce90[\n*K-means*\n   1. Initialise *k* random positions\n   1. Iteration Step:\n      1. Calculate distance from each cell to each *k* position\n      1. Assign each cell to it's nearest *k*\n      1. Set new *k* positions to the mean position of all cells in that group\n\n*K-medians*\n   * Same as above, but use median position instead\n   * Less influenced by outliers\n\n]\n]\n\n???\n- K-means and K-medians follow the same method: the number of clusters are defined before hand, and initialised in random positions.\n- The positions are then updated by the contribution of the cells more closer to it than to other positions.\n- This process occurs multiples times until the positions no longer significantly change or until a set number of iterations have been achieved.\n- The final assignment of each cell then becomes the cluster assignment.\n\n---\n\n## Performing Clustering: Hierarchical\n\n.pull-left[![A many-step figure starting with a number of individual dots. The text reads \"identify the two clusters that are closest\" and \"merge the two most similar clusters.\" The process repeats a number of times until all clusters are absorbed into the one large blob.](../../images/scrna-intro/hierarchal1.png)]\n\n.pull-right[\n.reduce90[\n* Use the distance matrix to find the two closest points\n* Merge and repeat\n\n* Yields a dendrogram\n  * Hierarchy of clusters:\n\n.image-90[![Several points in a square are labelled A through F, on the right a dendogram is shown with lengths indicating how close each letter is to each other.](../../images/scrna-intro/hierarchal2.png)]\n\n???\n- Hierarchical clustering is more flexible and does not need an initial parameter to define the number of resulting clusters.\n- Here the two closest points in a distance matrix are joined into a single group, distances are recalculated, and the two closest points are once again joined.\n- This process repeats until all data has been consumed into one.\n- By tracing the process backwards, a hierarchy can be established that is represented by a dendrogram.\n\n---\n\n\n## Community Clustering: Louvain\n\n.center[![A graph is shown with dots connected by lines. Below, those dots have expanded and pink touches orange and nearly touches purple. It asks pink by iteself? And notes 4 external links and 0 internal links. Two hypothetical options are shown, if pink absorbs purple, we see 5 external connections and 1 internal, so, it's added new connections. An X suggests this is wrong. Below is the pink absorbs orange option, where we see 3 external and 1 internal connection, so one connection has become internal, and no new nodes are connected. A check mark indicates this was right.](../../images/scrna-intro/commgraph1.svg)]\n\n.reduce90[\nAim: Maximise internal links and minimise external links\n]\n\n???\n- Louvain clustering is a widely used type of community clustering for single cell data.\n- Here each cell is assigned a neighbourhood of its own and the number of internal and external links between neighbourhoods are counted.\n- For each iteration, a random cell is selected and brought within the neighbourhood of another cell, and the internal and external links are once again counted.\n- If the new configuration has reduced the number of external links in favour of more internal links, then the configuration is kept.\n\n---\n\n## Community Clustering: Louvain\n\n.center[![Same Graph as previously, but now there are more, larger clusters. Blue and purple were absorbed, yellow and red were absorbed, and we see a simplified 4 node graph.](../../images/scrna-intro/commgraph2.svg)]\n\n.reduce90[\n* Randomly pick a cell and try to place it in a neighbour's cluster\n  * Accept if Internal:External increases\n  * Reject and pick another\n]\n\n???\nIf the new configuration has instead increased the number of external links, then the configuration is rejected and another cell is picked and tested. By performing this multiple times, a community structure of cells is built to whichever degree of specificity the user desires.\n\n---\n\n# Summary\n\n.pull-left[![Red and blue clusters of cells are shown resembling the tissue blobs. Graphs on the right for expression in Genes A, B, X are shown per cell](../../images/scrna-intro/rna_cells_singlerez.svg)]\n\n.pull-right[\n.reduce90[\n* Single-cell datasets are vast and sparsely populated\n\n* Quality filtering and normalisation are required\n\n* Feature selection and dimension reduction reduce the complexity\n\n* Clustering denotes cell types and cell relationships\n\n* scRNA-seq is a statistically driven field\n\n* Many ways to analyse the data\n * Play with it!\n]\n]\n\n???\n- Single cell analysis is non-trivial, and each stage, from the filtering to the normalisation to the dimension reduction and the clustering can drastically affect the outcome of the analysis.\n- Due to the variability in the analysis, one should not panic when faced with uncertainty.\n- The goal is to play around with the data until it begins to reflect the biology.\n- This can take many many tries to achieve, and it may never be perfect, but the idea is to try as many different ways as possible to see what robust conclusions you can come to.\n\n---\n\n### Further scRNA-seq Data Analysis\n\n![Screenshot of the galaxy training materials that cover single cell](../../images/scrna-intro/training_single_cell.png)\n\n???\n- In this regard, the vast UseGalaxy resources can be put to good use by testing out the many different paths of the analysis, and the Galaxy Training Network provides tutorials and hands-on trainings to assist you in this regard.\n- Please explore them to better develop your understanding.\n","# RNA-seq de una sola célula\n\nIntroducción al análisis de datos de scRNA-seq\n\n???\n- Saludos a todos y bienvenidos al taller de análisis de RNA-seq de una sola célula de Galaxy.\n- Aquí lo guiaremos a través de algunos de los conceptos básicos y conceptos al tratar con datos de una sola celda.\n\n---\n\n\n## Secuencia de ARN a granel\n\n.pull-left[! [Se muestran dos manchas etiquetadas como tejido A y tejido B, a la derecha se resumen en tablas de Gen A, B y X y su diferente expresión promedio por tejido.](../../images/scrna-intro/rna_cells_bulkrez.svg)]\n\n.pull-right[\n.reduce90[\n\n\n| Atributo | Resumen |\n| -: |: - |\n| Resolución | Tejidos enteros |\n| Señal | Expresión génica media por tejido |\n| Expresión diferencial | Diferencia entre la expresión génica media entre tejidos |\n]\n]\n\n\n???\n- Comencemos con las diferencias entre Bulk RNA-seq y datos de secuencia de ARN de una sola célula.\n- Con Bulk RNA-seq comparamos dos tejidos observando la expresión promedio de cada gen detectado en cada uno de los tejidos.\n- Debido al número de moléculas de ARN que se están considerando, la profundidad de secuenciación y la fuerza del análisis es razonablemente alta.\n- La expresión diferencial se mide luego como la expresión relativa de un gen dado entre un tejido y otro.\n---\n\n## RNA-Seq de célula única\n\n.pull-left[! [Se muestran grupos de células rojas y azules que se asemejan a la mancha de tejido de la diapositiva anterior. Ahora los gráficos de la derecha para la expresión en los genes A, B, X se muestran por celda en lugar de por tejido.](../../images/scrna-intro/rna_cells_singlerez.svg)]\n\n.pull-right[\n.reduce90[\n\n\n| Atributo | Resumen |\n| -: |: - |\n| Resolución | Células individuales dentro de los tejidos |\n| Señal | Expresión de genes individuales por célula |\n| Expresión diferencial | Algunas células expresan el mismo conjunto de genes de la misma manera; comparar un conjunto de células con otro |\n\n]\n]\n\n\n???\n- Con el análisis de secuencia de ARN de una sola célula, la etapa se aleja de medir la expresión promedio de un tejido.\n- Y hacia la medición de la expresión génica específica de células individuales dentro de esos tejidos.\n- Aquí ya no comparamos tejido contra tejido, sino célula contra célula.\n- A cada célula se le asigna un perfil genético que describe la abundancia relativa de genes detectados en su interior.\n- Muchas células comparten el mismo perfil genético, donde un perfil genético describe idealmente un tipo de célula.\n- A veces necesitamos comparar conjuntos de datos unicelulares en tejidos, y vemos que muchas células en tejidos comparten el mismo tipo de célula.\n- Por ejemplo, observe los perfiles de genes púrpura y verde que se comparten en ambos tejidos.\n\n---\n\n# De ARN a granel a ARN unicelular\n\n.image-50[![Los tejidos A y B de la primera diapositiva se muestran como las colecciones de células de la segunda diapositiva.](../../images/scrna-intro/rna_cells_bulk2single.svg)]\n\n.reduce90[\n* Para cuantificar el ARN a nivel de células individuales:\n  * Nuevos métodos de preparación de bibliotecas\n  * Nuevos métodos de secuenciación\n  * Nuevos métodos de control de calidad\n  * Nuevos métodos de análisis\n]\n\n???\n- Las nuevas tecnologías significan nuevos métodos y técnicas para aprovechar las nuevas características que las acompañan.\n- Los datos de secuencia de ARN de una sola célula requieren diferentes medios de preparación, secuenciación, control de calidad y análisis de bibliotecas.\n\n---\n\n# Captura de células y réplicas\n\n.center[*¿Cómo preparamos las muestras para la secuenciación?*]\n\n???\nPor ejemplo, ¿cómo se capturan y secuencian las células?\n\n--\n\n.pull-left[\n.reduce90[\n\n__Secuencia de ARN a granel__\n\n  1. Corta una rodaja fina de un pañuelo\n  1. Agregue enzimas para romper las paredes celulares.\n  1. Enjuague el material de ADN / ARN no deseado\n  1. Realice una secuenciación en el pegote sobrante\n\n]\n]\n\n???\nEn el análisis de secuencia de ARN a granel, el proceso implica tomar una muestra, eliminar moléculas no deseadas y secuenciar todo lo demás.\n\n--\n\n.pull-left[\n.reduce90[\n\n__Secuencia de ARN unicelular__\n\n  1. Corta una rodaja fina de un pañuelo\n  1. Descomponer un tejido en células\n  1. Aislar cada celda\n     * Agrega enzimas para romper las paredes celulares.\n     * Realizar código de barras\n  1. Realice la secuenciación en un grupo común\n\n]\n]\n\n???\n\n- Para el análisis de una sola celda, el proceso es muy similar, excepto que cada muestra es una celda.\n- Y, por lo tanto, debe secuenciarse por separado de otras células.\n- Una vez aisladas, se agregan códigos de barras únicos a cada celda y luego se secuencian.\n\n--\n\n__Réplicas biológicas__\n\n.center[\n.reduce90[\n\n| Tipo | Notas |\n| --------: |: ----------- |\n| ** Secuencia de ARN a granel ** | Cada corte de tejido es una muestra, se puede tomar otro corte |\n| ** RNA-secuencia unicelular ** | Cada celda es una muestra, no se puede replicar directamente porque es única |\n\n]\n]\n\n???\n- El nivel de resolución en una sola celda es a nivel de celda, y cada celda es única.\n- Por lo tanto, el concepto de réplicas biológicas no es exactamente el mismo que el de RNA-seq a granel.\n\n---\n\n# Captura / Clasificación:\n\n* ¿Cómo se aíslan las células? *\n\n\n???\nEl aislamiento celular se puede realizar de diferentes formas.\n\n--\n\n.pull-right[.image-90[! [Una imagen en blanco y negro de una mujer en el laboratorio que usa su boca para pipetear células de un tubo de ensayo a otro.](../../images/scrna-intro/mouthpipette.jpg)]]\n\n.pull-left[\n.reduce90[\n* Pipeta manual:\n   * Use un tubo de vidrio delgado para succionar una celda\n   * Mantener la presión en el tubo.\n   * Transporte a nuevo entorno\n   * Liberar presión en el tubo\n]\n]\n\n???\nUn método es el pipeteado manual, en el que los científicos de laboratorio húmedo succionan células individuales utilizando un tubo largo y delgado.\n\n--\n\n.pull-left[\n.reduce90[\n* Repita 1000 veces para aislar 1000 células.\n  * Propenso a errores\n]\n]\n\n???\nPueden hacer esto cientos de veces para aislar cientos de células, pero es propenso a errores y, a menudo, se aíslan varias células juntas.\n\n--\n\n.pull-left[\n.reduce90[\n* Pipeta automática:\n   * Citometría de flujo\n]\n]\n\n???\nOtro método es la citometría de flujo, que reduce el componente de error humano de esta etapa.\n\n---\n\n# Captura / Clasificación: Citometría de flujo\n\n.pull-right[! [Dibujo de un sistema de fluídica con dos láseres apuntando a través del sistema de fluídica y filtros y detectores que detectan la cantidad de luz reflejada fuera del sistema con un sistema óptico. Esto pasa por un detector a un sistema electrónico.](../../images/scrna-intro/opticssystem.png)]\n\n.pull-left[\n.reduce90[\n* Hacer fluir las células a lo largo de un líquido a través de un tubo estrecho\n   * Estrecho para permitir una celda a la vez\n   * Suficientemente fluido para permitir un alto rendimiento.\n]\n]\n\n.pull-left[\n.reduce90[\n* Examine cada celda con un láser para probar las propiedades:\n    * Tamaño y tipo de celda\n       * Dispersión frontal vs Dispersión lateral\n    * Tipo de celda por etiquetado fluorescente\n      * Marcadores de superficie celular (CD)\n      * Etiquetado fluorescente\n]\n]\n\n.pull-left[\n.reduce90[\n* Aislar una célula en su propio entorno de secuenciación\n]\n]\n\n???\n- La citometría de flujo hace flotar las células en un baño líquido poco profundo y las hace fluir a lo largo de un canal estrecho, apenas estrecho para que pase una célula.\n- De esta manera, las células se pueden cribar por una variedad de propiedades, como por sus propiedades de dispersión de la luz y por el marcaje celular fluorescente.\n- Las células se pueden marcar y aislar de esta manera.\n\n---\n\n# Captura / Clasificación: Tamaño y tipo\n\n.pull-right[\n! [La misma caricatura que antes](../../images/scrna-intro/opticssystem.png)\n]\n\n\n.pull-left[\n* Dispersión óptica *\n   * Relación de tamaño de celda: longitud de onda\n   * Si el tamaño de la celda <longitud de onda del láser (~ 400 nm)\n     * Dispersión de baja intensidad y alta inconsistencia\n\n   * Medido en términos de:\n      * Dispersión hacia adelante (FSC)\n      * Dispersión lateral (SSC)\n\n]\n\n???\n- Las propiedades de dispersión óptica se pueden utilizar para sondear el tamaño y la consistencia de la celda, donde las celdas con un tamaño más pequeño que la longitud de onda del láser producen intensidades más bajas y patrones de dispersión más inconsistentes.\n- Hay dos tipos principales de dispersión óptica: dispersión hacia adelante y dispersión lateral.\n\n---\n\n# Captura / Clasificación: Tamaño y tipo\n\n.pull-left[\n.reduce90[\n* Dispersión hacia adelante (FSC) *\n   * Medidas a lo largo de la trayectoria del láser.\n   * Intensidad FSC proporcional al diámetro de la celda\n   * Bueno para distinguir entre células inmunes\n]\n]\n\n.image-75[.pull-right[! [Un diagrama de dispersión de color que muestra dos grupos de puntos etiquetados como monocitos y linfocitos.](../../images/scrna-intro/FlowJo_Layouts__01-Mar-2017.jpg)]]\n\n???\n- La dispersión hacia adelante se alinea con el láser principal y mide el diámetro de la celda, lo que es ideal para distinguir diferentes celdas por sus perfiles de tamaño.\n- Por ejemplo, monocitos, que normalmente son más grandes que los linfocitos, como se ve en el eje X de la imagen de ejemplo.\n\n--\n\n.pull-left[\n.reduce90[\n<br />\n\n* Dispersión lateral (SSC) *\n   * Mide 90 ° con respecto al láser, a lo largo de la trayectoria de las células\n   * Intensidades mucho más débiles que FSC\n   * Refracción / reflexión proporcional a la granularidad de la celda\n]\n]\n\n.image-75[.pull-right[! [El mismo diagrama de dispersión, pero ahora los monocitos y graunlocitos se muestran como manchas.](../../images/scrna-intro/Granulocytes_vs_Monocytes_scatter.jpg)]]\n\n\n???\nLa dispersión lateral es perpendicular al láser principal y mide la granularidad de la célula, ideal para distinguir células con estructuras internas menos definidas, como los granulocitos en el eje Y de la imagen de ejemplo.\n\n---\n\n# Captura / Clasificación: FACS\n\n.pull-left[\n![Un diagrama de dispersión cortado en cuatro regiones de CD4 +/- y CD8 +/-](../../images/scrna-intro/CD8vsCD3.png)\n.footnote [.reduce70 [Imagen de BD Biosciences]]\n]\n\n.pull-right[\n.reduce90[\n* Clasificación de células activadas por fluorescencia (FACS) *\n   * Marcadores de superficie celular\n     * Marcadores fluorescentes para cada celda\n   * Positivo y negativo\n     * Si la celda está activada para ese CD o no.\n   * Trace diferentes marcadores de CD entre sí\n     * Aislar poblaciones de células\n   * Puede establecer umbrales de activación para aislar el análisis en un subconjunto enriquecido de células\n\n]\n]\n\n???\n- Las células también pueden seleccionarse y caracterizarse por sus marcadores de superficie celular a través de FACS.\n- Al trazar diferentes intensidades de marcadores de superficie entre sí, las células se pueden separar, bloquear y etiquetar en función de estas propiedades fluorescentes.\n\n---\n\n# Células de código de barras\n\n.center[![Se agregan grupos de GGG y TCT a dos celdas diferentes para etiquetarlos.](../../images/scrna-intro/scrna_pbb_barcodes_add.svg)]\n\n.footnote[Agregue códigos de barras únicos a cada transcripción en una celda]\n\n???\n- Una vez aisladas, las células pueden tener un código de barras.\n- Los códigos de barras son secuencias únicas que se agregan a cada molécula de ARN.\n- No son exclusivos de la molécula, sino exclusivos de la célula, de modo que dos moléculas de ARN serán etiquetadas con el mismo código de barras de la célula, en caso de que existan en la misma célula.\n- Las moléculas de ARN de diferentes células tendrán diferentes códigos de barras de células.\n\n---\n\n# Células de código de barras\n\n.footnote[Coloque las células en la placa de secuenciación]\n\n.pull-left[![Las celdas con códigos de barras se colocan en placas en pocillos individuales según su código de barras.](../../images/scrna-intro/scrna_pbb_barcodes_overview.svg)]\n\n.pull-right[\n.reduce90[\n* De un conjunto de muchas * muchas * muestras de tejido / células diferentes:\n\n    * Los códigos de barras de celda nos dicen de qué celda se encuentra la transcripción\n    * Los UMI pueden decirnos cuánto se amplificó la transcripción, comparándola con otras transcripciones del mismo gen con la misma etiqueta UMI.\n]\n]\n\n???\nUna vez que las moléculas de ARN han sido etiquetadas por códigos de barras de células, pueden amplificarse, ya sea por separado o agrupadas, donde los productos amplificados comparten los mismos códigos de barras de células que sus contrapartes originales.\n\n---\n\n### Problemas de secuenciación: amplificación\n\n.center[.image-75[![Una caricatura de una celda con una hebra roja y azul. La hebra roja se amplifica bien, la azul no.](../../images/scrna-intro/amplification_errors.svg)]]\n\n.reduce90[\n* Reacción en cadena de la polimerasa (PCR)\n    * Toma una lectura de una sola hebra y la duplica\n    * Funciona bien cuando hay suficientes lecturas en el grupo\n* Cobertura baja\n    * Cuando las lecturas en el grupo de secuenciación son bajas, muchas se perderán\n    * Puede conducir a una amplificación unilateral\n]\n\n???\n- La PCR amplifica los productos génicos para hacerlos más fácilmente detectables durante la secuenciación.\n- Cuando hay mucho producto génico para amplificar, como es el caso de la secuencia de ARN a granel, la PCR funciona bastante bien para amplificar todos los productos de una manera razonablemente bien representada.\n- Sin embargo, en el caso de productos unicelulares, la cantidad a amplificar es muy pequeña y muchas lecturas únicas pueden perderse durante esta fase, mientras que otras pueden estar sobreamplificadas, como se muestra en las transcripciones azul y roja del ejemplo.\n\n---\n\n### Problemas de secuenciación: Amp. + UMI\n\n.pull-left[![La misma caricatura, pero ahora las hebras rojas y azules están etiquetadas con adaptadores rosas y grises. El rojo y el azul se amplifican pero a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n\n.pull-right[\n.reduce90[\n* ¿Cuántas transcripciones rojas hay en la celda?\n\n* ¿Después de la amplificación por PCR?\n\n* ¿Qué hacen las pequeñas etiquetas de colores al comienzo de cada transcripción?\n\n\n* Identificadores moleculares únicos (UMI)\n\n* Agregado para ayudar a mitigar el sesgo de la amplificación.\n]\n]\n\n???\n\n- Para protegernos contra este tipo de sesgo de amplificación, podemos agregar un elemento aleatorio al código de barras.\n- Estos códigos de barras aleatorios, conocidos como UMI, etiquetan únicamente transcripciones de modo que es probable que dos transcripciones del mismo gen tengan diferentes códigos de barras aleatorios.\n\n---\n\n### Problemas de secuenciación: Amp. + UMI\n\n.pull-left[![La misma caricatura, rojo y azul se amplifican a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n\n.pull-right[\n\n.center[Contando lecturas\n\n| | Lee |\n| ---------: |: -----: |\n| ** Rojo ** | 6 |\n| ** Azul ** | 3 |\n\n]\n]\n\n???\n- Consideremos el ejemplo de la izquierda: tenemos 2 transcripciones rojas y 2 transcripciones azules dentro de la celda, que después de la amplificación equivalen a 6 transcripciones rojas y 3 transcripciones azules.\n- Si comparáramos la expresión génica diferencial entre las transcripciones rojas y azules, con solo mirar las lecturas amplificadas, llegaríamos a la falsa conclusión de que las transcripciones rojas se expresan dos veces más que las azules.\n\n\n--\n\n.pull-left[\n\n.center[Agrupación de lecturas por gen y UMI\n\n| | ** UMI ** | ** Lee ** |\n| ---------: |: --------: |: -----------: |\n| ** Rojo ** | Rosa | 2 |\n| | Cyan | 4 |\n| ** Azul ** | Rosa | 1 |\n| | Verde | 2 |\n\n]\n]\n\n.pull-right[\n\n.center[Contando lecturas desduplicadas\n\n| | ** UMI (agrupados) ** | ** # UMI ** |\n| ---------: |: ------------------: |: -----------: |\n| ** Rojo ** | {Rosa, Cian} | 2 |\n| ** Azul ** | {Rosa, Verde} | 2 |\n\n]\n]\n\n???\nSin embargo, si agrupamos las lecturas por sus UMI, y luego contamos solo el número de UMI únicas por transcripción, eliminando la duplicación de las lecturas que comparten la misma transcripción y UMI, llegamos a 2 lecturas rojas y 2 lecturas azules que representan mejor el verdadero número de transcripciones.\n\n\n---\n\n### Problemas de secuenciación: ¿UMI únicos?\n\n\n.pull-left[![La misma caricatura, rojo y azul se amplifican a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n.pull-right[\n\n| | ** UMI ** | ** # lecturas ** |\n| ---------: |: ------------------: |: -----------: |\n| ** Rojo ** | {Rosa, Cian} | 2 |\n| ** Azul ** | {Rosa, Verde} | 2 |\n\n.reduce90[\n* El rosa aparece dos veces en genes diferentes.\n* ¿En qué contexto son únicos los UMI?\n]\n\n]\n\n???\n- Los UMI son relativamente aleatorios, pero no verdaderamente aleatorios.\n- Observe que la UMI rosa aparece dos veces: una en la transcripción azul y otra en la transcripción roja.\n\n--\n\n<br />\n\n.reduce90[\n* ¿Puede cada transcripción en una celda tener su propio UMI?\n\n* ¿Número de transcripciones de ARNm en una célula?\n   * ~ 10⁵ a 10⁶ en una célula de mamífero.\n\n* Requiere códigos de barras como mínimo de longitud * N *, donde 4ᴺ = 10⁵\n]\n\n???\nEsto se debe a que a menudo hay más transcripciones que UMI disponibles, que dependen de la cantidad de transcripciones en una celda y de la longitud del código de barras.\n\n---\n\n# Problemas de secuenciación: ¿UMI únicos?\n\n.center[Códigos de barras de longitud * N * con distancia de edición de * B *:]\n\n.pull-left[\n\n.center[* N = 5 * y * B = 1 *]\n\n```\nAAAAA AAAAC AAAAG AAAAT AAACA ····\nCCCCC CCCCA CCCCG CCCCT CCCAC ····\n              ·\n              ·\n              ·\n```\n\n.center[* 4⁵ = 1024 * códigos de barras]\n\n]\n\n.pull-right[\n\n.center[* N = 5 * y * B = 2 *]\n\n```\nAAAAA AAACC AAAGG AAATT AACCA ····\nCCCCC CCCAA CCCGG CCCTT CCCAA ····\n              ·\n              ·\n              ·\n```\n\n.center[* 4⁵⁻¹ = 512 * códigos de barras]\n\n]\n\n.footnote[\n\nLas distancias de edición protegen contra ** errores de secuenciación. **\n\n]\n\n???\n\n- Considere un conjunto de códigos de barras de longitud 5 con una distancia de edición de 1 entre códigos de barras adyacentes y otro conjunto con una distancia de edición de 2.\n- El primero no es robusto contra los errores de secuenciación comunes de 1 par de bases, pero el segundo solo permite la mitad del número de códigos de barras.\n- Esta compensación entre la cantidad de códigos de barras disponibles y la protección contra errores de secuencia es fundamental en el diseño de códigos de barras de celda y UMI.\n\n---\n\n# Problemas de secuenciación: ¿UMI únicos?\n\n.pull-left[![La misma caricatura, rojo y azul se amplifican a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n.pull-right[\n\n| | ** UMI ** | ** # lecturas ** |\n| ---------: |: -------------: |: ----------: |\n| ** Rojo ** | {Rosa, Cian} | 2 |\n| ** Azul ** | {Rosa, Verde} | 2 |\n\n.reduce90[\n* El rosa aparece dos veces en genes diferentes.\n* ¿En qué contexto son únicos los UMI?\n\n<br />\n<br />\n\n]\n\n]\n\n.reduce90[\n* ¿En qué contexto son únicos los UMI? *\n  * Los UMI son \"sal aleatoria\"\n    * 'Suficientemente único' a nivel de transcripción\n\n  * Deseamos contar solo las transcripciones\n    * Desduplicación de UMI a nivel de expediente académico\n    * Buena estimación de la verdadera abundancia de transcripciones\n]\n\n???\nEn el contexto de la amplificación, las UMI no necesitan ser únicas, solo necesitan ser lo suficientemente aleatorias para deduplicar las transcripciones a fin de dar una estimación más precisa del número de transcripciones dentro de una celda.\n\n---\n\n# Códigos de barras de celda y UMI (resumen)\n\nPara cada celda:\n\n1. Agregar códigos de barras de celda a celdas\n! [Se agregan grupos de GGG y TCT a dos celdas diferentes para etiquetarlas.](../../images/scrna-intro/scrna_pbb_barcodes_add.svg)\n\n???\nAsí que recapitulemos lo que hemos aprendido: primero, cada celda tiene códigos de barras de celda agregados a cada molécula de ARN en cada celda.\n\n---\n\n# Códigos de barras de celda y UMI (resumen)\n\nPara cada celda:\n\n1. Agregar códigos de barras de celda a celdas\n1. Agregar UMI a celdas con código de barras de celda\n! [Se muestran mezclas aleatorias de códigos de barras de tres letras, además de las dos celdas de la última caricatura que tenían GGG en una y lecturas etiquetadas TCT en la otra celda. Ahora todos tienen prefijos aleatorios antes del GGG en una celda y TCT en la otra.](../../images/scrna-intro/scrna_umi_add.svg)\n\n\n???\n- Luego agregamos UMI aleatorias a todas las transcripciones, que etiquetan aún más las moléculas.\n- Estos se pueden utilizar para deduplicar las transcripciones después de la amplificación.\n- Después de la amplificación necesitamos realizar algún control de calidad.\n\n---\n\n# QC: Superar el ruido de fondo\n\n.center[![Una matriz de genes 1, 2, 3 y células por columna se cambia en dos matrices, una con recuentos de genes detectados por célula y recuentos de células detectadas por gen](../../images/scrna-intro/raceid_libsize.svg)]\n\n* Num. características por celda y el tamaño de la biblioteca deben seguir una curva normal.\n* El filtrado Min-Max ayuda a cortar las colas gruesas de una distribución.\n\n???\n- Una forma de hacerlo es establecer umbrales en los límites de detectabilidad de genes y células.\n- Considere un análisis gobernado solo por 3 genes (G1, G2 y G3) y 5 células (A, B, C, D y E).\n- La primera fila de la tabla superior define el tamaño de la biblioteca, que es el número total de ARN mensajeros en todos los genes de cada célula.\n- Las filas siguientes son los umbrales de detectabilidad de genes, que muestran cuántos genes se detectan en cada célula para genes superiores a las cantidades umbral de 0 a 4.\n- Vemos que incluso un umbral de más de 3 transcripciones detectadas en una celda determinada todavía mantiene 3 celdas en el análisis: B, C y E. En la tabla inferior, se representa lo contrario, con el número total de transcripciones en todos células para cada gen.\n- Al establecer umbrales de detectabilidad, podemos ver cuántas células describe el gen para ese umbral.\n- En ambos casos, podemos ver que si establecemos los umbrales demasiado bajos, corremos el riesgo de mantener genes o células de baja calidad, pero si establecemos los umbrales de detectabilidad demasiado altos, corremos el riesgo de perder demasiados.\n\n---\n\n# Normalización: Bulk vs Single-Cell\n\n.pull-left[\n\n* Bulk RNA-seq *: Cobertura alta\n\n| | T1 | T2 | T3 |\n|: ----------- | ----: | ---: | ---- |\n| ** GeneA ** | 100 | 80 | 40 |\n| ** GeneB ** | 45 | 30 | 40 |\n\n.reduce70[* La expresión genética media es alta]\n\n\n<br />\n\n* scRNA-seq *: Profundidad de secuenciación muy baja\n\n| | C1 | C2 | C3 | C4 | C5 |\n|: ----------- | ---: | ---: | ---: | ---: | ---: |\n| ** GeneA ** | 0 | 0 | 2 | 0 | 1 |\n| ** GeneB ** | 2 | 0 | 15 | 0 | 0 |\n\n.reduce70[* La expresión genética media es cero]\n\n]\n\n\n.pull-right[\n\n__¿Por qué es esto un problema?__\n\n.center[\n$$R(s,g) = \\frac{X\\\\_{sg}}{(\\prod\\\\_{s} X\\\\_{s})^{\\frac{1}{n}}}$$\n\n$$DESeq(s,g) = \\frac{X\\\\_{sg}}{Med(R\\\\_{s})}$$\n\n]\n]\n\n???\n- Sin embargo, el filtrado puede ser un lujo, ya que muchos conjuntos de datos de secuencia de ARN de una sola célula tienen normalmente una profundidad de secuenciación baja en comparación con la secuencia de ARN en masa.\n- Durante el proceso de normalización, las muestras se comparan entre sí para hacerlas más comparables.\n- Esto se realiza normalmente mediante el uso de valores medianos. Por ejemplo, para la normalización DE-Seq, se toma el recuento de la media geométrica de una célula y cada valor de gen en esa célula se divide por él y por el valor mediano de todas las medias geométricas de todas las células.\n- Si la expresión génica mediana es alta, este método de normalización funciona bastante bien.\n\n--\n\n.pull-right[\n¡No se puede dividir por cero!\n]\n\n???\n- Pero si la expresión génica mediana es cero, como suele ocurrir con los datos de una sola célula, entonces tenemos el problema de dividir por cero.\n- Existen métodos para sortear estos recuentos de cero.\n\n---\n\n# Normalización: método SCRAN\n\n.footnote[.small[[* Combinación de células para normalizar los datos de secuenciación de ARN de una sola célula con muchos recuentos cero *, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n.pull-left[![Las burbujas azules y rojas se mezclan, luego se separan en dos grupos y luego se organizan alrededor de un círculo, el rojo va de pequeño a grande alrededor de la mitad derecha, azul de pequeño a grande alrededor de la izquierda. La parte inferior del círculo tiene la etiqueta 6, la parte superior tiene la etiqueta 12.](../../images/scrna-intro/scran_pooling_left.svg)]\n\n.pull-right[\n.reduce90[\n1. Calcule el tamaño de la biblioteca de todas las celdas.\n\n1. Calcule el tamaño de la biblioteca de una celda de pseudo referencia (promedio)\n\n1. Separe los tamaños impares (rojo) y los tamaños pares (azul) en dos grupos\n\n1. Ordene cada grupo por tamaño de biblioteca y colóquelo en lados opuestos de un \"anillo\"\n]\n]\n\n???\n- Uno de estos métodos es el método SCRAN, que funciona creando grupos de celdas superpuestas, de modo que cualquier celda individual se caracteriza por celdas de tamaños de biblioteca similares.\n- El método implica dividir todas las celdas en un grupo par e impar por el tamaño de su biblioteca, y organizarlas en una estructura de anillo donde las celdas vecinas en el anillo tienen tamaños similares.\n\n---\n\n# Normalización: método SCRAN\n\n.footnote[.small[[* Combinación de células para normalizar los datos de secuenciación de ARN de una sola célula con muchos recuentos cero *, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n\n.pull-right[![El mismo gráfico final con círculos azules y rojos de tamaño creciente con una flecha que apunta a una gran cantidad de fórmulas que se superponen.](../../images/scrna-intro/scran_pooling_right.svg)]\n\n.pull-left[\n.reduce90[\n1. Defina grupos superpuestos de celdas adyacentes de tamaño * k *\n\n1. Para cada grupo\n     1. Sume los tamaños de biblioteca de todas las celdas dentro\n     1. Obtenga un factor de tamaño dividiendo por la celda de referencia\n\n1. Para cada celda\n     1. Encuentra las piscinas a las que pertenece\n     1. Construya un modelo lineal usando estos factores de tamaño\n     1. Estime el factor de tamaño de la celda en este modelo lineal\n]\n]\n\n???\n- Se definen grupos superpuestos de tamaños fijos, lo que da como resultado que cada celda sea definida por múltiples grupos.\n- Los grupos en los que se encuentra se pueden construir un modelo lineal para esa celda, y los factores de normalización para todas las celdas se pueden determinar de esta manera.\n\n---\n\n# Normalización: método SCRAN\n\n.footnote[.small[[* Combinación de células para normalizar los datos de secuenciación de ARN de una sola célula con muchos recuentos cero *, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n\n.center[![Los dos gráficos anteriores ahora en un gráfico.](../../images/scrna-intro/scran_pooling.svg)]\n\n???\n- Con este método, el problema de la cobertura de secuencia baja se soluciona convirtiendo las celdas con tamaños de biblioteca bajos en componentes útiles de un factor de tamaño que se puede aplicar a celdas similares.\n- Estos métodos de normalización novedosos eran comunes hace unos años, pero a medida que las tecnologías de secuenciación han mejorado, el problema de muchos recuentos cero en una matriz se vuelve menos importante y los factores de tamaño de normalización se pueden derivar utilizando métodos de secuencia de ARN a granel una vez más.\n\n\n---\n\n# Variación deseada vs no deseada\n\n.pull-right[![Tres gráficos de líneas superpuestos que mapean la variación que contribuye a la densidad. Se muestra que los genes Top N aumentan en densidad a medida que aumenta la varianza contribuyente, que genes por célula, transcripciones y fuente de lote disminuyen.](../../images/scrna-intro/variance.svg)]\n\n.pull-left[\n.reduce90[\n* Variación deseada *\n   * Expresión de los genes superiores expresados de forma más diferencial\n\n* Variación no deseada *\n   * \"Factores de confusión\"\n   * Variación técnica\n      * Fuente de lote\n      * Tamaño de la biblioteca\n   * Variación biológica\n      * Ruido celular intrínseco\n]\n]\n\n???\n- Otros factores que debemos tener en cuenta durante un análisis de ARN de una sola célula son los factores no deseados que pueden confundir el análisis.\n- Lo ideal sería que los perfiles genéticos que separan los diferentes tipos de células estén impulsados por la variación biológica.\n- Sin embargo, existe una variación confusa tanto de fuentes técnicas como biológicas que no son útiles para el análisis pero contribuyen a la variación.\n\n---\n\n# Variación confusa: biológica\n\n.center[![Una caricatura a la izquierda muestra un signo de interrogación con flechas que indican nada y se muestran las transcripciones. A la derecha están las fases del ciclo celular y diferentes cantidades de transcripciones en cada fase.](../../images/scrna-intro/raceid_cellcycle.svg)]\n\n.pull-left[\n.reduce90[\n.center [* Transcripción por ráfagas *]\n  * La transcripción no es continua, ocurre en \"ráfagas\"\n  * Fenómeno oculto en la secuencia de ARN a granel\n]\n]\n\n.pull-right[\n.reduce90[\n.center[*Ciclo celular*]\n * Las células del mismo tipo tienen el doble de ARNm en la fase M que en la fase G1\n]\n]\n\n???\n- La variación biológica de confusión aparece en dos formas: explosión transcripcional y variación del ciclo celular.\n- El estallido transcripcional es un fenómeno que ocurre en células en las que la transcripción ocurre en estados discretos de activo e inactivo, donde el intervalo entre estos estados es difícil de modelar.\n- En la secuencia de ARN a granel, este fenómeno es imperceptible ya que los efectos se promedian en muchas células. Pero en una sola célula, dos células del mismo tipo pueden exhibir diferentes perfiles genéticos simplemente porque una célula estaba transcribiendo activamente y la otra no.\n- Esto no es algo que podamos controlar en el análisis, pero es algo de lo que debemos ser conscientes al comprender por qué los grupos de células pueden ser ruidosos.\n- La variación del ciclo celular, por otro lado, es un proceso mucho mejor entendido, donde la cantidad de ARN en una célula es aproximadamente el doble que la de una célula del mismo tipo debido a que una se encuentra en la fase G1 temprana y la otra en la fase G1 temprana. Fase M durante el ciclo celular.\n- Hay genes que se sabe que covarían con el ciclo celular, por lo que al hacer una regresión del efecto de estos genes, podemos controlar el ciclo celular.\n\n\n---\n\n# Variación confusa: técnica\n\n.center[![La variación del tamaño de la biblioteca apunta a dos celdas con transcripciones rojas y azules en números idénticos. Sin embargo, durante la amplificación en una celda produce resultados, mientras que en la otra se elimina el azul.](../../images/scrna-intro/raceid_technical_variation.svg)]\n\n.pull-left[\n.reduce90[\n* Sesgo de amplificación *\n* Diferentes transcripciones se amplifican más que otras\n* Mitigado a través de UMI\n]\n]\n\n.pull-left[\n.reduce90[\n*Eventos de abandono*\n* Algunos genes no se detectan falsamente en las células.\n* Mitigado mediante mejores métodos de captura y normalización\n]\n]\n\n???\n- La variación técnica confusa aparece en tres formas: sesgo de amplificación, eventos de abandono y variación del tamaño de la biblioteca.\n- El sesgo de amplificación puede mitigarse mediante UMI como se demostró anteriormente.\n- Los eventos de deserción dan lugar a los ceros predominantes en las matrices de recuento, y su efecto se puede reducir utilizando técnicas de normalización inteligentes como el método de agrupación mostrado anteriormente, así como utilizando mejores métodos de secuenciación.\n\n---\n\n# Variación confusa: técnica\n\n.center[![La variación del tamaño de la biblioteca apunta a dos celdas con transcripciones rojas y azules en números idénticos. Sin embargo, durante la amplificación en una celda produce resultados, mientras que en la otra se elimina el azul.](../../images/scrna-intro/raceid_technical_variation.svg)]\n\n* Variación del tamaño de la biblioteca *\n* Las células tienen diferentes tasas de transcripción y captura.\n* Mitigado mediante normalización\n\n???\n- La variación del tamaño de la biblioteca surge por una variedad de razones diferentes, pero es la principal fuente de variación dentro de un análisis.\n- Al igual que la secuencia de ARN en masa, esto se reduce con buenos métodos de normalización.\n\n---\n\n# Relaciones entre celdas\n\nConsiderar:\n * Miles de células\n * 10.000 de genes\n * Conjunto de datos de 10k dimensiones, con 1k observaciones\n\nApuntar:\n * Encuentra agrupaciones de células en un subconjunto de estos genes\n\nNota:\n* Algunas células pueden tener una expresión muy similar en un gen y una expresión muy diferente en todos los demás.\n* ¿Cómo representar esto?\n\n???\n- Una vez que hemos eliminado los factores de confusión no deseados del análisis, tenemos el problema de cuantificar las relaciones entre las células.\n- Desde el punto de vista del análisis de datos, tratamos a cada célula como una observación y a cada gen como una variable.\n- Para genomas grandes, esto significa conjuntos de datos de dimensiones extremadamente altas. Las células existen como puntos en este espacio de alta dimensión extremadamente escasamente poblado, lo que dificulta ver las agrupaciones naturales.\n- El espacio de alta dimensión se puede reducir mucho simplemente filtrando los genes que no parecen expresarse diferencialmente en todas las células.\n- Sin embargo, para encontrar las relaciones entre estas celdas, necesitamos definir las distancias entre las celdas.\n\n---\n\n# Matriz de distancia\n\n! [Se traza una matriz de recuento de genes frente a células en un espacio N-dimensional con cada gen representando los diferentes ejes. Se muestra una fórmula de distancia para 3 dimensiones, y luego se muestra una tabla final de la matriz de conteo con las distancias entre cada una de las celdas. según sus genes.](../../images/scrna-intro/raceid_distance.svg)\n\n???\n- Una matriz de distancias hace exactamente esto, definiendo la distancia entre dos celdas cualesquiera mediante una sola puntuación.\n- Aquí usamos la distancia euclidiana en un conjunto de datos tridimensional de 3 genes (G1, G2 y G3) y 3 células (R, P y V).\n- La distancia entre dos células cualesquiera se puede calcular como la suma de los cuadrados de la diferencia en los valores de los genes.\n- Observe cómo la matriz de distancias es simétrica a lo largo de la diagonal, lo que confirma que, por ejemplo, la distancia de las celdas R a V es la distancia de V a R como se esperaba.\n\n---\n\n# Relación de células: KNN\n\n! [Se muestra un gráfico de células en tres genes con la etiqueta conjunto de datos de alta dimensión de células. Esto produce una matriz de distancia (simétrica) y luego a través de KNN con k = 2, una matriz no simétrica. Esto luego se traza nuevamente en el espacio de dimensión genética para mostrar las conexiones entre las células.](../../images/scrna-intro/scrna_knn.svg)\n\n* Realice * K vecinos más cercanos * para conectar los bordes a los vértices de la celda.\n\n???\n- Una vez que se genera una matriz de distancia, podemos realizar K vecinos más cercanos sobre la matriz de distancia donde se generan bordes dirigidos entre celdas.\n- Para cada fila de la matriz de distancia, se seleccionan K de las celdas con los valores de distancia más pequeños que representan el vecino más cercano que tiene la celda de la fila actual a las celdas de la columna seleccionada.\n- Si los bordes se comparten mutuamente entre celdas vecinas, esto se denomina enfoque de vecino más cercano compartido.\n\n\n---\n\n# Reducción dimensional\n\n! [La matriz de genes frente a células se traza en dimensiones genéticas y luego se reduce a 2 dimensiones.](../../images/scrna-intro/raceid_dimred.svg)\n\n.pull-left[\n.reduce90[\n*Apuntar:*\n* Tome un conjunto de datos de alta dimensión y redúzcalo a una dimensión más baja que podamos entender.\n   * p.ej. 10000-D → 2D\n]\n]\n\n.pull-right[\n.reduce90[\n*Restricción*\n* Conservar la topología de alta dimensión en un espacio de baja dimensión.\n    * p.ej. si la celda A está lejos de la celda D pero cerca de la celda B en 3D, debería replicar esas relaciones en 2D.\n]\n]\n\n???\n- Podemos representar este espacio tridimensional fácilmente como 3 ejes independientes con puntos que denotan las celdas.\n- Extrapolar este conjunto de ejemplos de dimensiones relativamente bajas a un conjunto de datos reales de miles de dimensiones que está más allá del alcance de la posibilidad humana.\n- La reducción dimensional es un tipo de técnica que toma un conjunto de datos de alta dimensión y produce una representación de baja dimensión, generalmente bidimensional, que intenta preservar las distancias entre los puntos de datos.\n- Aquí las diferencias relativas entre celdas se mantienen tanto en las representaciones de alta y baja dimensión.\n- Hay muchos tipos diferentes de técnicas de reducción de dimensiones, cada una con sus propias fortalezas y debilidades que dependen del tipo y la dimensionalidad de los datos.\n\n\n---\n\n### Agrupación\n\n.pull-left[.image-100[! [Un diagrama de dispersión con muchos grupos de celdas etiquetadas con diferentes colores. Las células están agrupadas en gran parte bien, con pocas células periféricas.](../../images/scrna-intro/singlecellplot3.png)]]\n\n.pull-right[\n.reduce90[\n1. Proyección 2D\n    * Cada punto es una celda\n    * Agrupar colorea los puntos, donde las celdas de diferentes colores pertenecen a diferentes grupos\n    * Los diferentes grupos representan diferentes tipos de células.\n]\n]\n\n???\n- Una vez que el número de variables del conjunto de datos se ha reducido lo suficiente mediante el filtrado y la reducción dimensional, la agrupación se puede realizar más fácilmente.\n- Aquí, en esta proyección 2D, cada círculo es una celda y los colores únicos representan los grupos a los que han sido asignados.\n- Las distancias físicas entre los grupos de celdas coloreadas nos dicen qué tan bueno es el agrupamiento para esta proyección.\n\n\n---\n\n### Agrupación\n\n.pull-left[.image-100[! [El mismo diagrama de dispersión con agrupamiento que antes, pero ahora los grupos están etiquetados como Neuronas, NSC, Glial Prog., Astrocitos, etc.](../../images/scrna-intro/singlecellplot4.png)]]\n\n.pull-right[\n.reduce90[\n1. Proyección 2D\n1. Tipos de células discretas\n   * Cada grupo debe representar un tipo diferente\n   * Busque la mayor cantidad de genes DE en cada grupo\n     * Encuentra los genes marcadores → Tipo de célula\n]\n]\n\n???\n- Al inspeccionar los principales genes expresados diferencialmente en cada grupo frente a todos los demás grupos, se pueden encontrar pistas sobre el tipo de célula que describe el grupo.\n- Los tipos de células a menudo se caracterizan por la expresión de genes marcadores específicos, y la presencia de estos genes son fuertes indicadores del tipo.\n- El descubrimiento de genes marcadores se puede utilizar para anotar los grupos.\n\n\n---\n\n### Agrupación\n\n.pull-left[.image-100[![El mismo gráfico etiquetado, pero ahora las flechas conectan los siguientes grupos de tipos de celdas más cercanos.](../../images/scrna-intro/singlecellplot6.png)]]\n\n.pull-right[\n.reduce90[\n1. Proyección 2D\n1. Tipos de células discretas\n1. Las relaciones infieren linaje\n   * Las células madre neurales se diferencian en tipos de células maduras.\n   * Los árboles de linaje se construyen teniendo en cuenta\n      * Entropía del racimo\n      * Proximidad de cluster\n]\n]\n\n???\nTambién podemos derivar aún más las relaciones entre estos grupos calculando árboles de linaje en función de la cantidad de ruido en cada grupo, con la expectativa de que las células madre tengan perfiles de expresión ruidosos que produzcan grupos más amplios, y las células maduras tengan perfiles de expresión muy claros que produzcan grupos más ajustados.\n\n\n---\n\n## Agrupación: Difícil vs Suave\n\n|  |  |\n|--|--|\n| .image-100[![Mismo conjunto de grupos distintos con una separación muy clara](../../images/scrna-intro/singlecellplot3.png)] | .image-100 [! [Los clústeres ahora se mezclan entre sí, y la separación no es clara.](../../images/scrna-intro/10xdata.png)] |\n| .center[**Duro**] | .center[**Suave**] |\n|Grandes espacios entre clusters | Los racimos se mezclan entre sí |\n| Los tipos de células están bien definidos y la agrupación refleja que | Los tipos de células parecen entremezclarse entre sí. |\n\n\n???\n- Los tipos de agrupación que es probable que encuentre en un análisis dependen de los conjuntos de datos de entrada, donde es menos probable que las celdas tomadas de muestras de la etapa tardía se agrupen juntas y es más probable que produzcan grandes lagunas visibles conocidas como agrupaciones duras que están claramente definidas diferentes tipos.\n- Es más probable que los conjuntos de datos de etapas anteriores produzcan clústeres más suaves, donde los clústeres vecinos comparten límites suaves a medida que los clústeres se entremezclan ligeramente entre sí.\n\n---\n\n# Fenotipos continuos:\n\n.center[![El gráfico muestra el tiempo de desarrollo de los reticulocitos a medida que pasan por una fase celular intermedia o rara, hasta su forma final: glóbulos rojos.](../../images/scrna-intro/raceid_contpheno.svg)]\n.reduce90[\n* Las celdas no son discretas, hacen transición\n* Continuamente cambiando con el tiempo de un tipo menos maduro a un tipo más maduro.\n]\n\n???\nEs de esperar un agrupamiento suave, ya que aunque el agrupamiento es un método estadístico para dividir datos de manera discreta, la biología celular subyacente de los datos es un proceso continuo, donde las células pasan de un estado bien definido a otro a través de etapas intermedias que se representan en entre dos centros de grupos.\n\n---\n\n## Realización de agrupación en clústeres\n\n.pull-left[\n! [Perfiles de expresión discretos: Se muestran tres montañas con nubes, solo vemos tres picos. Las celdas en rojo, verde y azul se muestran en los picos. Paisaje de expresión continua: las nubes se eliminan y vemos que las montañas están realmente conectadas y hay celdas intermedias en varios colores intermedios.](../../images/scrna-intro/raceid_mountains.svg)\n]\n\n.pull-right[\n.reduce90[\n* Conjuntos de datos dinámicos con clústeres continuamente dinámicos *\n  * conjuntos de datos de una sola celda\n  * PCA es demasiado discreto en la partición de datos\n  * Múltiples algoritmos de aprendizaje, aprende el panorama.\n\n\n* Variedad de diferentes métodos de agrupación *\n\n  * K-significa\n  * K-medianas\n  * Agrupación jerárquica\n  * Agrupación comunitaria\n]\n]\n\n\n???\n- Debido a la naturaleza continua de estos conjuntos de datos de celda única y la dimensionalidad extremadamente alta de los datos, la partición discreta es a menudo un modelo deficiente para la partición de datos.\n- Si, en cambio, asumimos que los grupos de células están relacionados entre sí a través de células de transición que naturalmente se encontrarían entre grupos, entonces las múltiples técnicas de aprendizaje son más adecuadas.\n- Estas técnicas derivan un paisaje de expresión que no solo se puede usar para relacionar grupos entre sí, sino que también se puede usar para inferir linaje y jerarquía.\n- Para realizar realmente la agrupación en clústeres, hay tres métodos de uso común: K-medias, agrupación jerárquica y comunitaria.\n\n---\n\n### Realización de agrupación en clústeres: K-means\n\n.pull-right[![Una figura animada que muestra varias iteraciones de un algoritmo que optimiza una división de 3 vías entre un diagrama de dispersión de celdas. No hay un límite claro que haga que el resultado final parezca solo un poco mejor.](../../images/scrna-intro/kmeans.gif)]\n\n.pull-left[\n.reduce90[\n* K-significa *\n    1. Inicializar * k * posiciones aleatorias\n    1. Paso de iteración:\n       1. Calcule la distancia desde cada celda a cada posición * k *\n       1. Asigne cada celda a su * k * más cercano\n       1. Establezca nuevas posiciones * k * en la posición media de todas las celdas de ese grupo.\n\n* K-medianas *\n    * Igual que el anterior, pero use la posición mediana en su lugar\n    * Menos influenciado por valores atípicos\n\n]\n]\n\n???\n- K-medias y K-medianas siguen el mismo método: el número de grupos se define de antemano y se inicializa en posiciones aleatorias.\n- Las posiciones se actualizan luego por la contribución de las celdas más cercanas a él que a otras posiciones.\n- Este proceso se produce varias veces hasta que las posiciones ya no cambian significativamente o hasta que se ha logrado un número determinado de iteraciones.\n- La asignación final de cada celda se convierte en la asignación de grupo.\n\n---\n\n## Realización de clústeres: jerárquico\n\n.pull-left[![Una cifra de muchos pasos que comienza con varios puntos individuales. El texto dice \"identificar los dos grupos más cercanos\" y \"fusionar los dos grupos más similares\". El proceso se repite varias veces hasta que todos los clústeres se absorben en un blob grande.](../../images/scrna-intro/hierarchal1.png)]\n\n.pull-right[\n.reduce90[\n* Usa la matriz de distancias para encontrar los dos puntos más cercanos\n* Fusionar y repetir\n\n* Produce un dendrograma.\n   * Jerarquía de clústeres:\n]\n\n.image-90[![Varios puntos en un cuadrado están etiquetados de la A a la F, a la derecha se muestra un dendrograma con longitudes que indican qué tan cerca están las letras entre sí.](../../images/scrna-intro/hierarchal2.png)]\n]\n\n???\n- La agrupación jerárquica en clústeres es más flexible y no necesita un parámetro inicial para definir el número de clústeres resultantes.\n- Aquí los dos puntos más cercanos en una matriz de distancias se unen en un solo grupo, las distancias se recalculan y los dos puntos más cercanos se vuelven a unir.\n- Este proceso se repite hasta que todos los datos se han consumido en uno.\n- Al rastrear el proceso hacia atrás, se puede establecer una jerarquía que está representada por un dendrograma.\n\n---\n\n\n## Agrupación comunitaria: Louvain\n\n.center[![Se muestra un gráfico con puntos conectados por líneas. Abajo, esos puntos se han expandido y el rosa toca naranja y casi toca morado. ¿Pregunta rosa por sí mismo? Y anota 4 enlaces externos y 0 enlaces internos. Se muestran dos opciones hipotéticas, si el rosa absorbe el morado, vemos 5 conexiones externas y 1 interna, entonces, se agregan nuevas conexiones. Una X sugiere que esto está mal. A continuación se muestra la opción naranja absorbe rosa, donde vemos 3 conexiones externas y 1 interna, por lo que una conexión se ha convertido en interna y no hay nuevos nodos conectados. Una marca de verificación indica que esto era correcto.](../../images/scrna-intro/commgraph1.svg)]\n\n.reduce90[\nObjetivo: maximizar los enlaces internos y minimizar los enlaces externos\n]\n\n???\n- El agrupamiento de Louvain es un tipo de agrupamiento comunitario ampliamente utilizado para datos de una sola celda.\n- Aquí a cada celda se le asigna un vecindario propio y se cuenta el número de enlaces internos y externos entre vecindarios.\n- Para cada iteración, se selecciona una celda aleatoria y se coloca dentro de la vecindad de otra celda, y los enlaces internos y externos se cuentan una vez más.\n- Si la nueva configuración ha reducido el número de enlaces externos a favor de más enlaces internos, entonces se mantiene la configuración.\n\n---\n\n## Agrupación comunitaria: Louvain\n\n.center[![El mismo gráfico que antes, pero ahora hay más grupos más grandes. El azul y el violeta se absorbieron, el amarillo y el rojo se absorbieron, y vemos un gráfico simplificado de 4 nodos.](../../images/scrna-intro/commgraph2.svg)]\n\n.reduce90[\n* Elija una celda al azar e intente colocarla en el grupo de un vecino\n   * Aceptar si Interna: Externa aumenta\n   * Rechazar y elegir otro\n]\n\n???\nSi, en cambio, la nueva configuración ha aumentado el número de enlaces externos, la configuración se rechaza y se selecciona y prueba otra celda. Al realizar esto varias veces, se construye una estructura comunitaria de células con el grado de especificidad que desee el usuario.\n\n---\n\n# Resumen\n\n.pull-left[![Se muestran grupos de células rojas y azules que se asemejan a las manchas de tejido. Los gráficos de la derecha para la expresión en los genes A, B, X se muestran por celda](../../images/scrna-intro/rna_cells_singlerez.svg)]\n\n.pull-right[\n.reduce90[\n* Los conjuntos de datos de una sola celda son vastos y están escasamente poblados\n\n* Se requiere filtrado y normalización de calidad\n\n* La selección de funciones y la reducción de dimensiones reducen la complejidad\n\n* La agrupación denota tipos de células y relaciones de células\n\n* scRNA-seq es un campo impulsado estadísticamente\n\n* Muchas formas de analizar los datos.\n  * ¡Juega con ello!\n]\n]\n\n???\n- El análisis de celda única no es trivial, y cada etapa, desde el filtrado hasta la normalización, la reducción de dimensiones y el agrupamiento, puede afectar drásticamente el resultado del análisis.\n- Debido a la variabilidad en el análisis, uno no debe entrar en pánico ante la incertidumbre.\n- El objetivo es jugar con los datos hasta que comience a reflejar la biología.\n- Esto puede requerir muchos intentos para lograrlo, y puede que nunca sea perfecto, pero la idea es probar tantas formas diferentes como sea posible para ver a qué conclusiones sólidas puede llegar.\n\n---\n\n### Análisis de datos de scRNA-seq adicional\n\n![Captura de pantalla de los materiales de entrenamiento de la galaxia que cubren una sola celda](../../images/scrna-intro/training_single_cell.png)\n\n???\n- En este sentido, los vastos recursos de UseGalaxy pueden aprovecharse probando los diferentes caminos del análisis, y Galaxy Training Network ofrece tutoriales y capacitaciones prácticas para ayudarlo en este sentido.\n- Explórelos para desarrollar mejor su comprensión.\n","# Single-cell RNA-seq\n\nUna introducción al análisis de datos scRNA-seq\n\n???\n- Hola a todos y bienvenidos al taller de análisis single cell RNA-seq de Galaxy\n- Aquí les enseñaremos algunos de los conceptos básicos del análisis de datos single cell.\n---\n\n\n## RNA-seq conjunto\n\n.pull-left[![Se muestran dos manchas etiquetadas como tejido A y tejido B, a la derecha se muestra la expresión promedio de los genes A, B y X por tejido](../../images/scrna-intro/rna_cells_bulkrez.svg)]\n\n.pull-right[\n.reduce90[\n.center[*Resumen*]\n\n| | |\n|-:|:-|\n| Resolución| Tejido entero |\n| Señal | Expresión génica promedio por tejido |\n| Expresión diferencial | Diferencia entre la expresión génica promedio entre los tejidos |\n]\n]\n\n\n???\n- Vamos a comenzar con las diferencias entre Bulk RNA-seq y single cell RNA-seq data.\n- Con el método Bulk RNA-seq observamos la expresión promedio de cada gen detectado en cada uno de los tejidos.\n- Debido al número de moléculas de ARN que están siendo consideradas, la profundidad de la secuenciación y la fuerza del análisis son razonablemente altas.\n- La expresión diferencial se mide entonces como la expresión relativa de un gen dado entre un tejido y otro.\n\n---\n\n## Single Cell RNA-Seq\n\n.pull-left[![Se muestran grupos de células rojas y azules que se asemejan a las manchas de tejido de la diapositiva anterior. Los gráficos de la derecha muestran la expresión de los genes A, B, X por célula en lugar de por tejido.](../../images/scrna-intro/rna_cells_singlerez.svg)]\n\n.pull-right[\n.reduce90[\n.center[*Resumen*]\n\n| | |\n|-:|:-|\n| Resolución | Células individuales dentro de los tejido |\n| Señal | Expresión individual de un gen por cada célula |\n| Expresión Diferencial | Algunas células expresan de la misma manera el mismo grupo de genes; comparando un grupo de células contra otro |\n]\n]\n\n\n???\n- Con el análisis single cell, la etapa de medir la expresión promedio de un tejido se aleja.\n- Y se dirige específicamente hacia la expresión génica de cada célula en esos tejidos.\n- Aquí ya no comparamos tejido contra tejido, sino célula contra célula.\n- Cada célula tiene un perfil genético asignado que describe la abundancia relativa de los genes que se le han detectado.\n- Muchas células comparten el mismo perfil genético, donde idealmente un perfil genético describe un tipo de célula.\n- A veces se necesita comparar conjuntos de datos de células individuales entre tejidos, y se observa que muchas células de los diferentes tejidos comparten el mismo tipo de células.\n- Por ejemplo, observe los perfiles genéticos púrpura y verde que están presentes en ambos tejidos.\n\n\n---\n\n# From Bulk RNA to Single Cell RNA\n\n.image-50[![Los tejidos A y B de la primera diapositiva se muestran como colecciones de células de la segunda diapositiva.](../../images/scrna-intro/rna_cells_bulk2single.svg)]\n\n.reduce90[\n* Para cuantificar el ARN a nivel de las células individuales:\n  * Nuevos métodos de preparación de librerías\n  * Nuevos métodos de secuenciación\n  * Nuevos métodos de control de calidad\n  * Nuevos métodos de análisis\n]\n\n???\n- Nuevas tecnologías implican nuevos métodos y técnicas para aprovechar las  características nuevas que estas traen consigo.\n- Los datos single-cell RNA-seq requieren diferentes medios de preparación de librerías, secuenciación, control de calidad y análisis\n\n---\n\n# Captura Celular y Replicados\n\n.center[*¿Cómo preparamos las muestras para la secuenciación?*]\n\n???\nPor ejemplo, ¿Cómo se capturan y secuencian las células?\n\n--\n\n.pull-left[\n.reduce90[\n\n__Bulk RNA-seq__\n\n  1. Corta finamente una parte el tejido\n  1. Agrega la enzima para degradar la pared celular\n  1. Enjuaga el ADN / ARN no deseado\n  1. Realiza la secuenciación del material restante (Perform sequencing on leftover goop\n)\n\n]\n]\n\n???\nEn el análisis bulk RNA-seq, el proceso incluye tomar una muestra, remover las moléculas no deseadas y secuenciar todo lo demás.\n\n--\n\n.pull-left[\n.reduce90[\n\n__Single-cell RNA-seq__\n\n  1. Corta finamente una parte el tejido\n  1. Descomponer el tejido en células\n  1. Aislar cada célula\n     * Agrega la enzima para degradar la pared celular\n     * Realizar el “barcoding”\n  1. Realizar la secuenciación en un grupo común\n\n]\n]\n\n???\n- Para el análisis single cell, el proceso es muy similar, excepto que cada muestra es una célula.\n- Y por lo tanto, debe ser secuenciado separadamente de las otras células.\n- Una vez aisladas, se agregan códigos de barra únicos a cada célula y luego se secuencian.\n\n\n--\n\n__Replicados Biológicos__\n\n.center[\n.reduce90[\n\n|  |  |\n|--------:|:-----------|\n| **Bulk RNA-seq** | Cada corte del tejido es una muestra, puede tomar otro corte |\n| **Single-cell RNA-seq** | Cada célula es una muestra, no puede tener un replicado porque es única |\n]\n]\n\n???\n- El nivel de resolución en single-cell es al nivel de la célula y cada célula es única.\n- Por lo tanto, el concepto de replicado biológico no es exactamente el mismo que en el bulk RNA-seq.\n\n\n---\n\n# Captura / Clasificación:\n\n*¿Cómo se aíslan las células?*\n\n\n???\nLa separación de las células puede llevarse a cabo de diferentes maneras.\n\n--\n\n.pull-right[.image-90[![Imagen en blanco y negro de una mujer en el laboratorio usando la boca para pipetear células de un tubo de ensayo a otro.](../../images/scrna-intro/mouthpipette.jpg)]]\n\n.pull-left[\n.reduce90[\n* Pipeteo manual:\n   * Usa un tubo fino de vidrio para succionar las células\n   * Mantén la presión en el tubo\n   * Transporta el material a un nuevo entorno\n   * Libera la presión del tubo\n]\n]\n\n???\nUn método es el pipeteo manual, donde el laboratorista succiona cada célula usando un tubo largo y fino.\n\n\n--\n\n.pull-left[\n.reduce90[\n* Repetir 1000 veces hasta aislar 1000 células\n  * Propenso a errores\n]\n]\n\n???\nPueden hacer esto cientos de veces para aislar cientos de células, pero es propenso a errores yy a menudo se aíslan varias células juntas.\n\n\n--\n\n.pull-left[\n.reduce90[\n* Pipeteo automático:\n  * Citometría de flujo\n]\n]\n\n???\nOtro método es la citometría de flujo, en el que se reduce el error humano como componente de esta etapa.\n\n---\n\n# Captura / Clasificación: Citometría de Flujo\n\n.pull-right[![Caricatura de un sistema de flujo con dos láseres apuntando a un lente que dirige el rayo de luz para incidir en el flujo de células. La luz pasa por filtros y detectores ópticos para medir la cantidad de luz reflejada mediante un detector acoplado a un sistema electrónico.](../../images/scrna-intro/opticssystem.png)]\n\n.pull-left[\n.reduce90[\n* Las células fluyen en un líquido a lo largo de un tubo estrecho.\n  * La estrechez permite el paso de las células una por una.\n  * El fluido es suficiente para permitir el alto rendimiento.\n]\n]\n\n.pull-left[\n.reduce90[\n* Cada célula es examinada con un láser para verificar sus propiedades:\n   * Tamaño y tipo de célula\n      * Dispersión frontal y Dispersión lateral\n   * Tipo de célula designada según la fluorescencia\n     *  Marcadores de superficie celular (CDs)\n     *  Designación gracias a la fluorescencia\n]\n]\n\n.pull-left[\n.reduce90[\n* Separación de una célula en su propio entorno de secuenciación.\n]\n]\n\n???\n- La citometría de flujo hace flotar las células en un baño líquido poco profundo y las hace desplazarse a lo largo de un canal estrecho, lo justo solo para que pase una célula a través.\n- Las células pueden ser examinadas según sus propiedades, tales como la dispersión de la luz y la designación gracias a la fluorescencia.\n- De esta manera las células pueden ser marcadas y separadas.\n\n---\n\n# Captura / Clasificación: Tamaño y Tipo\n\n.pull-right[\n  ![Misma caricatura mostrada anteriormente](../../images/scrna-intro/opticssystem.png)\n]\n\n\n.pull-left[\n*Dispersión Óptica*\n  * Ratio del tamaño de la célula: Longitud de onda\n  * Si el Tamaño de la célula < a la longitud de la onda (~400nm)\n    * Dispersión de baja intensidad y de alta inconsistencia\n\n  * Medido en términos:\n     * Dispersión frontal (FSC, por sus siglas en inglés: Forward Scatter)\n     * Dispersión lateral (SSC, por sus siglas en inglés: Side Scatter)\n\n]\n\n???\n- Las propiedades de la dispersión óptica pueden ser usadas para confirmar el tamaño y la consistencia de la célula, donde las células más pequeñas que la longitud de la onda del láser producen bajas intensidades y patrones de dispersión más inconsistentes.\n- Existen dos principales tipos de dispersión óptica: la frontal o delantera y la lateral.\n\n---\n\n# Captura / Clasificación: Tamaño y Tipo\n\n.pull-left[\n.reduce90[\n* Dispersión Frontal (FSC)*\n  * Mide a lo largo de la trayectoria del láser\n  * Intensidad FSC es proporcional al diámetro de la célula\n  * Buen indicador para distinguir entre las células inmunitarias.\n]\n]\n\n.image-75[.pull-right[![Mismo diagrama de dispersión, pero ahora los monocitos y granulocitos se muestran como zonas coloreadas.](../../images/scrna-intro/FlowJo_Layouts__01-Mar-2017.jpg)]]\n\n\n???\n- La dispersión frontal se alinea con el láser principal y mide el diámetro de las células, que es ideal para distinguirlas por su tamaño.\n- Por ejemplo, como se ve en el eje X de la imagen, los monocitos, que son típicamente más grandes que los linfocitos.\n\n--\n\n.pull-left[\n.reduce90[\n<br />\n\n*Dispersion Lateral (SSC)*\n  * Mide 90° con respecto al láser, a lo largo del trayecto de las células\n  * Mide intensidades mucho más débiles que FSC\n  * Refracción/reflexión es proporcional a la granulometría de la célula\n]\n]\n\n.image-75[.pull-right[![Mismo diagrama de dispersión, pero ahora los monocitos y granulocitos se muestran como zonas coloreadas.](../../images/scrna-intro/Granulocytes_vs_Monocytes_scatter.jpg)]]\n\n\n???\nLa dispersión lateral es perpendicular al láser principal y mide la granularidad de la célula, ideal para distinguir las que tienen estructuras internas menos definidas, por ejemplo como los granulocitos que se observan en el eje Y de la imagen.\n\n---\n\n# Captura / Clasificación: FACS\n\n.pull-left[\n![Diagrama de dispersión dividido en cuatro regiones mostrando CD4+/- y CD8+/-](../../images/scrna-intro/CD8vsCD3.png)\n.footnote[.reduce70[Image from BD Biosciences]]\n]\n\n.pull-right[\n.reduce90[\n*Fluorescence-Activated Cell Sorting (FACS)*\n  * Marcadores de la superficie de la células\n    * Marcadores fluorescentes para cada célula\n  * Positivo y Negativo\n    * Si la célula es activada para ese CD o no\n  * Traza diferentes marcadores CD contra los otros\n    *Aisla poblaciones celulares\n  * Puede establecer umbrales de activación para aislar el análisis en un subconjunto enriquecido de células\n\n]\n]\n\n???\n- Las células también pueden seleccionarse y caracterizarse por sus marcadores de superficie celular mediante FACS.\n- Al representar gráficamente diferentes intensidades de marcadores de superficie entre sí, las células pueden separarse, seleccionarse y etiquetarse en función de estas propiedades fluorescentes.\n\n---\n\n# Barcoding Cells\n\n.center[![Grupos de GGG y TCT se agregan a dos células diferentes para etiquetarlas.](../../images/scrna-intro/scrna_pbb_barcodes_add.svg)]\n\n.footnote[Agregar un código de barras único a cada transcrito en la célula]\n\n???\n- Una vez aisladas, las células pueden tener un código de barras.\n- Los códigos de barras son secuencias únicas que se agregan a cada molécula de ARN.\n- No son exclusivos de la molécula, sino exclusivos de la célula, de modo que dos moléculas de ARN serán marcadas con el mismo código de barras de la célula, en caso de que existan en la misma célula.\n- Las moléculas de ARN de diferentes células tendrán diferentes códigos de barras.\n\n---\n\n# Barcoding Cells\n\n.footnote[Coloque las células en la placa de secuenciación]\n\n.pull-left[![Las células con códigos de barras se colocan en placas con pozos individuales según su código de barras.](../../images/scrna-intro/scrna_pbb_barcodes_overview.svg)]\n\n.pull-right[\n.reduce90[\n* De un conjunto de muchos *muchos* tejidos / células de muestras diferentes:\n\n   * Los códigos de barras de la célula nos dicen de qué célula proviene el transcrito\n   * Los UMI (Unique Molecular Identifier / Identificador Molecular Único) pueden decirnos cuánto se amplifió la transcripción, comparándola con otras transcripciones del mismo gen con la misma etiqueta UMI\n.\n]\n]\n\n???\nUna vez que las moléculas de ARN han sido etiquetadas con los códigos de barras de las células, pueden ser amplificadas, ya sea por separado o agrupadas, donde los productos amplificados comparten los mismos códigos de barras de células que sus contrapartes originales.\n\n---\n\n### Problemas de secuenciación: Amplificación\n\n.center[.image-75[![Caricatura de una célula donde se muestran dos transcritos representados con una hebra roja y una azul. La hebra roja se amplifica bien mientras que la azul no.](../../images/scrna-intro/amplification_errors.svg)]]\n\n.reduce90[\n* Polymerase Chain Reaction (PCR) / Reacción en cadena de la polimerasa\n   * Toma un solo fragmento y lo duplica\n   * Funciona bien cuando hay suficientes fragmentos en el grupo\n* Baja cobertura\n   * Cuando los fragmentos en el grupo de secuenciación son bajos, muchos se perderán\n   * Puede conducir la amplificación en un solo sentido\n]\n\n???\n- La PCR amplifica los productos génicos para hacerlos  detectables más fácilmente durante la secuenciación.\n- Cuando hay una gran cantidad de producto génico para amplificar, como es el caso del  bulk RNA-seq, la PCR funciona bastante bien para amplificar todos los productos de una manera razonablemente bien representada.\n- Sin embargo, en el caso de los productos single-cell, la cantidad a amplificar es muy pequeña y muchas lecturas únicas pueden perderse durante esta fase, mientras que otras pueden estar sobre-amplificadas, como se muestra en las transcripciones azul y roja del ejemplo.\n\n---\n\n### Problemas de secuenciación: Amp. + UMIs\n\n.pull-left[![La misma caricatura, pero ahora las hebras rojas y azules están etiquetadas con adaptadores rosas y grises. Ambas hebras rojo y azul se amplifican pero a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n\n.pull-right[\n.reduce90[\n* ¿Cuántas transcritos rojos hay en la célula?\n\n* ¿Después de la amplificación por PCR?\n\n* ¿Qué hacen las pequeñas etiquetas de colores al comienzo de cada transcripción?\n\n\n* Identificadores moleculares únicos (UMI)\n\n* Agregado para ayudar a mitigar el sesgo de la amplificación.\n]\n]\n\n???\n\n- Para protegernos contra este tipo de sesgo de amplificación, podemos agregar un elemento aleatorio al código de barras.\n- Estos códigos de barras aleatorios, conocidos como UMI, etiquetan únicamente las transcripciones de modo que es probable que dos transcripciones del mismo gen tengan diferentes códigos de barras aleatorios.\n\n---\n\n### Problemas de secuenciación: Amp. + UMIs\n\n.pull-left[![La misma caricatura, con las hebras rojas y azules que se amplifican a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n\n.pull-right[\n\n.center[Cuantificación de fragmentos\n\n|          | Reads |\n|---------:|:-----:|\n|  **Rojo** | 6     |\n| **Azul** | 3     |\n\n]\n]\n\n???\n- Consideremos el ejemplo de la izquierda: tenemos 2 transcritos rojos y 2 transcripciones azules dentro de la celda, que después de la amplificación equivalen a 6 transcripciones rojas y 3 transcripciones azules.\n- Si tuviéramos que comparar la expresión diferencial de los genes contenidos en las transcripciones rojas y azules, con solo mirar los fragmentos amplificados, llegaríamos a la falsa conclusión de que las transcripciones rojas se expresan dos veces más que las azules.\n\n\n--\n\n.pull-left[\n\n.center[Agrupación de fragmentos de acuerdo con los genes y UMI\n\n|          | **UMIs** | **Reads** |\n|---------:|:--------:|:-----------:|\n|  **Rojo** | Rosa     | 2           |\n|          | Cyan     | 4           |\n| **Azul** | Rosa     | 1           |\n|          | Verde    | 2           |\n\n]\n]\n\n.pull-right[\n\n.center[Cuantificación los fragmentos desduplicados (únicos)\n\n|          | **UMIs (Grouped)** | **# UMIs** |\n|---------:|:------------------:|:-----------:|\n|  **Rojo** | {Rosa, Cyan}       | 2           |\n| **Azul** | {Rosa, Verde}      | 2           |\n\n]\n]\n\n???\nSin embargo, si agrupamos los fragmentos por sus UMIs, y luego contamos solo el número de los UMIs únicos por transcripción, eliminando la duplicación de los fragmentos que comparten la misma transcripción y UMIs, llegamos a 2 fragmentos rojas y 2 lecturas azules que representan mejor el verdadero número de transcritos.\n\n\n---\n\n### Problemas de secuenciación: ¿UMIs únicos?\n\n\n.pull-left[![La misma caricatura, con las hebras rojas y azules que se amplifican a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n.pull-right[\n\n|          | **UMIs** | **#Fragmentos** |\n|---------:|:------------------:|:-----------:|\n|  **Rojo** | {Rosa, Cyan}       | 2           |\n| **Azul** | {Rosa, Verde}      | 2           |\n\n.reduce90[\n* El rosa aparece dos veces en genes diferentes.\n* ¿En qué contexto son únicos los UMI?\n]\n\n]\n\n???\n- Los UMI son relativamente aleatorios, pero no lo son verdaderamente.\n- Observe que el UMI rosa aparece dos veces: una en la transcripción azul y otra en la transcripción roja.\n\n\n--\n\n<br />\n\n.reduce90[\n* ¿Puede cada transcripción en una célula tener su propio UMI?\n\n* ¿Número de transcripciones de ARNm en una célula?\n  * ~ 10⁵ to 10⁶ en una célula de mamífero.\n\n* Requiere un mínimo de códigos de barras de longitud *N*, donde 4ᴺ = 10⁵\n]\n\n???\nEsto se debe a que a menudo hay más transcripciones que UMI disponibles, que dependen de la cantidad de transcripciones en una célula y de la longitud del código de barras.\n\n---\n\n# Problemas de secuenciación: ¿UMIs únicos?\n\n.center[Códigos de barras de longitud *N* Con Distancia de Edición *B*:]\n\n.pull-left[\n\n.center[*N = 5* y *B = 1*]\n\n```\nAAAAA AAAAC AAAAG AAAAT AAACA ····\nCCCCC CCCCA CCCCG CCCCT CCCAC ····\n              ·\n              ·\n              ·\n```\n\n.center[*4⁵ = 1024* códigos de barras]\n\n]\n\n.pull-right[\n\n.center[*N = 5* y *B = 2*]\n\n```\nAAAAA AAACC AAAGG AAATT AACCA ····\nCCCCC CCCAA CCCGG CCCTT CCCAA ····\n              ·\n              ·\n              ·\n```\n\n.center[*4⁵⁻¹ = 512* códigos de barras]\n\n]\n\n.footnote[\n\nLas Distancias de Edición  protegen contra ** errores de secuenciación**.\n\n]\n\n???\n\n- Considere un conjunto de códigos de barras de longitud 5 con una distancia de edición de 1 entre códigos de barras adyacentes y otro conjunto con una distancia de edición de 2.\n- El primero no es robusto contra los errores de secuenciación comunes de 1 par de bases, pero el segundo solo permite la mitad del número de códigos de barras.\n- Esta compensación entre la cantidad de códigos de barras disponibles y la protección contra errores de secuenciación es fundamental en el diseño de códigos de barras de células y UMI.\n\n---\n\n# Problemas de secuenciación: ¿UMIs únicos?\n\n.pull-left[![La misma caricatura, con las hebras rojas y azules que se amplifican a diferentes velocidades.](../../images/scrna-intro/scrna_amplif_errors_umis.svg)]\n.pull-right[\n\n|          | **UMIs**      | **# Fragmentos** |\n|---------:|:-------------:|:----------:|\n|  **Rojo** | {Rosa, Cyan}  | 2          |\n| **Azul** | {Rosa, Verde} | 2          |\n\n.reduce90[\n* El rosa aparece dos veces en diferentes genes\n* ¿En qué contexto son los UMIs únicos?\n\n<br />\n<br />\n\n]\n\n]\n\n.reduce90[\n*¿En qué contexto son los UMIs únicos?*\n  * UMIs son \"sal aleatoria\"\n    * 'Suficientemente único' a nivel de transcripción\n\n  * Deseamos contar solo las transcripciones\n    * Deduplicación de UMI a nivel de transcritos\n    * Buena estimación de la verdadera abundancia de las transcripciones\n]\n\n???\nEn el contexto de la amplificación, las UMI no necesitan ser únicas, solo necesitan ser lo suficientemente aleatorias para deduplicar las transcripciones a fin de dar una estimación más precisa del número de transcripciones dentro de una celda.\n\n---\n\n# Códigos de Barra de las Células y los UMIs (Recap)\n\nPara cada célula:\n\n1. Agrega el código de barras a la célula\n![Se agregan grupos de GGG y TCT a dos células diferentes para etiquetarlas.]](../../images/scrna-intro/scrna_pbb_barcodes_add.svg)\n\n???\nAsí que recapitulemos lo que hemos aprendido: primero, cada célula tiene un código de barras celular que a su vez es agregado a cada molécula de ARN en cada célula.\n\n---\n\n# Códigos de Barra de las Células y los UMIs (Recap)\n\nPara cada célula:\n\n1. Agrega el código de barras celular\n1. Agrega los UMIs a la células que ya tienen el código de barra celular\n![Se muestran mezclas aleatorias de códigos de barras de tres letras. Además de las células mostradas en la caricatura anterior donde las lecturas estaban etiquetadas con GGG en una célula y TCT en la otra, ahora todas tienen prefijos aleatorios antes del GGG y TCT.](../../images/scrna-intro/scrna_umi_add.svg)\n\n\n???\n- Luego agregamos los UMI aleatorios a todas las transcripciones, que etiquetan aún más las moléculas.\n- Luego se pueden utilizar para deduplicar las transcripciones después de la amplificación.\n- Después de la amplificación, debemos realizar algunos controles de calidad.\n\n---\n\n# Control de calidad (QC): Superando el ruido de fondo\n\n.center[![Una matriz de genes 1, 2, 3 y células por columna se convierte en dos matrices, una con recuentos de genes detectados por célula y otra con recuentos de células detectadas por gen.](../../images/scrna-intro/raceid_libsize.svg)]\n\n* El número de características por célula y el tamaño de la biblioteca deben seguir una curva normal\n* El filtrado de Min-Max ayuda a cortar las colas gruesas de la distribución\n\n???\n- Una forma de hacerlo es establecer umbrales en los límites de detección de genes y células.\n- Considera un análisis en el que están involucrados solo 3 genes (G1, G2 y G3) y 5 células (A, B, C, D y E).\n- La primera fila de la tabla superior define el tamaño de la biblioteca, que es el número total de ARN mensajeros en todos los genes de cada célula.\n- Las filas siguientes son los umbrales de detección de genes, que muestran cuántos genes se detectan en cada célula para genes superiores a las cantidades umbral de 0 a 4.\n- Vemos que incluso un umbral de más de 3 transcritos detectados en una célula determinada todavía mantiene 3 células en el análisis: B, C y E. En la tabla inferior, se representa lo contrario, con el número total de transcritos en todas las células para cada gen.\n- Al establecer umbrales de detección, podemos ver cuántas células describe el gen para ese umbral.\n- En ambos casos, podemos ver que si establecemos los umbrales demasiado bajos, corremos el riesgo de mantener genes o células de baja calidad, pero si establecemos los umbrales de detectabilidad demasiado altos, corremos el riesgo de perder demasiados.\n\n---\n\n# Normalización: Bulk vs Single-Cell\n\n.pull-left[\n\n*Bulk RNA-seq*: Alta Cobertura\n\n|            |  T1 | T2 | T3 |\n|:-----------|----:|---:|----|\n| **GenA** | 100 | 80 | 40 |\n| **GenB** |  45 | 30 | 40 |\n\n.reduce70[* La expresión genética media es alta]\n\n\n<br />\n\n*scRNA-seq*: Muy baja profundidad de secuenciación\n\n|            | C1 | C2 | C3 | C4 | C5 |\n|:-----------|---:|---:|---:|---:|---:|\n| **GenA** |  0 |  0 |  2 |  0 |  1 |\n| **GenB** |  2 |  0 | 15 |  0 |  0 |\n\n.reduce70[* La expresión genética media es cero]\n\n]\n\n\n.pull-right[\n\n__¿Por qué esto es un problema?__\n\n.center[\n$$R(s,g) = \\frac{X\\\\_{sg}}{(\\prod\\\\_{s} X\\\\_{s})^{\\frac{1}{n}}}$$\n\n$$DESeq(s,g) = \\frac{X\\\\_{sg}}{Med(R\\\\_{s})}$$\n\n]\n]\n\n\n???\n- Sin embargo, el filtrado puede ser un lujo, ya que muchos conjuntos de datos de single-cell RNA-seq tienen normalmente una profundidad de secuenciación baja en comparación con bulk RNA-seq.\n- Durante el proceso de normalización, las muestras se escalan entre sí para hacerlas más comparables.\n- Esto se realiza normalmente mediante el uso de valores medianos. Por ejemplo, para la normalización DE-Seq, se toma el recuento de la media geométrica de una célula y cada valor de gen en esa célula se divide por él y por el valor mediano de todas las medias geométricas de todas las células.\n- Si la mediana de la expresión génica es alta, este método de normalización funciona bastante bien.\n\n\n--\n\n.pull-right[\n¡No se puede dividir entre cero!\n]\n\n???\n- Pero si la mediana de la expresión génica es cero, como suele ocurrir con los datos de una sola célula, entonces tenemos el problema de dividir entre cero.\n- Existen métodos para sortear estos recuentos de cero.\n\n\n---\n\n# Normalización: método SCRAN\n\n.footnote[.small[[*Pooling across cells to normalize single-cell RNA sequencing data with many zero counts*, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n.pull-left[![Las burbujas azules y rojas se mezclan, luego se separan en dos grupos y a continuación se organizan alrededor de un círculo, el rojo va de pequeño a grande alrededor de la mitad derecha y el azul de pequeño a grande alrededor de la izquierda. La parte inferior del círculo tiene la etiqueta 6 y la parte superior tiene la etiqueta 12.](../../images/scrna-intro/scran_pooling_left.svg)]\n\n\n.pull-right[\n.reduce90[\n1. Calcula el tamaño de la biblioteca de todas las células.\n\n2. Calcula el tamaño de la biblioteca de una célula de pseudo referencia (promedio)\n\n3. Separa los tamaños impares (rojo) y los tamaños pares (azul) en dos grupos\n\n4. Ordena cada grupo por tamaño de biblioteca y lo coloca en lados opuestos de un \"anillo\"\n]\n]\n\n???\n- Uno de estos métodos es SCRAN, que funciona creando grupos superpuestos de células, de modo que cualquier célula individual se describe por células de tamaños de biblioteca similares.\n- El método implica dividir todas las células en un grupo par e impar por el tamaño de su biblioteca, y organizarlas en una estructura de anillo donde las células vecinas en el anillo tienen tamaños similares.\n\n\n---\n\n# Normalización: método SCRAN\n\n.footnote[.small[[*Pooling across cells to normalize single-cell RNA sequencing data with many zero counts*, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n\n.pull-right[![El mismo gráfico final con círculos azules y rojos de tamaño creciente con una flecha apuntando a una gran cantidad de fórmulas que se superponen.](../../images/scrna-intro/scran_pooling_right.svg)]\n\n.pull-left[\n.reduce90[\n1. Define grupos superpuestos de células adyacentes de tamaño *k*\n\n2. Para cada grupo\n     1. Suma los tamaños de biblioteca de todas las células dentro del grupo\n     2. Obtiene un factor de tamaño dividiendo por la célula de referencia\n\n3. Para cada célula\n     1. Encuentra los grupos a los que pertenece\n     2. Construye un modelo lineal usando estos factores de tamaño\n     3. Estima el factor de tamaño de la célula en dicho modelo lineal\n\n\n]\n]\n\n???\n- Se definen grupos superpuestos de tamaño fijo, lo que da como resultado que cada célula sea definida por múltiples grupos.\n- Un modelo lineal para esa célula puede entonces ser construido por los grupos en los que se encuentra, y los factores de normalización para todas las células se pueden determinar de esta manera.\n\n\n---\n\n# Normalización: método SCRAN\n\n\n.footnote[.small[[*Pooling across cells to normalize single-cell RNA sequencing data with many zero counts*, Lun et al., 2016](https://doi.org/10.1186/s13059-016-0947-7)]]\n\n.center[![Las dos figuras anteriores integradas en una sola.](../../images/scrna-intro/scran_pooling.svg)]\n\n???\n- Con este método, el problema de baja cobertura se soluciona convirtiendo las células con tamaños de biblioteca bajos en componentes útiles de un factor de tamaño que se puede aplicar a células similares.\n- Estos métodos de normalización novedosos eran algo común hace unos años, pero a medida que las tecnologías de secuenciación han mejorado, el problema de muchos recuentos de cero en la matriz se vuelve menos importante y los factores de tamaño de normalización se pueden derivar utilizando bulk RNA-seq una vez más.\n\n\n---\n\n# Variación deseada vs no deseada\n\n.pull-right[![Tres gráficos de líneas superpuestas mapean la contribución de la varianza a la densidad. Se muestra que en los genes N con más cambio aumenta la densidad a medida que la contribución de la varianza aumenta, mientras que los genes por célula, el número de transcritos y la fuente del lote disminuyen.](../../images/scrna-intro/variance.svg)]\n\n.pull-left[\n.reduce90[\n*Variación deseada*\n  * Expresión de los genes con valores más altos de expresión diferencial\n\n* Variación no deseada *\n   * \"Factores de confusión\"\n   * Variación técnica\n      * Fuente de lote\n      * Tamaño de la biblioteca\n   * Variación biológica\n      * Ruido celular intrínseco\n\n\n]\n]\n\n???\n- Otros factores que debemos tener en cuenta durante un análisis de single-cell RNA-seq son los factores no deseados que pueden confundir el análisis.\n- Lo ideal sería que los perfiles genéticos que separan los diferentes tipos de células estén impulsados por la varianza biológica.\n- Sin embargo, existen variables de confusión tanto de fuentes técnicas como biológicas que no son útiles para el análisis pero contribuyen a la varianza.\n\n\n---\n\n# Variables de confusión: Biológicas\n\n\n.center[![La caricatura de la izquierda muestra un signo de interrogación con flechas que apuntan a un resultado vacío y a los transcritos generados. A la derecha están las fases del ciclo celular y diferentes cantidades de transcritos sintetizados en cada fase.](../../images/scrna-intro/raceid_cellcycle.svg)]\n\n.pull-left[\n.reduce90[\n.center[*Transcripción en ráfagas (“Transcription bursting”)*]\n * La transcripción no es continua, ocurre en \"ráfagas\"\n * Fenómeno oculto en bulk RNA-seq\n]\n]\n\n.pull-right[\n.reduce90[\n.center[*Ciclo Celular*]\n * Células del mismo tipo tienen el doble de ARNm en la fase M que en la fase G1\n]\n]\n\n???\n- La varianza de confusión biológica aparece en dos formas: transcripción en ráfagas y variación del ciclo celular.\n- La transcripción en ráfagas es un fenómeno que ocurre en células en las que la transcripción ocurre en estados discretos de activo e inactivo, donde el intervalo entre estos estados es difícil de modelar.\n- En bulk RNA-seq, este fenómeno es imperceptible ya que los efectos se promedian en muchas células. Pero en experimentos de single-cell, dos células del mismo tipo pueden exhibir diferentes perfiles genéticos simplemente porque una célula está transcribiendo activamente y la otra no.\n- Esto no es algo que podamos controlar en el análisis, pero es algo que debemos tener en cuenta al comprender el ruido en el agrupamiento de células.\n- La variación del ciclo celular, por otro lado, es un proceso mucho mejor entendido, donde la cantidad de ARN en una célula es aproximadamente el doble que la de una célula del mismo tipo debido a que una se encuentra en la fase G1 temprana y la otra en la fase M durante el ciclo celular.\n- Hay genes que se sabe que covarían con el ciclo celular, por lo que al hacer una regresión del efecto de estos genes, podemos controlar el ciclo celular.\n\n\n---\n\n# Variables de confusión: Técnicas\n\n.center[![La variación del tamaño de la biblioteca apunta a dos células con transcritos rojos y azules en números idénticos. Sin embargo, durante la amplificación, en una célula se produce un número de copias distinto al esperado mientras que en la otra se elimina por completo uno de los transcritos.](../../images/scrna-intro/raceid_technical_variation.svg)]\n\n.pull-left[\n.reduce90[\n*Sesgo de Amplificación*\n* Diferentes transcritos se amplifican más que otros\n* Mitigación vía UMIs\n]\n]\n\n.pull-left[\n.reduce90[\n*Eventos de marginación*\n* Algunos genes no se detectan falsamente en las células\n* Mitigación vía mejores métodos de captura y normalización\n]\n]\n\n???\n- La varianza de confusión técnica aparece en tres formas: sesgo de amplificación, eventos de marginación y variación del tamaño de la biblioteca.\n- El sesgo de amplificación puede mitigarse mediante UMI como se demostró anteriormente.\n- Los eventos de marginación dan lugar a los ceros predominantes en las matrices de recuento, y su efecto se puede reducir utilizando técnicas de normalización inteligentes como el método de agrupación mostrado anteriormente, así como utilizando mejores métodos de secuenciación.\n\n\n---\n\n# Variables de confusión: Técnicas\n\n.center[![La variación del tamaño de la biblioteca apunta a dos células con transcritos rojos y azules en números idénticos. Sin embargo, durante la amplificación, en una célula se produce un número de copias distinto al esperado mientras que en la otra se elimina por completo uno de los transcritos.](../../images/scrna-intro/raceid_technical_variation.svg)]\n\n*Variación del tamaño de la biblioteca*\n* Las células tienen diferentes tasas de transcripción y captura\n* Mitigación vía normalización\n\n???\n- La variación del tamaño de la biblioteca surge por una variedad de razones, pero es la fuente principal de variación dentro de un análisis.\n- Al igual que en bulk RNA-seq, esto se reduce con buenos métodos de normalización.\n\n\n---\n\n# Relaciones entre Células\n\nConsidera:\n * 1,000s de Células\n * 10,000s de Genes\n * 10k dimensiones en el conjunto de datos, con 1k observaciones\n\nObjetivo:\n * Encontrar grupos de células en un subconjunto de estos genes\n\nNota:\n* Algunas células pueden tener una expresión muy similar en un gen y una expresión muy diferente en todos los demás\n* ¿Cómo representamos esto?\n\n???\n- Una vez que hemos eliminado los factores de confusión no deseados del análisis, tenemos el problema de cuantificar las relaciones entre las células.\n- Desde el punto de vista del análisis de datos, tratamos a cada célula como una observación y a cada gen como una variable.\n- Para genomas grandes, esto significa conjuntos de datos de dimensiones extremadamente altas. Las células existen como puntos en este espacio de alta dimensión muy escasamente poblado, lo que dificulta ver las agrupaciones naturales.\n- El espacio de alta dimensión se puede reducir mucho simplemente filtrando los genes que no parecen expresarse diferencialmente en todas las células.\n- Sin embargo, para encontrar las relaciones entre células, necesitamos definir las distancias entre ellas.\n\n\n\n---\n\n# Matriz de Distancias\n\n![Se muestra una matriz de recuento de genes para cada célula en un espacio N-dimensional con cada gen representando los diferentes ejes. Con base en la fórmula de distancia para 3 dimensiones, se obtiene la tabla final de la matriz de conteos con las distancias entre cada una de las células basada en su conteo de genes.](../../images/scrna-intro/raceid_distance.svg)\n\n???\n- Una matriz de distancias hace exactamente esto, definir la distancia entre dos células cualesquiera mediante un solo valor de puntuación.\n- Aquí usamos la distancia euclidiana en un conjunto de datos tridimensional de 3 genes (G1, G2 y G3) y 3 células (R, P y V).\n- La distancia entre dos células cualesquiera se puede calcular como la suma de los cuadrados de la diferencia en los valores de los genes.\n- Observa cómo la matriz de distancias es simétrica a lo largo de la diagonal, lo que confirma que, por ejemplo, la distancia de las celdas R a V es la distancia de V a R como se espera.\n\n\n---\n\n# Relación de las células: KNN\n\n![Se muestra una gráfica de distancias entre células a través de tres genes con la etiqueta ‘high dimensional dataset of cells’. Esto produce una matriz de distancias simétrica y luego a través de KNN con k = 2, se genera una matriz no simétrica, y se traza nuevamente en el espacio dimensional de genes para mostrar las conexiones entre las células.](../../images/scrna-intro/scrna_knn.svg)\n\n* Ejecutar *K-nearest neighbours* para conectar vértices representados por células.\n\n???\n- Una vez que se genera una matriz de distancia, podemos realizar K-nearest neighbours para generar bordes dirigidos entre células.\n- Para cada fila de la matriz de distancia, se seleccionan K de las células con los valores de distancia más pequeños que representan el vecino más cercano que tiene la célula de la fila actual a las células de la columna seleccionada.\n- Si los bordes se comparten mutuamente entre células vecinas, esto se denomina enfoque de vecino más cercano compartido.\n\n\n---\n\n# Reducción dimensional\n\n![La matriz de genes contra células se traza en tantas dimensiones como genes y luego se reduce a 2 dimensiones.](../../images/scrna-intro/raceid_dimred.svg)\n\n.pull-left[\n.reduce90[\n*Objetivo:*\n* Tomar un conjunto de datos de alta dimensión y reducirlo a una dimensión más baja que podamos entender.\n  * ejemplo: 10000-D → 2D\n]\n]\n\n.pull-right[\n.reduce90[\n*Restricción:*\n* Conservar la topología de alta dimensión en un espacio de baja dimensión.\n   * ejemplo: si la celda A está lejos de la celda D pero cerca de la celda B en 3D, se deberían replicar esas relaciones en 2D.\n\n]\n]\n\n???\n- Podemos representar este espacio tridimensional fácilmente como 3 ejes independientes con puntos que representen las células.\n- Y extrapolar este conjunto de ejemplos de dimensiones relativamente bajas a un conjunto de datos reales de miles de dimensiones que está más allá del alcance de la posibilidad humana.\n- La reducción dimensional es un tipo de técnica que toma un conjunto de datos de alta dimensión y produce una representación de baja dimensión, generalmente bidimensional, que intenta preservar las distancias entre los puntos.\n- Aquí las diferencias relativas entre células se mantienen tanto en las representaciones de alta y baja dimensión.\n- Hay muchos tipos diferentes de técnicas de reducción de dimensiones, cada una con sus propias fortalezas y debilidades que dependen del tipo y la dimensionalidad de los datos.\n\n\n---\n\n### Agrupamiento\n\n.pull-left[.image-100[![Diagrama de dispersión con muchos grupos de celdas etiquetadas con diferentes colores. Las células están en gran parte agrupadas, con pocas células periféricas.](../../images/scrna-intro/singlecellplot3.png)]]\n\n.pull-right[\n.reduce90[\n1. Proyección en dos dimensiones\n   * Cada punto es una célula\n   * Agrupar puntos por color, donde las células de diferentes colores pertenecen a diferentes grupos\n   * Diferentes grupos representan diferentes tipos de células\n]\n]\n\n???\n- Una vez que el número de variables del conjunto de datos se ha reducido lo suficiente mediante el filtrado y la reducción dimensional, la agrupación se puede realizar más fácilmente.\n- Aquí, en esta proyección de dos dimensiones, cada círculo es una célula y los colores únicos representan los grupos a los que han sido asignadas.\n- Las distancias físicas entre los grupos de células coloreadas nos dicen qué tan bueno es el agrupamiento para esta proyección.\n\n\n---\n\n### Agrupamiento\n\n.pull-left[.image-100[![Mismo diagrama de dispersión mostrando el agrupamiento de células, pero ahora los grupos están etiquetados de acuerdo al tipo de célula como ‘Neurons’, ‘NSC’, ‘Glial Prog.’, ‘Astrocytes’, etc.]](../../images/scrna-intro/singlecellplot4.png)]]\n\n.pull-right[\n.reduce90[\n1. Proyección en dos dimensiones\n2. Tipos discretos de células\n  * Cada grupo debe representar un diferente tipo de célula\n  * Buscar los genes expresados de manera más diferencial en cada grupo\n    * Encontrar los genes marcadores → Tipo de Célula\n]\n]\n\n???\n- Al inspeccionar los principales genes expresados diferencialmente en cada grupo frente a todos los demás grupos, se pueden encontrar pistas sobre el tipo de célula que describe el grupo.\n- Los tipos de células a menudo se caracterizan por la expresión de genes marcadores específicos, y la presencia de estos genes son fuertes indicadores del tipo.\n- El descubrimiento de genes marcadores se puede utilizar para anotar los grupos.\n\n\n---\n\n### Agrupamiento\n\n.pull-left[.image-100[![Mismo diagrama de dispersión mostrando el agrupamiento de células con los grupos etiquetados de acuerdo al tipo de célula y con flechas indicando al grupo vecino más cercano](../../images/scrna-intro/singlecellplot6.png)]]\n\n.pull-right[\n.reduce90[\n1. Proyección en dos dimensiones\n2. Tipos discretos de células\n3. Relaciones inferidas por Linaje\n  * Células madre neuronales (Neural Stem Cells) diferenciadas en tipos de células maduras\n  * Los árboles de linaje se construyen teniendo en cuenta:\n     * La entropía del grupo\n     * La proximidad del grupo\n]\n]\n\n???\nTambién podemos derivar aún más las relaciones entre estos grupos calculando árboles de linaje en función de la cantidad de ruido en cada grupo, con la expectativa de que las células madre tengan perfiles de expresión ruidosos que produzcan grupos más amplios, y las células maduras tengan perfiles de expresión muy claros que produzcan grupos más apretados.\n\n\n---\n\n## Agrupamiento: Duro vs Suave\n\n\n|  |  |\n|--|--|\n| .image-100[![Mismo conjunto de datos mostrando grupos distintos con una separación muy clara]](../../images/scrna-intro/singlecellplot3.png)] | .image-100[![Los grupos ahora se mezclan entre sí y la separación no es clara.](../../images/scrna-intro/10xdata.png)] |\n| .center[**Duro**] | .center[**Suave**] |\n| Espacios grandes entre grupos | Los grupos sobrelapan |\n| Los tipos de células están bien definidos y el agrupamiento lo refleja | Los tipos de células parecen entremezclarse |\n\n\n???\n- Los tipos de agrupación que es probable que encuentres en un análisis dependen de los conjuntos de datos de entrada, donde es menos probable que las células tomadas de muestras en etapa tardía se agrupen juntas y es más probable que produzcan grandes lagunas visibles conocidas como agrupamiento duro que claramente definen diferentes tipos.\n- Es más probable que los conjuntos de datos de etapas tempranas produzcan grupos más suaves, donde los grupos vecinos comparten límites suaves a medida que éstos se entremezclan ligeramente entre sí.\n\n\n---\n\n# Fenotipos Continuos:\n\n.center[![El gráfico muestra el tiempo de desarrollo de los reticulocitos a medida que pasan por una fase celular intermedia o rara hasta su forma final: glóbulos rojos.](../../images/scrna-intro/raceid_contpheno.svg)]\n.reduce90[\n* Los tipos de células no son discretos, las células están en transición\n* Cambio continuo en el tiempo de un tipo menos maduro a un tipo más maduro\n]\n\n???\nEs de esperar un agrupamiento suave, ya que aunque el agrupamiento es un método estadístico para dividir datos de manera discreta, la biología celular subyacente de los datos es un proceso continuo, donde las células pasan de un estado bien definido a otro a través de etapas intermedias que se representan en entre dos centros de grupos.\n\n---\n\n## Agrupando\n\n.pull-left[\n![Perfiles de expresión discretos: Se muestran tres montañas con nubes de las que sólo vemos tres picos. En rojo, verde y azul se representan tipos de células en los picos. Paisaje de expresión continua: las nubes se eliminan y vemos que las montañas están realmente conectadas y hay células intermedias en varios colores de transición.]](../../images/scrna-intro/raceid_mountains.svg)\n]\n\n.pull-right[\n.reduce90[\n*Conjuntos de datos dinámicos con grupos continuamente dinámicos*\n  * Conjuntos de datos de single-cell\n  * PCA es demasiado discreto en la partición de datos\n  * Múltiples algoritmos de aprendizaje, aprende el “panorama”\n\n\n*Variedad de métodos de agrupación*\n\n  * K-means (K-medias)\n  * K-medians (K-medianas)\n  * Agrupación jerárquica\n  * Agrupación comunitaria\n]\n]\n\n\n???\n- Debido a la naturaleza continua de estos conjuntos de datos single-cell y a su dimensionalidad extremadamente alta, la partición discreta es a menudo un modelo deficiente.\n- Si, en cambio, asumimos que los grupos de células están relacionados entre sí a través de células de transición que naturalmente se encontrarían entre grupos, entonces las múltiples técnicas de aprendizaje son más adecuadas.\n- Estas técnicas derivan un panorama de expresión que no solo se puede usar para relacionar grupos entre sí, sino que también se puede usar para inferir linaje y jerarquía.\n- Para realizar la agrupación tal cuál, hay tres métodos de uso común: K-means, agrupación jerárquica y agrupación comunitaria.\n\n\n\n---\n\n### Agrupando: K-means (K-medias)\n\n.pull-right[![Figura animada que muestra varias iteraciones de un algoritmo que optimiza una división de 3 vías en un diagrama de dispersión de células. No hay un límite claro que haga que el resultado final parezca solo un poco mejor.](../../images/scrna-intro/kmeans.gif)]\n\n.pull-left[\n.reduce90[\n*K-means (K-medias)*\n   1. Inicializar *k* posiciones aleatorias\n   2. Paso de iteración:\n      1. Calcule la distancia desde cada célula a cada posición *k*\n      2. Asigna cada célula a su *k* más cercano\n      3. Establecer nuevas posiciones *k* en la posición media de todas las células de ese grupo\n\n*K-medians (K-medianas)*\n   * Igual que el anterior, pero usa la posición mediana en su lugar\n   * Menos influenciado por valores atípicos\n\n]\n]\n\n???\n- K-means (K-medias) y K-medians (K-medianas) siguen el mismo método: el número de grupos se define de antemano y se inicializa en posiciones aleatorias.\n- Las posiciones se actualizan luego por la contribución de las células más cercanas a él que a otras posiciones.\n- Este proceso ocurre varias veces hasta que las posiciones ya no cambian significativamente o hasta que se alcanza un número determinado de iteraciones.\n- La asignación final de cada célula se convierte en la asignación del grupo.\n\n---\n\n## Agrupando: Tipo jerárquico\n\n.pull-left[![Una figura de muchos pasos que comienza con varios grupos o ‘clusters’ individuales. El texto dice ‘Identificar los dos grupos más cercanos’ y ‘Fusionar los dos grupos más similares’. El proceso se repite varias veces hasta que todos los grupos quedan absorbidos en uno solo.](../../images/scrna-intro/hierarchal1.png)]\n\n.pull-right[\n.reduce90[\n* Usa la matriz de distancias para encontrar los dos puntos más cercanos\n* Combina y repite\n\n* Produce un dendrograma\n  * Jerarquía de grupos:\n\n.pull-right[.image-90[![Varios puntos están etiquetados de la A a la F, a la derecha se muestra un dendrograma donde las longitudes de las ramas indican la distancia entre las letras.](../../images/scrna-intro/hierarchal2.png)]\n\n???\n- La agrupación jerárquica es más flexible y no necesita un parámetro inicial para definir el número de grupos resultantes.\n- Aquí los dos puntos más cercanos en una matriz de distancias se unen en un solo grupo, las distancias se recalculan y los siguientes dos puntos más cercanos se vuelven a unir.\n- Este proceso se repite hasta que todos los datos se han consumido en uno.\n- Al rastrear el proceso hacia atrás, se puede establecer una jerarquía que está representada por un dendrograma.\n\n\n---\n\n\n## Agrupación comunitaria: Louvain\n\n.center[![Se muestra un gráfico con puntos conectados por líneas. Abajo, esos puntos se han expandido quedando el rosa muy cerca del naranja y del morado. Cuando se cuantifica el número de enlaces que tiene el nodo rosa se obtienen 4 enlaces externos y 0 enlaces internos. A continuación se muestran dos opciones hipotéticas: si el rosa absorbe el morado, vemos 5 conexiones externas y 1 interna, entonces, se agregan nuevas conexiones, que no es lo deseable. En cambio, si el rosa absorbe al naranja, vemos 3 conexiones externas y 1 interna, por lo que una conexión se ha convertido en interna y no hay nuevos nodos conectados. Esta reducción de enlaces externos es la opción correcta.](../../images/scrna-intro/commgraph1.svg)]\n\n.reduce90[\nObjetivo: Maximizar los enlaces internos y minimizar los enlaces externos\n]\n\n???\n- El agrupamiento de Louvain es un tipo de agrupamiento comunitario ampliamente utilizado para datos de single-cell.\n- Aquí a cada célula se le asigna un vecindario propio y se cuenta el número de enlaces internos y externos entre vecindarios.\n- Para cada iteración, se selecciona una célula aleatoria y se coloca dentro de la vecindad de otra célula, y los enlaces internos y externos se cuentan una vez más.\n- Si la nueva configuración ha reducido el número de enlaces externos a favor de más enlaces internos, entonces se mantiene la configuración.\n\n\n---\n\n## Agrupación comunitaria: Louvain\n\n.center[![El mismo gráfico de antes mostrando más pasos permitidos de absorción entre los nodos, lo que deriva en un gráfico simplificado de 4 nodos con dos conexiones cada uno.](../../images/scrna-intro/commgraph2.svg)]\n\n.reduce90[\n* Elige una célula al azar e intenta colocarla en el grupo de un vecino\n  * Acepta si la relación interno:externo aumenta\n  * Rechaza y elige otro\n]\n\n???\nSi, en cambio, la nueva configuración ha aumentado el número de enlaces externos, la configuración se rechaza y se selecciona y prueba otra célula. Al realizar esto varias veces, se construye una estructura comunitaria de células con el grado de especificidad que desee el usuario.\n\n---\n\n# Resumen\n\n.pull-left[![Se muestran grupos de células rojas y azules que se asemejan a las manchas de tejido mostradas en las primeras diapositivas. A la derecha, se muestran gráficos de la expresión de los genes A, B, X por célula.](../../images/scrna-intro/rna_cells_singlerez.svg)]\n\n.pull-right[\n.reduce90[\n* Los conjuntos de datos de una sola célula son vastos y están escasamente poblados\n\n* Se requiere filtrado y normalización de calidad\n\n* La selección de funciones y la reducción de dimensiones reducen la complejidad\n\n* La agrupación denota tipos de células y relaciones de células\n\n* scRNA-seq es un campo impulsado estadísticamente\n\n* Hay muchas formas de analizar los datos.\n  * ¡Juega con ello!\n]\n]\n\n???\n- El análisis de single-cell no es trivial, y cada etapa, desde el filtrado hasta la normalización, la reducción de dimensiones y el agrupamiento, puede afectar drásticamente el resultado del análisis.\n- Debido a la variabilidad en el análisis, uno no debe entrar en pánico ante la incertidumbre.\n- El objetivo es jugar con los datos hasta que comiencen a reflejar la biología.\n- Esto puede requerir muchos intentos para lograrlo, y puede que nunca sea perfecto, pero la idea es probar tantas formas diferentes como sea posible para ver a qué conclusiones sólidas se puede llegar.\n\n\n---\n\n### Análisis adicionales de datos de scRNA-seq\n\n![Captura de pantalla de los materiales de apoyo disponibles en Galaxy que cubren el análisis de datos de Single Cell.](../../images/scrna-intro/training_single_cell.png)\n\n???\n- En este sentido, los vastos recursos de UseGalaxy se pueden aprovechar probando diferentes caminos de análisis, y Galaxy Training Network ofrece tutoriales y capacitaciones prácticas para ayudarte.\n- Exploralos para desarrollar mejor su comprensión del tema.\n"],"hands_on":false,"slides":true,"mod_date":"2024-05-29 14:28:52 +0000","pub_date":"2021-01-29 16:45:13 +0000","version":6,"api":"https://training.galaxyproject.org/training-material/api/topics/single-cell/tutorials/scrna-intro/tutorial.json","tools":[],"supported_servers":{"exact":[],"inexact":[{"name":"UseGalaxy.eu","url":"https://usegalaxy.eu","id":"eu","human":"Galaxy Europe","usegalaxy":true},{"name":"UseGalaxy.org","url":"https://usegalaxy.org","id":"us","human":"Galaxy Main","usegalaxy":true},{"name":"UseGalaxy.org.au","url":"https://usegalaxy.org.au","id":"au","human":"Galaxy Australia","usegalaxy":true},{"name":"UseGalaxy.fr","url":"https://usegalaxy.fr","id":"fr","human":"Galaxy France","usegalaxy":true}]},"topic_name_human":"Single Cell","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"slides_recordings":[{"captioners":["mtekman"],"date":"2021-02-15","galaxy_version":"21.01","length":"20M","youtube_id":"D3qvYWZMFa0","speakers":["awspolly"]}],"translations":{"tutorial":[],"slides":[],"video":true},"license":"CC-BY-4.0","type":"tutorial"}