{"layout":"tutorial_slides","logo":"GTN","license":"MIT","copyright":"© Copyright 2022 C. Li","title":"Friends Don't Let Friends Make Bad Graphs","contributions":{"authorship":["cxli233"],"editing":["hexylena"]},"video":true,"voice":{"id":"Brian","lang":"en-GB","neural":true},"js_requirements":{"mathjax":null,"mermaid":false},"short_id":"S00112","url":"/topics/visualisation/tutorials/bad-graphs/slides.html","topic_name":"visualisation","tutorial_name":"bad-graphs","dir":"topics/visualisation/tutorials/bad-graphs","symlink":null,"id":"visualisation/bad-graphs","ref_tutorials":[],"ref_slides":["# Friends Don't Let Friends Make Bad Graphs\n\nThis is an *opinionated* essay about good and bad practices in data visualization.\n\nThis material is MIT licensed and adapted from [cxli233/FriendsDontLetFriends](https://github.com/cxli233/FriendsDontLetFriends).\n\nR Code for generating the graphs is available in that repository.\n\n???\n\n- This is an opinionated essay about good and bad practices in data visualization.\n- This material is MIT licensed and adapted from cxli233's work\n- Please see the linked repository for the source for each of these graphs as well as more links and details.\n\n---\n\n## 1. Friends Don't Let Friends Make Bar Plots for Means Separation\n\n\n![No Bar Plots for Means Separation](images/dont_bar_plot.png)\n\n.footnote[inspired by many tweets the author saw on limitations of the bar graph. See e.g. <span class=\"citation\"><a href=\"https://doi.org/10.1371/journal.pbio.1002128\">Weissgerber <i>et al.</i> 2015</a></span>]\n\n???\n\n- This has to be the first one.\n- Means separation plots are some of the most common in scientific publications.\n- We have two or more groups, which contains multiple observations; they may have different means, variances, and distributions.\n- The task of the visualization is to show the means and the spread (dispersion) of the data.\n- In this example, two groups have similar means and standard deviations, but quite different distributions.\n- Are they really \"the same\"?\n- Just don't use bar plot for means separation, or at least check a couple things before settling down on a bar plot.\n- It's worth mentioning that I was inspired by many researchers who have tweeted on the limitation of bar graphs.\n\n---\n\n## 2. Friends Don't Let Friends Make Violin Plots for Small Sample Sizes\n\n![Beware of Violin Plots for Small Sample Sizes](images/Beware_of_small_n_box_violin_plot.png)\n\n???\n\n- This is quite common in the literature as well, but unfortunately, violin plots (or any sort of smoothed distribution curves) make no sense for small n.\n- Distributions and quartiles can vary widely with small n, even if the underlying observations are similar.\n- Distribution and quartiles are only meaningful with large n.\n- I did an experiment before, where I sampled the same normal distribution several times and computed the quartiles for each sample.\n- The quartiles only stablize when n gets larger than 50.\n\n---\n\n## 3. Friends Don't Let Friends Use Bidirectional Color Scales for Unidirectional Data\n\n![Are You Using the Right Color Scale for Your Data?](images/ColorScales.png)\n\n???\n\n- Excuse my language, but this is a truly data visualization sin, and again quite common.\n- I can understand why this error is common, because it appears that many of us have not spent a lot of thoughts on this issue.\n- Color scales are pretty, but we have to be extra careful.\n- When color scales (or color gradients) are used to represent numerical data, the darkest and lightest colors should have special meanings.\n- You can decide what those special meanings are: e.g., max, min, mean, zero. But they should represent something meaningful.\n- A data visualization sin for heat maps/color gradients is when the lightest or darkers colors are some arbitrary numbers.\n- This is as bad as the longest bar in a bar chart not being the largest value. Can you imagine that?\n\n---\n\n## 4. Friends Don't Let Friends Make Bar Plot Meadow\n\n![Horrendous Giant Bar Plot vs. Better Designed Plot](images/AvoidBarPlotMeadow.png)\n\n.footnote[Data from <span class=\"citation\"><a href=\"https://doi.org/10.1186/s12870-020-2243-7\">Matand <i>et al.</i> 2020</a></span>]\n\n???\n\n- We talked about no bar charts for mean separation, but this is a different issue.\n- It has to do with presenting results of a multi-factorial experiment.\n- Bar plot meadows are very common in scientific publications and unfortunately also ineffective in communicating the results.\n- Bar plot meadows are common because multi-factorial experiments are common.\n- However, a bar plot meadow is poorly designed for its purpose.\n- To communicate results of a multi-factorial experiment, it requires thoughtful designs regarding grouping/faceting by factors of interest.\n- In this example, I focus on comparing the effect of `Treatment` & `Explant` on `Response` at the level of each `Variety`.\n- However, if the focus is the effect of `Treatment` & `Variety` on `Response` at the level of each `Exaplant`, then it will require a different layout.\n\n---\n\n## 5. Friends Don't Let Friends Make Heatmap without (Considering) Reordering Rows & Columns\n\n![A Heatmap before and after reordering rows and columns](images/Reorder_rows_and_columns_for_heatmap.png)\n\n.footnote[Data from <span class=\"citation\"><a href=\"https://doi.org/10.1101/2022.07.04.498697\">Li <i>et al.</i> 2022</a></span>]\n\n???\n\n- Heatmaps are very common in scientific publications, and very very common in omics papers.\n- However, for heatmaps to be effective, we have to consider the ordering of rows and columns.\n- In this example, I have cells as columns and features as rows. Grids are showing z scores.\n- It is impossible to get anything useful out of the heatmap without reordering rows and columns.\n- We can reorder rows and columns using clustering, but that is not the only way.\n- Of course, if the rows and columns are mapping to physical entities (rows and columns of a 96-well plate), then you can't reorder them.\n- But it is a very good idea to at least consider reordering rows and columns.\n\n---\n\n### Bonus: heatmaps can be very pretty\n\n\n![aRt with Heatmap](images/Abstract_R_2022_11_24.png)\n\n.footnote[\n  [R Code](https://github.com/cxli233/FriendsDontLetFriends/blob/main/Scripts/Abstract_aRt.R),\n  [Tutorial on reordering](https://github.com/cxli233/FriendsDontLetFriends/blob/main/Heatmap_tutorial.md)\n]\n\n???\n\n- Heatmaps can be very pretty...if you are good are reordering rows/columns and choosing color gradients.\n- Here is an example \"abstract aRt\" generated from simulated data.\n\n\n## 6. Friends Don't Let Friends Make Heatmap without Checking Outliers\n\n\n![Did you check outliers](images/Check_outliers_for_heatmap.png)\n\n???\n\n- Outliers in heatmap can really change how we perceive and interpret the visualization.\n- This generalizes to all sort of visualizations that use colors to represent numeric data.\n- Let me show you an example:\n- In this example, I have 2 observations. For each observations, I measured 20 features.\n- Without checking for outliers, it may appear that the 2 observations are overall similar, except at 2 features.\n- However, after maxing out the color scale around 95th percentile of the data, it reveals that the two observations are distinct across all features.\n\n---\n\n## 7. Friends Don't Let Friends Forget to Check Data Range at Each Factor Level\n\n\n![Did you check data range at each factor level](images/Check_range_at_factor_level.png)\n\n???\n\n- This is a common issue that many of us have encountered.\n- In a multifactor experiment, sometimes the range of the response variable changes widely between different factor levels.\n- This hypothetical experiment measured 3 compounds across 2 groups (control vs. treatment).\n- Without checking data range for each compound, you will likely have missed that the treatment had a strong effect on compound 1.\n- This is because the concentration of compound 1 has a much narrower range than the other compounds in this experiment.\n\n---\n\n## 8. Friends Don't Let Friends Make Network Graphs without Trying Different Layouts\n\n\n![Try different network layouts](images/TryDifferentLayouts.png)\n\n.footnote[Data from <span class=\"citation\"><a href=\"https://doi.org/10.1101/2022.07.04.498697\">Li <i>et al.</i> 2022</a></span>]\n\n???\n\n- Network graphs are common in scientific publications. They are super useful in presenting relationship data.\n- However, the apparence (not the topology) of the network can make a huge difference in determing if a network graph is effective.\n- Layouts can drastically change the appearance of networks, making them easier or harder to interpret.\n- Here are 3 network graphs from the same data. They look very different from each other.\n\n---\n\n## 9. Friends Don't Let Friends Confuse Position-based Visualizations with Length-based Visualizations\n\n![Position vs. length based visualizations](images/Position_and_length_based_visualizations.png)\n\n???\n\n- This is always the elephant in the room and the essence of many misleading visualizations.\n- In this example, I measured a response variable across 3 time points.\n- Two of the following graphs are fine, but one of them is a data visualization crime. Can you see why?\n- In dot and line plots, values are represented by positions along the x and y axis.\n- The same idea applies to other position based visualizations, such as box plots.\n- In bar plots, values are represented by the distance from the x axis, and thus the length of the bar.\n- The 3rd graph is not 0-based, which makes the bar length at time point 2 about 3x longer than that at time point 1.\n- In fact, the true difference in means is closer to 1.6x.\n- I hope you can see how confusing length and position based visualizations can lead to misleading graphs.\n\n---\n\n### Watch out for bar plots with broken axis\n\n![Broken axis](images/Broken_axis.png)\n\n.footnote[[Example R Code](https://github.com/cxli233/FriendsDontLetFriends/blob/main/Scripts/Broken_axis.R)]\n\n???\n\n- Broken axis may be useful for depicting data across a wide range of numeric values.\n- (Alternatively, log scaled axis can be used instead.)\n- Broken axis are fine for position based graphics, because the data are represented by positions along the axis.\n- However, we must be very careful with bar plots that have broken axis. Here is an example.\n- In this example, two graphs (left vs. right) are showing the same data.\n- However, by changing where the axis is broken, one can make certain bars looks longer or shorter.\n- In this example, the length of bar \"d\" can look really different.\n- The illusion of bar \"d\" being very short on the right graph boils down to bar plot being a length based graphics, not a position based graphics.\n\n---\n\n## 10. Friends Don't Let Friends Make Pie Chart\n\n![Don't make pie charts](images/dont_pie_chart.png)\n\n???\n\n- Pie chart is a common type of visualization for fractional data, where fractions add up to 100%.\n- This is achieved by dividing a circle into sectors, and the sectors add up to a full circle.\n- Pie charts have been criticized, because human are much worse in reading angles and area than reading lengths.\n- In this example, we have two groups, each contains 4 sub-categories.\n- In classic pie charts, the angles (and thus arc lengths & sector area) represent the data.\n- The problem is that it is very difficult to compare between groups.\n- We can visually simplify the pie chart into donut charts, where the data are now represented by arc lengths.\n- However, if we want to use lengths to represent the data, why don't we just unwrap the donut and make stacked bars?\n- In stacked bar graphs, bars are shown side-by-side and thus easier to compare across groups.\n- Fun fact: the scripts underlying stacked bars are much simpler than those underlying the pie charts and donut charts.\n- If you want to produce sub-optimal graph types with ggplot, you actually have to work extra hard.\n\n---\n\n## 11. Friends Don't Let Friends Make Concentric Donuts\n\n![Don't make concentric donuts](images/dont_concentric_donuts.png)\n\n???\n\n- In this example, we have 3 groups, each of which contains two sub-categories (Type I or Type II).\n- In concentric donuts, you might be tempted to say the data are represented by the arc lengths, which is in fact inaccurate.\n- The arc lengths on the outer rings are much longer than those in the inner rings.\n- Group 2 and Group 3 have the same exact values, but the arc lengths of Group 3 are much longer.\n- In fact the data are represented by the arc angles, which we are bad at reading.\n- Since outer rings are longer, the ordering of the groups (which group goes to which ring) has a big impact on the impression of the plot.\n- It can lead to the apparent paradox where larger values have shorter arcs.\n- The better (and simpler!) alternative is just unwrap the donuts and make a good old stacked bar plot.\n- BTW, this is also my main issue with circos plots and other circular plot layouts.\n\n---\n\n## 12. Friends Don't Let Friends Use Red/Green and Rainbow color scales\n\n![are you making a \"safe\" heatmap?](images/Color_blind_grey_scale_safe_heatmap.png)\n\n???\n\n- Deuteranomaly is the most common type of red/green colorblindness, occurring in 1/16 male and 1/256 female.\n- Any color scales that use shades of red and shades of green in the same time would be a problem for a person with red/green colorblindness (third column of the figure).\n- In addition, red/green and rainbow do not preserve information well at all when printed on black/white (grey scale, second column in figure).\n- Many scientific software still use red/green or rainbow as the default color scales, which drives me crazy.\n- More \"modern\" color scales, such as viridis are both colorblind-friendly and grey scale-safe (third row of figure).\n- And they look nice too.\n\n---\n\n## 13. Friends Don't Let Friends Forget to Reorder Stacked Bar Plot\n\n![Reorder your stacked bars](images/Reorder_stacked_bars.png)\n\n.footnote[[Tutorial on optimising](https://github.com/cxli233/FriendsDontLetFriends/blob/main/Scripts/stacked_bars_optimization.Rmd).]\n\n???\n\n- Stacked bar plots are useful for visualizing proportion data.\n- Stacked bar plots are commonly used to visualize community structure or population structure or admixture analysis.\n- This kind of visualization boils down to a collection of samples, where each sample contains multiple classes of members.\n- However, when we have many samples and many classes, stacked bar plots need to be optimized to be effective.\n- And by \"optimize\" I mean the grouping and ordering of samples.\n- Here we have an example data with 100 samples and 8 classes of member.\n- Due to the number of samples and classes, it is very hard to discern anything from this graph without optimizing the order of bars. What the heck am I looking at?\n- After reordering the bars, wow, that really made a difference, don't you think?\n"],"hands_on":false,"slides":true,"mod_date":"2023-11-20 12:42:06 +0000","pub_date":"2023-11-20 11:37:02 +0000","version":5,"api":"https://training.galaxyproject.org/training-material/api/topics/visualisation/tutorials/bad-graphs/tutorial.json","tools":[],"supported_servers":{"exact":[],"inexact":[{"name":"UseGalaxy.eu","url":"https://usegalaxy.eu","id":"eu","human":"Galaxy Europe","usegalaxy":true},{"name":"UseGalaxy.org","url":"https://usegalaxy.org","id":"us","human":"Galaxy Main","usegalaxy":true},{"name":"UseGalaxy.org.au","url":"https://usegalaxy.org.au","id":"au","human":"Galaxy Australia","usegalaxy":true},{"name":"UseGalaxy.fr","url":"https://usegalaxy.fr","id":"fr","human":"Galaxy France","usegalaxy":true}]},"topic_name_human":"Visualisation","admin_install":{"install_tool_dependencies":true,"install_repository_dependencies":true,"install_resolver_dependencies":true,"tools":[]},"admin_install_yaml":"---\ninstall_tool_dependencies: true\ninstall_repository_dependencies: true\ninstall_resolver_dependencies: true\ntools: []\n","tours":false,"slides_recordings":false,"translations":{"tutorial":[],"slides":[],"video":true},"type":"tutorial","contributors":[{"name":"Chenxin Li","joined":"2023-11","id":"cxli233","url":"https://training.galaxyproject.org/training-material/api/contributors/cxli233.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/cxli233/"},{"name":"Helena Rasche","orcid":"0000-0001-9760-8992","maintainer_contact":"gitter","matrix":"hexylena:matrix.org","joined":"2017-09","elixir_node":"nl","affiliations":["gallantries","by-covid","erasmusmc","elixir-europe","elixir-converge"],"former_affiliations":["deNBI","avans-atgm","uni-freiburg"],"contact_for_training":false,"location":{"country":"NL","lat":51.91,"lon":4.46},"id":"hexylena","url":"https://training.galaxyproject.org/training-material/api/contributors/hexylena.json","page":"https://training.galaxyproject.org/training-material/hall-of-fame/hexylena/"}],"redirect_from":["/short/visualisation/bad-graphs/slides","/short/S00112"]}